etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
typedef struct
{
	__IO uint32_t CR;			/*!< RCC clock control register,                                  Address offset: 0x00
								   */
	__IO uint32_t PLLCFGR;		/*!< RCC PLL configuration register,                              Address offset: 0x04
								   */
	__IO uint32_t CFGR;			/*!< RCC clock configuration register,                            Address offset: 0x08
								   */
	__IO uint32_t CIR;			/*!< RCC clock interrupt register,                                Address offset: 0x0C
								   */
	__IO uint32_t AHB1RSTR;		/*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10
								   */
	__IO uint32_t AHB2RSTR;		/*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14
								   */
	__IO uint32_t AHB3RSTR;		/*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18
								   */
	uint32_t RESERVED0;			/*!< Reserved, 0x1C
								                                                                      */
	__IO uint32_t APB1RSTR;		/*!< RCC APB1 peripheral reset register,                          Address offset: 0x20
								   */
	__IO uint32_t APB2RSTR;		/*!< RCC APB2 peripheral reset register,                          Address offset: 0x24
								   */
	uint32_t RESERVED1[2];		/*!< Reserved, 0x28-0x2C
								                                                                 */
	__IO uint32_t AHB1ENR;		/*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30
								   */
	__IO uint32_t AHB2ENR;		/*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34
								   */
	__IO uint32_t AHB3ENR;		/*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38
								   */
	uint32_t RESERVED2;			/*!< Reserved, 0x3C
								                                                                      */
	__IO uint32_t APB1ENR;		/*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40
								   */
	__IO uint32_t APB2ENR;		/*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44
								   */
	uint32_t RESERVED3[2];		/*!< Reserved, 0x48-0x4C
								                                                                 */
	__IO uint32_t AHB1LPENR;	/*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50
								   */
	__IO uint32_t AHB2LPENR;	/*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54
								   */
	__IO uint32_t AHB3LPENR;	/*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58
								   */
	uint32_t RESERVED4;			/*!< Reserved, 0x5C
								                                                                      */
	__IO uint32_t APB1LPENR;	/*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60
								   */
	__IO uint32_t APB2LPENR;	/*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64
								   */
	uint32_t RESERVED5[2];		/*!< Reserved, 0x68-0x6C
								                                                                 */
	__IO uint32_t BDCR;			/*!< RCC Backup domain control register,                          Address offset: 0x70
								   */
	__IO uint32_t CSR;			/*!< RCC clock control & status register,                         Address offset: 0x74
								   */
	uint32_t RESERVED6[2];		/*!< Reserved, 0x78-0x7C
								                                                                 */
	__IO uint32_t SSCGR;		/*!< RCC spread spectrum clock generation register,               Address offset: 0x80
								   */
	__IO uint32_t PLLI2SCFGR;	/*!< RCC PLLI2S configuration register,                           Address offset: 0x84
								   */
} RCC_TypeDef;

/**
 * @brief Real-Time Clock
 */

typedef struct
{
	__IO uint32_t TR;	/*!< RTC time register,                                        Address offset: 0x00 */
	__IO uint32_t DR;	/*!< RTC date register,                                        Address offset: 0x04 */
	__IO uint32_t CR;	/*!< RTC control register,                                     Address offset: 0x08 */
	__IO uint32_t ISR;	/*!< RTC initialization and status register,                   Address offset: 0x0C */
	__IO uint32_t PRER;	/*!< RTC prescaler register,                                   Address offset: 0x10 */
	__IO uint32_t WUTR;	/*!< RTC wakeup timer register,                                Address offset: 0x14 */
	__IO uint32_t CALIBR;	/*!< RTC calibration register,                                 Address offset: 0x18 */
	__IO uint32_t ALRMAR;	/*!< RTC alarm A register,                                     Address offset: 0x1C */
	__IO uint32_t ALRMBR;	/*!< RTC alarm B register,                                     Address offset: 0x20 */
	__IO uint32_t WPR;	/*!< RTC write protection register,                            Address offset: 0x24 */
	__IO uint32_t SSR;	/*!< RTC sub second register,                                  Address offset: 0x28 */
	__IO uint32_t SHIFTR;	/*!< RTC shift control register,                               Address offset: 0x2C */
	__IO uint32_t TSTR;	/*!< RTC time stamp time register,                             Address offset: 0x30 */
	__IO uint32_t TSDR;	/*!< RTC time stamp date register,                             Address offset: 0x34 */
	__IO uint32_t TSSSR;/*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
	__IO uint32_t CALR;	/*!< RTC calibration register,                                 Address offset: 0x3C */
	__IO uint32_t TAFCR;/*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
	__IO uint32_t ALRMASSR;	/*!< RTC alarm A sub second register,                          Address offset: 0x44 */
	__IO uint32_t ALRMBSSR;	/*!< RTC alarm B sub second register,                          Address offset: 0x48 */
	uint32_t RESERVED7;	/*!< Reserved, 0x4C                                                                 */
	__IO uint32_t BKP0R;/*!< RTC backup register 1,                                    Address offset: 0x50 */
	__IO uint32_t BKP1R;/*!< RTC backup register 1,                                    Address offset: 0x54 */
	__IO uint32_t BKP2R;/*!< RTC backup register 2,                                    Address offset: 0x58 */
	__IO uint32_t BKP3R;/*!< RTC backup register 3,                                    Address offset: 0x5C */
	__IO uint32_t BKP4R;/*!< RTC backup register 4,                                    Address offset: 0x60 */
	__IO uint32_t BKP5R;/*!< RTC backup register 5,                                    Address offset: 0x64 */
	__IO uint32_t BKP6R;/*!< RTC backup register 6,                                    Address offset: 0x68 */
	__IO uint32_t BKP7R;/*!< RTC backup register 7,                                    Address offset: 0x6C */
	__IO uint32_t BKP8R;/*!< RTC backup register 8,                                    Address offset: 0x70 */
	__IO uint32_t BKP9R;/*!< RTC backup register 9,                                    Address offset: 0x74 */
	__IO uint32_t BKP10R;	/*!< RTC backup register 10,                                   Address offset: 0x78 */
	__IO uint32_t BKP11R;	/*!< RTC backup register 11,                                   Address offset: 0x7C */
	__IO uint32_t BKP12R;	/*!< RTC backup register 12,                                   Address offset: 0x80 */
	__IO uint32_t BKP13R;	/*!< RTC backup register 13,                                   Address offset: 0x84 */
	__IO uint32_t BKP14R;	/*!< RTC backup register 14,                                   Address offset: 0x88 */
	__IO uint32_t BKP15R;	/*!< RTC backup register 15,                                   Address offset: 0x8C */
	__IO uint32_t BKP16R;	/*!< RTC backup register 16,                                   Address offset: 0x90 */
	__IO uint32_t BKP17R;	/*!< RTC backup register 17,                                   Address offset: 0x94 */
	__IO uint32_t BKP18R;	/*!< RTC backup register 18,                                   Address offset: 0x98 */
	__IO uint32_t BKP19R;	/*!< RTC backup register 19,                                   Address offset: 0x9C */
} RTC_TypeDef;

/**
 * @brief SD host Interface
 */

typedef struct
{
	__IO uint32_t POWER;		/*!< SDIO power control register,    Address offset: 0x00 */
	__IO uint32_t CLKCR;		/*!< SDI clock control register,     Address offset: 0x04 */
	__IO uint32_t ARG;			/*!< SDIO argument register,         Address offset: 0x08 */
	__IO uint32_t CMD;			/*!< SDIO command register,          Address offset: 0x0C */
	__I uint32_t RESPCMD;		/*!< SDIO command response register, Address offset: 0x10 */
	__I uint32_t RESP1;			/*!< SDIO response 1 register,       Address offset: 0x14 */
	__I uint32_t RESP2;			/*!< SDIO response 2 register,       Address offset: 0x18 */
	__I uint32_t RESP3;			/*!< SDIO response 3 register,       Address offset: 0x1C */
	__I uint32_t RESP4;			/*!< SDIO response 4 register,       Address offset: 0x20 */
	__IO uint32_t DTIMER;		/*!< SDIO data timer register,       Address offset: 0x24 */
	__IO uint32_t DLEN;			/*!< SDIO data length register,      Address offset: 0x28 */
	__IO uint32_t DCTRL;		/*!< SDIO data control register,     Address offset: 0x2C */
	__I uint32_t DCOUNT;		/*!< SDIO data counter register,     Address offset: 0x30 */
	__I uint32_t STA;			/*!< SDIO status register,           Address offset: 0x34 */
	__IO uint32_t ICR;			/*!< SDIO interrupt clear register,  Address offset: 0x38 */
	__IO uint32_t MASK;			/*!< SDIO mask register,             Address offset: 0x3C */
	uint32_t RESERVED0[2];		/*!< Reserved, 0x40-0x44                                  */
	__I uint32_t FIFOCNT;		/*!< SDIO FIFO counter register,     Address offset: 0x48 */
	uint32_t RESERVED1[13];		/*!< Reserved, 0x4C-0x7C                                  */
	__IO uint32_t FIFO;			/*!< SDIO data FIFO register,        Address offset: 0x80 */
} SDIO_TypeDef;

/**
 * @brief Serial Peripheral Interface
 */

typedef struct
{
	__IO uint16_t CR1;		/*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
	uint16_t RESERVED0;		/*!< Reserved, 0x02                                                           */
	__IO uint16_t CR2;		/*!< SPI control register 2,                             Address offset: 0x04 */
	uint16_t RESERVED1;		/*!< Reserved, 0x06                                                           */
	__IO uint16_t SR;		/*!< SPI status register,                                Address offset: 0x08 */
	uint16_t RESERVED2;		/*!< Reserved, 0x0A                                                           */
	__IO uint16_t DR;		/*!< SPI data register,                                  Address offset: 0x0C */
	uint16_t RESERVED3;		/*!< Reserved, 0x0E                                                           */
	__IO uint16_t CRCPR;	/*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
	uint16_t RESERVED4;		/*!< Reserved, 0x12                                                           */
	__IO uint16_t RXCRCR;	/*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
	uint16_t RESERVED5;		/*!< Reserved, 0x16                                                           */
	__IO uint16_t TXCRCR;	/*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
	uint16_t RESERVED6;		/*!< Reserved, 0x1A                                                           */
	__IO uint16_t I2SCFGR;	/*!< SPI_I2S configuration register,                     Address offset: 0x1C */
	uint16_t RESERVED7;		/*!< Reserved, 0x1E                                                           */
	__IO uint16_t I2SPR;	/*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
	uint16_t RESERVED8;		/*!< Reserved, 0x22                                                           */
} SPI_TypeDef;

/**
 * @brief TIM
 */

typedef struct
{
	__IO uint16_t CR1;		/*!< TIM control register 1,              Address offset: 0x00 */
	uint16_t RESERVED0;		/*!< Reserved, 0x02                                            */
	__IO uint16_t CR2;		/*!< TIM control register 2,              Address offset: 0x04 */
	uint16_t RESERVED1;		/*!< Reserved, 0x06                                            */
	__IO uint16_t SMCR;		/*!< TIM slave mode control register,     Address offset: 0x08 */
	uint16_t RESERVED2;		/*!< Reserved, 0x0A                                            */
	__IO uint16_t DIER;		/*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
	uint16_t RESERVED3;		/*!< Reserved, 0x0E                                            */
	__IO uint16_t SR;		/*!< TIM status register,                 Address offset: 0x10 */
	uint16_t RESERVED4;		/*!< Reserved, 0x12                                            */
	__IO uint16_t EGR;		/*!< TIM event generation register,       Address offset: 0x14 */
	uint16_t RESERVED5;		/*!< Reserved, 0x16                                            */
	__IO uint16_t CCMR1;	/*!< TIM capture/compare mode register 1, Address offset: 0x18 */
	uint16_t RESERVED6;		/*!< Reserved, 0x1A                                            */
	__IO uint16_t CCMR2;	/*!< TIM capture/compare mode register 2, Address offset: 0x1C */
	uint16_t RESERVED7;		/*!< Reserved, 0x1E                                            */
	__IO uint16_t CCER;		/*!< TIM capture/compare enable register, Address offset: 0x20 */
	uint16_t RESERVED8;		/*!< Reserved, 0x22                                            */
	__IO uint32_t CNT;		/*!< TIM counter register,                Address offset: 0x24 */
	__IO uint16_t PSC;		/*!< TIM prescaler,                       Address offset: 0x28 */
	uint16_t RESERVED9;		/*!< Reserved, 0x2A                                            */
	__IO uint32_t ARR;		/*!< TIM auto-reload register,            Address offset: 0x2C */
	__IO uint16_t RCR;		/*!< TIM repetition counter register,     Address offset: 0x30 */
	uint16_t RESERVED10;	/*!< Reserved, 0x32                                            */
	__IO uint32_t CCR1;		/*!< TIM capture/compare register 1,      Address offset: 0x34 */
	__IO uint32_t CCR2;		/*!< TIM capture/compare register 2,      Address offset: 0x38 */
	__IO uint32_t CCR3;		/*!< TIM capture/compare register 3,      Address offset: 0x3C */
	__IO uint32_t CCR4;		/*!< TIM capture/compare register 4,      Address offset: 0x40 */
	__IO uint16_t BDTR;		/*!< TIM break and dead-time register,    Address offset: 0x44 */
	uint16_t RESERVED11;	/*!< Reserved, 0x46                                            */
	__IO uint16_t DCR;		/*!< TIM DMA control register,            Address offset: 0x48 */
	uint16_t RESERVED12;	/*!< Reserved, 0x4A                                            */
	__IO uint16_t DMAR;		/*!< TIM DMA address for full transfer,   Address offset: 0x4C */
	uint16_t RESERVED13;	/*!< Reserved, 0x4E                                            */
	__IO uint16_t OR;		/*!< TIM option register,                 Address offset: 0x50 */
	uint16_t RESERVED14;	/*!< Reserved, 0x52                                            */
} TIM_TypeDef;

/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

typedef struct
{
	__IO uint16_t SR;		/*!< USART Status register,                   Address offset: 0x00 */
	uint16_t RESERVED0;		/*!< Reserved, 0x02                                                */
	__IO uint16_t DR;		/*!< USART Data register,                     Address offset: 0x04 */
	uint16_t RESERVED1;		/*!< Reserved, 0x06                                                */
	__IO uint16_t BRR;		/*!< USART Baud rate register,                Address offset: 0x08 */
	uint16_t RESERVED2;		/*!< Reserved, 0x0A                                                */
	__IO uint16_t CR1;		/*!< USART Control register 1,                Address offset: 0x0C */
	uint16_t RESERVED3;		/*!< Reserved, 0x0E                                                */
	__IO uint16_t CR2;		/*!< USART Control register 2,                Address offset: 0x10 */
	uint16_t RESERVED4;		/*!< Reserved, 0x12                                                */
	__IO uint16_t CR3;		/*!< USART Control register 3,                Address offset: 0x14 */
	uint16_t RESERVED5;		/*!< Reserved, 0x16                                                */
	__IO uint16_t GTPR;		/*!< USART Guard time and prescaler register, Address offset: 0x18 */
	uint16_t RESERVED6;		/*!< Reserved, 0x1A                                                */
} USART_TypeDef;

/**
 * @brief Window WATCHDOG
 */

typedef struct
{
	__IO uint32_t CR;	/*!< WWDG Control register,       Address offset: 0x00 */
	__IO uint32_t CFR;	/*!< WWDG Configuration register, Address offset: 0x04 */
	__IO uint32_t SR;	/*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/**
 * @brief Crypto Processor
 */

typedef struct
{
	__IO uint32_t CR;	/*!< CRYP control register,                            Address offset: 0x00 */
	__IO uint32_t SR;	/*!< CRYP status register,                             Address offset: 0x04 */
	__IO uint32_t DR;	/*!< CRYP data input register,                         Address offset: 0x08 */
	__IO uint32_t DOUT;	/*!< CRYP data output register,                        Address offset: 0x0C */
	__IO uint32_t DMACR;/*!< CRYP DMA control register,                        Address offset: 0x10 */
	__IO uint32_t IMSCR;/*!< CRYP interrupt mask set/clear register,           Address offset: 0x14 */
	__IO uint32_t RISR;	/*!< CRYP raw interrupt status register,               Address offset: 0x18 */
	__IO uint32_t MISR;	/*!< CRYP masked interrupt status register,            Address offset: 0x1C */
	__IO uint32_t K0LR;	/*!< CRYP key left  register 0,                        Address offset: 0x20 */
	__IO uint32_t K0RR;	/*!< CRYP key right register 0,                        Address offset: 0x24 */
	__IO uint32_t K1LR;	/*!< CRYP key left  register 1,                        Address offset: 0x28 */
	__IO uint32_t K1RR;	/*!< CRYP key right register 1,                        Address offset: 0x2C */
	__IO uint32_t K2LR;	/*!< CRYP key left  register 2,                        Address offset: 0x30 */
	__IO uint32_t K2RR;	/*!< CRYP key right register 2,                        Address offset: 0x34 */
	__IO uint32_t K3LR;	/*!< CRYP key left  register 3,                        Address offset: 0x38 */
	__IO uint32_t K3RR;	/*!< CRYP key right register 3,                        Address offset: 0x3C */
	__IO uint32_t IV0LR;/*!< CRYP initialization vector left-word  register 0, Address offset: 0x40 */
	__IO uint32_t IV0RR;/*!< CRYP initialization vector right-word register 0, Address offset: 0x44 */
	__IO uint32_t IV1LR;/*!< CRYP initialization vector left-word  register 1, Address offset: 0x48 */
	__IO uint32_t IV1RR;/*!< CRYP initialization vector right-word register 1, Address offset: 0x4C */
} CRYP_TypeDef;

/**
 * @brief HASH
 */

typedef struct
{
	__IO uint32_t CR;		/*!< HASH control register,          Address offset: 0x00        */
	__IO uint32_t DIN;		/*!< HASH data input register,       Address offset: 0x04        */
	__IO uint32_t STR;		/*!< HASH start register,            Address offset: 0x08        */
	__IO uint32_t HR[5];	/*!< HASH digest registers,          Address offset: 0x0C-0x1C   */
	__IO uint32_t IMR;		/*!< HASH interrupt enable register, Address offset: 0x20        */
	__IO uint32_t SR;		/*!< HASH status register,           Address offset: 0x24        */
	uint32_t RESERVED[52];	/*!< Reserved, 0x28-0xF4                                         */
	__IO uint32_t CSR[51];	/*!< HASH context swap registers,    Address offset: 0x0F8-0x1C0 */
} HASH_TypeDef;

/**
 * @brief HASH
 */

typedef struct
{
	__IO uint32_t CR;	/*!< RNG control register, Address offset: 0x00 */
	__IO uint32_t SR;	/*!< RNG status register,  Address offset: 0x04 */
	__IO uint32_t DR;	/*!< RNG data register,    Address offset: 0x08 */
} RNG_TypeDef;

/**
 * @}
 */

/** @addtogroup Peripheral_memory_map
 * @{
 */
#define FLASH_BASE            ( ( uint32_t )0x08000000 )/*!< FLASH(up to 1 MB) base address in the alias region
														                           */
#define CCMDATARAM_BASE       ( ( uint32_t )0x10000000 )/*!< CCM(core coupled memory) data RAM(64 KB) base address in
														   the alias region  */
#define SRAM1_BASE            ( ( uint32_t )0x20000000 )/*!< SRAM1(112 KB) base address in the alias region
														                               */
#define SRAM2_BASE            ( ( uint32_t )0x2001C000 )/*!< SRAM2(16 KB) base address in the alias region
														                                */
#define PERIPH_BASE           ( ( uint32_t )0x40000000 )/*!< Peripheral base address in the alias region
														                                  */
#define BKPSRAM_BASE          ( ( uint32_t )0x40024000 )/*!< Backup SRAM(4 KB) base address in the alias region
														                           */
#define FSMC_R_BASE           ( ( uint32_t )0xA0000000 )/*!< FSMC registers base address
														                                                  */

#define CCMDATARAM_BB_BASE    ( ( uint32_t )0x12000000 )/*!< CCM(core coupled memory) data RAM(64 KB) base address in
														   the bit-band region  */
#define SRAM1_BB_BASE         ( ( uint32_t )0x22000000 )/*!< SRAM1(112 KB) base address in the bit-band region
														                               */
#define SRAM2_BB_BASE         ( ( uint32_t )0x2201C000 )/*!< SRAM2(16 KB) base address in the bit-band region
														                                */
#define PERIPH_BB_BASE        ( ( uint32_t )0x42000000 )/*!< Peripheral base address in the bit-band region
														                                  */
#define BKPSRAM_BB_BASE       ( ( uint32_t )0x42024000 )/*!< Backup SRAM(4 KB) base address in the bit-band region
														                           */

