etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
                           Peripheral Registers_Bits_Definition
  *****************************************************************************/

/* ****************************************************************************
  
                          Analog to Digital Converter
  
  ****************************************************************************
  *******************  Bit definition for ADC_SR register  ********************/
#define  ADC_SR_AWD                          ( ( uint8_t )0x01 )				/*!<Analog watchdog flag */
#define  ADC_SR_EOC                          ( ( uint8_t )0x02 )				/*!<End of conversion */
#define  ADC_SR_JEOC                         ( ( uint8_t )0x04 )				/*!<Injected channel end of conversion
																				   */
#define  ADC_SR_JSTRT                        ( ( uint8_t )0x08 )				/*!<Injected channel Start flag */
#define  ADC_SR_STRT                         ( ( uint8_t )0x10 )				/*!<Regular channel Start flag */
#define  ADC_SR_OVR                          ( ( uint8_t )0x20 )				/*!<Overrun flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define  ADC_CR1_AWDCH                       ( ( uint32_t )0x0000001F )			/*!<AWDCH[4:0] bits (Analog watchdog
																				   channel select bits) */
#define  ADC_CR1_AWDCH_0                     ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  ADC_CR1_AWDCH_1                     ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  ADC_CR1_AWDCH_2                     ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  ADC_CR1_AWDCH_3                     ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  ADC_CR1_AWDCH_4                     ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  ADC_CR1_EOCIE                       ( ( uint32_t )0x00000020 )			/*!<Interrupt enable for EOC */
#define  ADC_CR1_AWDIE                       ( ( uint32_t )0x00000040 )			/*!<AAnalog Watchdog interrupt enable */
#define  ADC_CR1_JEOCIE                      ( ( uint32_t )0x00000080 )			/*!<Interrupt enable for injected
																				   channels */
#define  ADC_CR1_SCAN                        ( ( uint32_t )0x00000100 )			/*!<Scan mode */
#define  ADC_CR1_AWDSGL                      ( ( uint32_t )0x00000200 )			/*!<Enable the watchdog on a single
																				   channel in scan mode */
#define  ADC_CR1_JAUTO                       ( ( uint32_t )0x00000400 )			/*!<Automatic injected group conversion
																				   */
#define  ADC_CR1_DISCEN                      ( ( uint32_t )0x00000800 )			/*!<Discontinuous mode on regular
																				   channels */
#define  ADC_CR1_JDISCEN                     ( ( uint32_t )0x00001000 )			/*!<Discontinuous mode on injected
																				   channels */
#define  ADC_CR1_DISCNUM                     ( ( uint32_t )0x0000E000 )			/*!<DISCNUM[2:0] bits (Discontinuous
																				   mode channel count) */
#define  ADC_CR1_DISCNUM_0                   ( ( uint32_t )0x00002000 )			/*!<Bit 0 */
#define  ADC_CR1_DISCNUM_1                   ( ( uint32_t )0x00004000 )			/*!<Bit 1 */
#define  ADC_CR1_DISCNUM_2                   ( ( uint32_t )0x00008000 )			/*!<Bit 2 */
#define  ADC_CR1_JAWDEN                      ( ( uint32_t )0x00400000 )			/*!<Analog watchdog enable on injected
																				   channels */
#define  ADC_CR1_AWDEN                       ( ( uint32_t )0x00800000 )			/*!<Analog watchdog enable on regular
																				   channels */
#define  ADC_CR1_RES                         ( ( uint32_t )0x03000000 )			/*!<RES[2:0] bits (Resolution) */
#define  ADC_CR1_RES_0                       ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  ADC_CR1_RES_1                       ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  ADC_CR1_OVRIE                       ( ( uint32_t )0x04000000 )			/*!<overrun interrupt enable */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define  ADC_CR2_ADON                        ( ( uint32_t )0x00000001 )			/*!<A/D Converter ON / OFF */
#define  ADC_CR2_CONT                        ( ( uint32_t )0x00000002 )			/*!<Continuous Conversion */
#define  ADC_CR2_DMA                         ( ( uint32_t )0x00000100 )			/*!<Direct Memory access mode */
#define  ADC_CR2_DDS                         ( ( uint32_t )0x00000200 )			/*!<DMA disable selection (Single ADC)
																				   */
#define  ADC_CR2_EOCS                        ( ( uint32_t )0x00000400 )			/*!<End of conversion selection */
#define  ADC_CR2_ALIGN                       ( ( uint32_t )0x00000800 )			/*!<Data Alignment */
#define  ADC_CR2_JEXTSEL                     ( ( uint32_t )0x000F0000 )			/*!<JEXTSEL[3:0] bits (External event
																				   select for injected group) */
#define  ADC_CR2_JEXTSEL_0                   ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  ADC_CR2_JEXTSEL_1                   ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  ADC_CR2_JEXTSEL_2                   ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  ADC_CR2_JEXTSEL_3                   ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  ADC_CR2_JEXTEN                      ( ( uint32_t )0x00300000 )			/*!<JEXTEN[1:0] bits (External Trigger
																				   Conversion mode for injected
																				   channelsp) */
#define  ADC_CR2_JEXTEN_0                    ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  ADC_CR2_JEXTEN_1                    ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  ADC_CR2_JSWSTART                    ( ( uint32_t )0x00400000 )			/*!<Start Conversion of injected
																				   channels */
#define  ADC_CR2_EXTSEL                      ( ( uint32_t )0x0F000000 )			/*!<EXTSEL[3:0] bits (External Event
																				   Select for regular group) */
#define  ADC_CR2_EXTSEL_0                    ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  ADC_CR2_EXTSEL_1                    ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  ADC_CR2_EXTSEL_2                    ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  ADC_CR2_EXTSEL_3                    ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  ADC_CR2_EXTEN                       ( ( uint32_t )0x30000000 )			/*!<EXTEN[1:0] bits (External Trigger
																				   Conversion mode for regular
																				   channelsp) */
#define  ADC_CR2_EXTEN_0                     ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  ADC_CR2_EXTEN_1                     ( ( uint32_t )0x20000000 )			/*!<Bit 1 */
#define  ADC_CR2_SWSTART                     ( ( uint32_t )0x40000000 )			/*!<Start Conversion of regular channels
																				   */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define  ADC_SMPR1_SMP10                     ( ( uint32_t )0x00000007 )			/*!<SMP10[2:0] bits (Channel 10 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP10_0                   ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP10_1                   ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP10_2                   ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP11                     ( ( uint32_t )0x00000038 )			/*!<SMP11[2:0] bits (Channel 11 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP11_0                   ( ( uint32_t )0x00000008 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP11_1                   ( ( uint32_t )0x00000010 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP11_2                   ( ( uint32_t )0x00000020 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP12                     ( ( uint32_t )0x000001C0 )			/*!<SMP12[2:0] bits (Channel 12 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP12_0                   ( ( uint32_t )0x00000040 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP12_1                   ( ( uint32_t )0x00000080 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP12_2                   ( ( uint32_t )0x00000100 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP13                     ( ( uint32_t )0x00000E00 )			/*!<SMP13[2:0] bits (Channel 13 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP13_0                   ( ( uint32_t )0x00000200 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP13_1                   ( ( uint32_t )0x00000400 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP13_2                   ( ( uint32_t )0x00000800 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP14                     ( ( uint32_t )0x00007000 )			/*!<SMP14[2:0] bits (Channel 14 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP14_0                   ( ( uint32_t )0x00001000 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP14_1                   ( ( uint32_t )0x00002000 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP14_2                   ( ( uint32_t )0x00004000 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP15                     ( ( uint32_t )0x00038000 )			/*!<SMP15[2:0] bits (Channel 15 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP15_0                   ( ( uint32_t )0x00008000 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP15_1                   ( ( uint32_t )0x00010000 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP15_2                   ( ( uint32_t )0x00020000 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP16                     ( ( uint32_t )0x001C0000 )			/*!<SMP16[2:0] bits (Channel 16 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP16_0                   ( ( uint32_t )0x00040000 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP16_1                   ( ( uint32_t )0x00080000 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP16_2                   ( ( uint32_t )0x00100000 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP17                     ( ( uint32_t )0x00E00000 )			/*!<SMP17[2:0] bits (Channel 17 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP17_0                   ( ( uint32_t )0x00200000 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP17_1                   ( ( uint32_t )0x00400000 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP17_2                   ( ( uint32_t )0x00800000 )			/*!<Bit 2 */
#define  ADC_SMPR1_SMP18                     ( ( uint32_t )0x07000000 )			/*!<SMP18[2:0] bits (Channel 18 Sample
																				   time selection) */
#define  ADC_SMPR1_SMP18_0                   ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  ADC_SMPR1_SMP18_1                   ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  ADC_SMPR1_SMP18_2                   ( ( uint32_t )0x04000000 )			/*!<Bit 2 */

