etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bit definition for ADC_DR register  ********************/
#define  ADC_DR_DATA                         ( ( uint32_t )0x0000FFFF )			/*!<Regular data */
#define  ADC_DR_ADC2DATA                     ( ( uint32_t )0xFFFF0000 )			/*!<ADC2 data */

/*******************  Bit definition for ADC_CSR register  ********************/
#define  ADC_CSR_AWD1                        ( ( uint32_t )0x00000001 )			/*!<ADC1 Analog watchdog flag */
#define  ADC_CSR_EOC1                        ( ( uint32_t )0x00000002 )			/*!<ADC1 End of conversion */
#define  ADC_CSR_JEOC1                       ( ( uint32_t )0x00000004 )			/*!<ADC1 Injected channel end of
																				   conversion */
#define  ADC_CSR_JSTRT1                      ( ( uint32_t )0x00000008 )			/*!<ADC1 Injected channel Start flag */
#define  ADC_CSR_STRT1                       ( ( uint32_t )0x00000010 )			/*!<ADC1 Regular channel Start flag */
#define  ADC_CSR_DOVR1                       ( ( uint32_t )0x00000020 )			/*!<ADC1 DMA overrun  flag */
#define  ADC_CSR_AWD2                        ( ( uint32_t )0x00000100 )			/*!<ADC2 Analog watchdog flag */
#define  ADC_CSR_EOC2                        ( ( uint32_t )0x00000200 )			/*!<ADC2 End of conversion */
#define  ADC_CSR_JEOC2                       ( ( uint32_t )0x00000400 )			/*!<ADC2 Injected channel end of
																				   conversion */
#define  ADC_CSR_JSTRT2                      ( ( uint32_t )0x00000800 )			/*!<ADC2 Injected channel Start flag */
#define  ADC_CSR_STRT2                       ( ( uint32_t )0x00001000 )			/*!<ADC2 Regular channel Start flag */
#define  ADC_CSR_DOVR2                       ( ( uint32_t )0x00002000 )			/*!<ADC2 DMA overrun  flag */
#define  ADC_CSR_AWD3                        ( ( uint32_t )0x00010000 )			/*!<ADC3 Analog watchdog flag */
#define  ADC_CSR_EOC3                        ( ( uint32_t )0x00020000 )			/*!<ADC3 End of conversion */
#define  ADC_CSR_JEOC3                       ( ( uint32_t )0x00040000 )			/*!<ADC3 Injected channel end of
																				   conversion */
#define  ADC_CSR_JSTRT3                      ( ( uint32_t )0x00080000 )			/*!<ADC3 Injected channel Start flag */
#define  ADC_CSR_STRT3                       ( ( uint32_t )0x00100000 )			/*!<ADC3 Regular channel Start flag */
#define  ADC_CSR_DOVR3                       ( ( uint32_t )0x00200000 )			/*!<ADC3 DMA overrun  flag */

/*******************  Bit definition for ADC_CCR register  ********************/
#define  ADC_CCR_MULTI                       ( ( uint32_t )0x0000001F )			/*!<MULTI[4:0] bits (Multi-ADC mode
																				   selection) */
#define  ADC_CCR_MULTI_0                     ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  ADC_CCR_MULTI_1                     ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  ADC_CCR_MULTI_2                     ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  ADC_CCR_MULTI_3                     ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  ADC_CCR_MULTI_4                     ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  ADC_CCR_DELAY                       ( ( uint32_t )0x00000F00 )			/*!<DELAY[3:0] bits (Delay between 2
																				   sampling phases) */
#define  ADC_CCR_DELAY_0                     ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  ADC_CCR_DELAY_1                     ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  ADC_CCR_DELAY_2                     ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  ADC_CCR_DELAY_3                     ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  ADC_CCR_DDS                         ( ( uint32_t )0x00002000 )			/*!<DMA disable selection (Multi-ADC
																				   mode) */
#define  ADC_CCR_DMA                         ( ( uint32_t )0x0000C000 )			/*!<DMA[1:0] bits (Direct Memory Access
																				   mode for multimode) */
#define  ADC_CCR_DMA_0                       ( ( uint32_t )0x00004000 )			/*!<Bit 0 */
#define  ADC_CCR_DMA_1                       ( ( uint32_t )0x00008000 )			/*!<Bit 1 */
#define  ADC_CCR_ADCPRE                      ( ( uint32_t )0x00030000 )			/*!<ADCPRE[1:0] bits (ADC prescaler) */
#define  ADC_CCR_ADCPRE_0                    ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  ADC_CCR_ADCPRE_1                    ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  ADC_CCR_VBATE                       ( ( uint32_t )0x00400000 )			/*!<VBAT Enable */
#define  ADC_CCR_TSVREFE                     ( ( uint32_t )0x00800000 )			/*!<Temperature Sensor and VREFINT
																				   Enable */

/*******************  Bit definition for ADC_CDR register  ********************/
#define  ADC_CDR_DATA1                      ( ( uint32_t )0x0000FFFF )			/*!<1st data of a pair of regular
																				   conversions */
#define  ADC_CDR_DATA2                      ( ( uint32_t )0xFFFF0000 )			/*!<2nd data of a pair of regular
																				   conversions */

/* ****************************************************************************
  
                           Controller Area Network
  
  ****************************************************************************
  !<CAN control and status registers
  ******************  Bit definition for CAN_MCR register  ********************/
#define  CAN_MCR_INRQ                        ( ( uint16_t )0x0001 )				/*!<Initialization Request */
#define  CAN_MCR_SLEEP                       ( ( uint16_t )0x0002 )				/*!<Sleep Mode Request */
#define  CAN_MCR_TXFP                        ( ( uint16_t )0x0004 )				/*!<Transmit FIFO Priority */
#define  CAN_MCR_RFLM                        ( ( uint16_t )0x0008 )				/*!<Receive FIFO Locked Mode */
#define  CAN_MCR_NART                        ( ( uint16_t )0x0010 )				/*!<No Automatic Retransmission */
#define  CAN_MCR_AWUM                        ( ( uint16_t )0x0020 )				/*!<Automatic Wakeup Mode */
#define  CAN_MCR_ABOM                        ( ( uint16_t )0x0040 )				/*!<Automatic Bus-Off Management */
#define  CAN_MCR_TTCM                        ( ( uint16_t )0x0080 )				/*!<Time Triggered Communication Mode */
#define  CAN_MCR_RESET                       ( ( uint16_t )0x8000 )				/*!<bxCAN software master reset */

/*******************  Bit definition for CAN_MSR register  ********************/
#define  CAN_MSR_INAK                        ( ( uint16_t )0x0001 )				/*!<Initialization Acknowledge */
#define  CAN_MSR_SLAK                        ( ( uint16_t )0x0002 )				/*!<Sleep Acknowledge */
#define  CAN_MSR_ERRI                        ( ( uint16_t )0x0004 )				/*!<Error Interrupt */
#define  CAN_MSR_WKUI                        ( ( uint16_t )0x0008 )				/*!<Wakeup Interrupt */
#define  CAN_MSR_SLAKI                       ( ( uint16_t )0x0010 )				/*!<Sleep Acknowledge Interrupt */
#define  CAN_MSR_TXM                         ( ( uint16_t )0x0100 )				/*!<Transmit Mode */
#define  CAN_MSR_RXM                         ( ( uint16_t )0x0200 )				/*!<Receive Mode */
#define  CAN_MSR_SAMP                        ( ( uint16_t )0x0400 )				/*!<Last Sample Point */
#define  CAN_MSR_RX                          ( ( uint16_t )0x0800 )				/*!<CAN Rx Signal */

/*******************  Bit definition for CAN_TSR register  ********************/
#define  CAN_TSR_RQCP0                       ( ( uint32_t )0x00000001 )			/*!<Request Completed Mailbox0 */
#define  CAN_TSR_TXOK0                       ( ( uint32_t )0x00000002 )			/*!<Transmission OK of Mailbox0 */
#define  CAN_TSR_ALST0                       ( ( uint32_t )0x00000004 )			/*!<Arbitration Lost for Mailbox0 */
#define  CAN_TSR_TERR0                       ( ( uint32_t )0x00000008 )			/*!<Transmission Error of Mailbox0 */
#define  CAN_TSR_ABRQ0                       ( ( uint32_t )0x00000080 )			/*!<Abort Request for Mailbox0 */
#define  CAN_TSR_RQCP1                       ( ( uint32_t )0x00000100 )			/*!<Request Completed Mailbox1 */
#define  CAN_TSR_TXOK1                       ( ( uint32_t )0x00000200 )			/*!<Transmission OK of Mailbox1 */
#define  CAN_TSR_ALST1                       ( ( uint32_t )0x00000400 )			/*!<Arbitration Lost for Mailbox1 */
#define  CAN_TSR_TERR1                       ( ( uint32_t )0x00000800 )			/*!<Transmission Error of Mailbox1 */
#define  CAN_TSR_ABRQ1                       ( ( uint32_t )0x00008000 )			/*!<Abort Request for Mailbox 1 */
#define  CAN_TSR_RQCP2                       ( ( uint32_t )0x00010000 )			/*!<Request Completed Mailbox2 */
#define  CAN_TSR_TXOK2                       ( ( uint32_t )0x00020000 )			/*!<Transmission OK of Mailbox 2 */
#define  CAN_TSR_ALST2                       ( ( uint32_t )0x00040000 )			/*!<Arbitration Lost for mailbox 2 */
#define  CAN_TSR_TERR2                       ( ( uint32_t )0x00080000 )			/*!<Transmission Error of Mailbox 2 */
#define  CAN_TSR_ABRQ2                       ( ( uint32_t )0x00800000 )			/*!<Abort Request for Mailbox 2 */
#define  CAN_TSR_CODE                        ( ( uint32_t )0x03000000 )			/*!<Mailbox Code */

