etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  CAN_TSR_TME                         ( ( uint32_t )0x1C000000 )			/*!<TME[2:0] bits */
#define  CAN_TSR_TME0                        ( ( uint32_t )0x04000000 )			/*!<Transmit Mailbox 0 Empty */
#define  CAN_TSR_TME1                        ( ( uint32_t )0x08000000 )			/*!<Transmit Mailbox 1 Empty */
#define  CAN_TSR_TME2                        ( ( uint32_t )0x10000000 )			/*!<Transmit Mailbox 2 Empty */

#define  CAN_TSR_LOW                         ( ( uint32_t )0xE0000000 )			/*!<LOW[2:0] bits */
#define  CAN_TSR_LOW0                        ( ( uint32_t )0x20000000 )			/*!<Lowest Priority Flag for Mailbox 0
																				   */
#define  CAN_TSR_LOW1                        ( ( uint32_t )0x40000000 )			/*!<Lowest Priority Flag for Mailbox 1
																				   */
#define  CAN_TSR_LOW2                        ( ( uint32_t )0x80000000 )			/*!<Lowest Priority Flag for Mailbox 2
																				   */

/*******************  Bit definition for CAN_RF0R register  *******************/
#define  CAN_RF0R_FMP0                       ( ( uint8_t )0x03 )				/*!<FIFO 0 Message Pending */
#define  CAN_RF0R_FULL0                      ( ( uint8_t )0x08 )				/*!<FIFO 0 Full */
#define  CAN_RF0R_FOVR0                      ( ( uint8_t )0x10 )				/*!<FIFO 0 Overrun */
#define  CAN_RF0R_RFOM0                      ( ( uint8_t )0x20 )				/*!<Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RF1R register  *******************/
#define  CAN_RF1R_FMP1                       ( ( uint8_t )0x03 )				/*!<FIFO 1 Message Pending */
#define  CAN_RF1R_FULL1                      ( ( uint8_t )0x08 )				/*!<FIFO 1 Full */
#define  CAN_RF1R_FOVR1                      ( ( uint8_t )0x10 )				/*!<FIFO 1 Overrun */
#define  CAN_RF1R_RFOM1                      ( ( uint8_t )0x20 )				/*!<Release FIFO 1 Output Mailbox */

/********************  Bit definition for CAN_IER register  *******************/
#define  CAN_IER_TMEIE                       ( ( uint32_t )0x00000001 )			/*!<Transmit Mailbox Empty Interrupt
																				   Enable */
#define  CAN_IER_FMPIE0                      ( ( uint32_t )0x00000002 )			/*!<FIFO Message Pending Interrupt
																				   Enable */
#define  CAN_IER_FFIE0                       ( ( uint32_t )0x00000004 )			/*!<FIFO Full Interrupt Enable */
#define  CAN_IER_FOVIE0                      ( ( uint32_t )0x00000008 )			/*!<FIFO Overrun Interrupt Enable */
#define  CAN_IER_FMPIE1                      ( ( uint32_t )0x00000010 )			/*!<FIFO Message Pending Interrupt
																				   Enable */
#define  CAN_IER_FFIE1                       ( ( uint32_t )0x00000020 )			/*!<FIFO Full Interrupt Enable */
#define  CAN_IER_FOVIE1                      ( ( uint32_t )0x00000040 )			/*!<FIFO Overrun Interrupt Enable */
#define  CAN_IER_EWGIE                       ( ( uint32_t )0x00000100 )			/*!<Error Warning Interrupt Enable */
#define  CAN_IER_EPVIE                       ( ( uint32_t )0x00000200 )			/*!<Error Passive Interrupt Enable */
#define  CAN_IER_BOFIE                       ( ( uint32_t )0x00000400 )			/*!<Bus-Off Interrupt Enable */
#define  CAN_IER_LECIE                       ( ( uint32_t )0x00000800 )			/*!<Last Error Code Interrupt Enable */
#define  CAN_IER_ERRIE                       ( ( uint32_t )0x00008000 )			/*!<Error Interrupt Enable */
#define  CAN_IER_WKUIE                       ( ( uint32_t )0x00010000 )			/*!<Wakeup Interrupt Enable */
#define  CAN_IER_SLKIE                       ( ( uint32_t )0x00020000 )			/*!<Sleep Interrupt Enable */

/********************  Bit definition for CAN_ESR register  *******************/
#define  CAN_ESR_EWGF                        ( ( uint32_t )0x00000001 )			/*!<Error Warning Flag */
#define  CAN_ESR_EPVF                        ( ( uint32_t )0x00000002 )			/*!<Error Passive Flag */
#define  CAN_ESR_BOFF                        ( ( uint32_t )0x00000004 )			/*!<Bus-Off Flag */

#define  CAN_ESR_LEC                         ( ( uint32_t )0x00000070 )			/*!<LEC[2:0] bits (Last Error Code) */
#define  CAN_ESR_LEC_0                       ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  CAN_ESR_LEC_1                       ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  CAN_ESR_LEC_2                       ( ( uint32_t )0x00000040 )			/*!<Bit 2 */

#define  CAN_ESR_TEC                         ( ( uint32_t )0x00FF0000 )			/*!<Least significant byte of the 9-bit
																				   Transmit Error Counter */
#define  CAN_ESR_REC                         ( ( uint32_t )0xFF000000 )			/*!<Receive Error Counter */

/*******************  Bit definition for CAN_BTR register  ********************/
#define  CAN_BTR_BRP                         ( ( uint32_t )0x000003FF )			/*!<Baud Rate Prescaler */
#define  CAN_BTR_TS1                         ( ( uint32_t )0x000F0000 )			/*!<Time Segment 1 */
#define  CAN_BTR_TS2                         ( ( uint32_t )0x00700000 )			/*!<Time Segment 2 */
#define  CAN_BTR_SJW                         ( ( uint32_t )0x03000000 )			/*!<Resynchronization Jump Width */
#define  CAN_BTR_LBKM                        ( ( uint32_t )0x40000000 )			/*!<Loop Back Mode (Debug) */
#define  CAN_BTR_SILM                        ( ( uint32_t )0x80000000 )			/*!<Silent Mode */

/* !<Mailbox registers
  *****************  Bit definition for CAN_TI0R register  ********************/
#define  CAN_TI0R_TXRQ                       ( ( uint32_t )0x00000001 )			/*!<Transmit Mailbox Request */
#define  CAN_TI0R_RTR                        ( ( uint32_t )0x00000002 )			/*!<Remote Transmission Request */
#define  CAN_TI0R_IDE                        ( ( uint32_t )0x00000004 )			/*!<Identifier Extension */
#define  CAN_TI0R_EXID                       ( ( uint32_t )0x001FFFF8 )			/*!<Extended Identifier */
#define  CAN_TI0R_STID                       ( ( uint32_t )0xFFE00000 )			/*!<Standard Identifier or Extended
																				   Identifier */

/******************  Bit definition for CAN_TDT0R register  *******************/
#define  CAN_TDT0R_DLC                       ( ( uint32_t )0x0000000F )			/*!<Data Length Code */
#define  CAN_TDT0R_TGT                       ( ( uint32_t )0x00000100 )			/*!<Transmit Global Time */
#define  CAN_TDT0R_TIME                      ( ( uint32_t )0xFFFF0000 )			/*!<Message Time Stamp */

/******************  Bit definition for CAN_TDL0R register  *******************/
#define  CAN_TDL0R_DATA0                     ( ( uint32_t )0x000000FF )			/*!<Data byte 0 */
#define  CAN_TDL0R_DATA1                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 1 */
#define  CAN_TDL0R_DATA2                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 2 */
#define  CAN_TDL0R_DATA3                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 3 */

/******************  Bit definition for CAN_TDH0R register  *******************/
#define  CAN_TDH0R_DATA4                     ( ( uint32_t )0x000000FF )			/*!<Data byte 4 */
#define  CAN_TDH0R_DATA5                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 5 */
#define  CAN_TDH0R_DATA6                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 6 */
#define  CAN_TDH0R_DATA7                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 7 */

/*******************  Bit definition for CAN_TI1R register  *******************/
#define  CAN_TI1R_TXRQ                       ( ( uint32_t )0x00000001 )			/*!<Transmit Mailbox Request */
#define  CAN_TI1R_RTR                        ( ( uint32_t )0x00000002 )			/*!<Remote Transmission Request */
#define  CAN_TI1R_IDE                        ( ( uint32_t )0x00000004 )			/*!<Identifier Extension */
#define  CAN_TI1R_EXID                       ( ( uint32_t )0x001FFFF8 )			/*!<Extended Identifier */
#define  CAN_TI1R_STID                       ( ( uint32_t )0xFFE00000 )			/*!<Standard Identifier or Extended
																				   Identifier */

/*******************  Bit definition for CAN_TDT1R register  ******************/
#define  CAN_TDT1R_DLC                       ( ( uint32_t )0x0000000F )			/*!<Data Length Code */
#define  CAN_TDT1R_TGT                       ( ( uint32_t )0x00000100 )			/*!<Transmit Global Time */
#define  CAN_TDT1R_TIME                      ( ( uint32_t )0xFFFF0000 )			/*!<Message Time Stamp */

/*******************  Bit definition for CAN_TDL1R register  ******************/
#define  CAN_TDL1R_DATA0                     ( ( uint32_t )0x000000FF )			/*!<Data byte 0 */
#define  CAN_TDL1R_DATA1                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 1 */
#define  CAN_TDL1R_DATA2                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 2 */
#define  CAN_TDL1R_DATA3                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 3 */

/*******************  Bit definition for CAN_TDH1R register  ******************/
#define  CAN_TDH1R_DATA4                     ( ( uint32_t )0x000000FF )			/*!<Data byte 4 */
#define  CAN_TDH1R_DATA5                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 5 */
#define  CAN_TDH1R_DATA6                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 6 */
#define  CAN_TDH1R_DATA7                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 7 */

/*******************  Bit definition for CAN_TI2R register  *******************/
#define  CAN_TI2R_TXRQ                       ( ( uint32_t )0x00000001 )			/*!<Transmit Mailbox Request */
#define  CAN_TI2R_RTR                        ( ( uint32_t )0x00000002 )			/*!<Remote Transmission Request */
#define  CAN_TI2R_IDE                        ( ( uint32_t )0x00000004 )			/*!<Identifier Extension */
#define  CAN_TI2R_EXID                       ( ( uint32_t )0x001FFFF8 )			/*!<Extended identifier */
#define  CAN_TI2R_STID                       ( ( uint32_t )0xFFE00000 )			/*!<Standard Identifier or Extended
																				   Identifier */

/*******************  Bit definition for CAN_TDT2R register  ******************/
#define  CAN_TDT2R_DLC                       ( ( uint32_t )0x0000000F )			/*!<Data Length Code */
#define  CAN_TDT2R_TGT                       ( ( uint32_t )0x00000100 )			/*!<Transmit Global Time */
#define  CAN_TDT2R_TIME                      ( ( uint32_t )0xFFFF0000 )			/*!<Message Time Stamp */

/*******************  Bit definition for CAN_TDL2R register  ******************/
#define  CAN_TDL2R_DATA0                     ( ( uint32_t )0x000000FF )			/*!<Data byte 0 */
#define  CAN_TDL2R_DATA1                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 1 */
#define  CAN_TDL2R_DATA2                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 2 */
#define  CAN_TDL2R_DATA3                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 3 */

/*******************  Bit definition for CAN_TDH2R register  ******************/
#define  CAN_TDH2R_DATA4                     ( ( uint32_t )0x000000FF )			/*!<Data byte 4 */
#define  CAN_TDH2R_DATA5                     ( ( uint32_t )0x0000FF00 )			/*!<Data byte 5 */
#define  CAN_TDH2R_DATA6                     ( ( uint32_t )0x00FF0000 )			/*!<Data byte 6 */
#define  CAN_TDH2R_DATA7                     ( ( uint32_t )0xFF000000 )			/*!<Data byte 7 */

/*******************  Bit definition for CAN_RI0R register  *******************/
#define  CAN_RI0R_RTR                        ( ( uint32_t )0x00000002 )			/*!<Remote Transmission Request */
#define  CAN_RI0R_IDE                        ( ( uint32_t )0x00000004 )			/*!<Identifier Extension */
#define  CAN_RI0R_EXID                       ( ( uint32_t )0x001FFFF8 )			/*!<Extended Identifier */
#define  CAN_RI0R_STID                       ( ( uint32_t )0xFFE00000 )			/*!<Standard Identifier or Extended
																				   Identifier */

/*******************  Bit definition for CAN_RDT0R register  ******************/
#define  CAN_RDT0R_DLC                       ( ( uint32_t )0x0000000F )			/*!<Data Length Code */
#define  CAN_RDT0R_FMI                       ( ( uint32_t )0x0000FF00 )			/*!<Filter Match Index */
#define  CAN_RDT0R_TIME                      ( ( uint32_t )0xFFFF0000 )			/*!<Message Time Stamp */

