etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
  
                            CRC calculation unit
  
  ****************************************************************************
  ******************  Bit definition for CRC_DR register  *********************/
#define  CRC_DR_DR                           ( ( uint32_t )0xFFFFFFFF )	/*!< Data register bits */


/*******************  Bit definition for CRC_IDR register  ********************/
#define  CRC_IDR_IDR                         ( ( uint8_t )0xFF )		/*!< General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CR register  ********************/
#define  CRC_CR_RESET                        ( ( uint8_t )0x01 )		/*!< RESET bit */

/* ****************************************************************************
  
                              Crypto Processor
  
  ****************************************************************************
  ****************** Bits definition for CRYP_CR register  ********************/
#define CRYP_CR_ALGODIR                      ( ( uint32_t )0x00000004 )

#define CRYP_CR_ALGOMODE                     ( ( uint32_t )0x00000038 )
#define CRYP_CR_ALGOMODE_0                   ( ( uint32_t )0x00000008 )
#define CRYP_CR_ALGOMODE_1                   ( ( uint32_t )0x00000010 )
#define CRYP_CR_ALGOMODE_2                   ( ( uint32_t )0x00000020 )
#define CRYP_CR_ALGOMODE_TDES_ECB            ( ( uint32_t )0x00000000 )
#define CRYP_CR_ALGOMODE_TDES_CBC            ( ( uint32_t )0x00000008 )
#define CRYP_CR_ALGOMODE_DES_ECB             ( ( uint32_t )0x00000010 )
#define CRYP_CR_ALGOMODE_DES_CBC             ( ( uint32_t )0x00000018 )
#define CRYP_CR_ALGOMODE_AES_ECB             ( ( uint32_t )0x00000020 )
#define CRYP_CR_ALGOMODE_AES_CBC             ( ( uint32_t )0x00000028 )
#define CRYP_CR_ALGOMODE_AES_CTR             ( ( uint32_t )0x00000030 )
#define CRYP_CR_ALGOMODE_AES_KEY             ( ( uint32_t )0x00000038 )

#define CRYP_CR_DATATYPE                     ( ( uint32_t )0x000000C0 )
#define CRYP_CR_DATATYPE_0                   ( ( uint32_t )0x00000040 )
#define CRYP_CR_DATATYPE_1                   ( ( uint32_t )0x00000080 )
#define CRYP_CR_KEYSIZE                      ( ( uint32_t )0x00000300 )
#define CRYP_CR_KEYSIZE_0                    ( ( uint32_t )0x00000100 )
#define CRYP_CR_KEYSIZE_1                    ( ( uint32_t )0x00000200 )
#define CRYP_CR_FFLUSH                       ( ( uint32_t )0x00004000 )
#define CRYP_CR_CRYPEN                       ( ( uint32_t )0x00008000 )
/****************** Bits definition for CRYP_SR register  *********************/
#define CRYP_SR_IFEM                         ( ( uint32_t )0x00000001 )
#define CRYP_SR_IFNF                         ( ( uint32_t )0x00000002 )
#define CRYP_SR_OFNE                         ( ( uint32_t )0x00000004 )
#define CRYP_SR_OFFU                         ( ( uint32_t )0x00000008 )
#define CRYP_SR_BUSY                         ( ( uint32_t )0x00000010 )
/****************** Bits definition for CRYP_DMACR register  ******************/
#define CRYP_DMACR_DIEN                      ( ( uint32_t )0x00000001 )
#define CRYP_DMACR_DOEN                      ( ( uint32_t )0x00000002 )
/*****************  Bits definition for CRYP_IMSCR register  ******************/
#define CRYP_IMSCR_INIM                      ( ( uint32_t )0x00000001 )
#define CRYP_IMSCR_OUTIM                     ( ( uint32_t )0x00000002 )
/****************** Bits definition for CRYP_RISR register  *******************/
#define CRYP_RISR_OUTRIS                     ( ( uint32_t )0x00000001 )
#define CRYP_RISR_INRIS                      ( ( uint32_t )0x00000002 )
/****************** Bits definition for CRYP_MISR register  *******************/
#define CRYP_MISR_INMIS                      ( ( uint32_t )0x00000001 )
#define CRYP_MISR_OUTMIS                     ( ( uint32_t )0x00000002 )

/* ****************************************************************************
  
                        Digital to Analog Converter
  
  ****************************************************************************
  *******************  Bit definition for DAC_CR register  ********************/
#define  DAC_CR_EN1                          ( ( uint32_t )0x00000001 )			/*!<DAC channel1 enable */
#define  DAC_CR_BOFF1                        ( ( uint32_t )0x00000002 )			/*!<DAC channel1 output buffer disable
																				   */
#define  DAC_CR_TEN1                         ( ( uint32_t )0x00000004 )			/*!<DAC channel1 Trigger enable */

#define  DAC_CR_TSEL1                        ( ( uint32_t )0x00000038 )			/*!<TSEL1[2:0] (DAC channel1 Trigger
																				   selection) */
#define  DAC_CR_TSEL1_0                      ( ( uint32_t )0x00000008 )			/*!<Bit 0 */
#define  DAC_CR_TSEL1_1                      ( ( uint32_t )0x00000010 )			/*!<Bit 1 */
#define  DAC_CR_TSEL1_2                      ( ( uint32_t )0x00000020 )			/*!<Bit 2 */

#define  DAC_CR_WAVE1                        ( ( uint32_t )0x000000C0 )			/*!<WAVE1[1:0] (DAC channel1
																				   noise/triangle wave generation
																				   enable) */
#define  DAC_CR_WAVE1_0                      ( ( uint32_t )0x00000040 )			/*!<Bit 0 */
#define  DAC_CR_WAVE1_1                      ( ( uint32_t )0x00000080 )			/*!<Bit 1 */

#define  DAC_CR_MAMP1                        ( ( uint32_t )0x00000F00 )			/*!<MAMP1[3:0] (DAC channel1
																				   Mask/Amplitude selector) */
#define  DAC_CR_MAMP1_0                      ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  DAC_CR_MAMP1_1                      ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  DAC_CR_MAMP1_2                      ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  DAC_CR_MAMP1_3                      ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  DAC_CR_DMAEN1                       ( ( uint32_t )0x00001000 )			/*!<DAC channel1 DMA enable */
#define  DAC_CR_EN2                          ( ( uint32_t )0x00010000 )			/*!<DAC channel2 enable */
#define  DAC_CR_BOFF2                        ( ( uint32_t )0x00020000 )			/*!<DAC channel2 output buffer disable
																				   */
#define  DAC_CR_TEN2                         ( ( uint32_t )0x00040000 )			/*!<DAC channel2 Trigger enable */

#define  DAC_CR_TSEL2                        ( ( uint32_t )0x00380000 )			/*!<TSEL2[2:0] (DAC channel2 Trigger
																				   selection) */
#define  DAC_CR_TSEL2_0                      ( ( uint32_t )0x00080000 )			/*!<Bit 0 */
#define  DAC_CR_TSEL2_1                      ( ( uint32_t )0x00100000 )			/*!<Bit 1 */
#define  DAC_CR_TSEL2_2                      ( ( uint32_t )0x00200000 )			/*!<Bit 2 */

#define  DAC_CR_WAVE2                        ( ( uint32_t )0x00C00000 )			/*!<WAVE2[1:0] (DAC channel2
																				   noise/triangle wave generation
																				   enable) */
#define  DAC_CR_WAVE2_0                      ( ( uint32_t )0x00400000 )			/*!<Bit 0 */
#define  DAC_CR_WAVE2_1                      ( ( uint32_t )0x00800000 )			/*!<Bit 1 */

#define  DAC_CR_MAMP2                        ( ( uint32_t )0x0F000000 )			/*!<MAMP2[3:0] (DAC channel2
																				   Mask/Amplitude selector) */
#define  DAC_CR_MAMP2_0                      ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  DAC_CR_MAMP2_1                      ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  DAC_CR_MAMP2_2                      ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  DAC_CR_MAMP2_3                      ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

