etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  DAC_CR_DMAEN2                       ( ( uint32_t )0x10000000 )			/*!<DAC channel2 DMA enabled */

/*****************  Bit definition for DAC_SWTRIGR register  ******************/
#define  DAC_SWTRIGR_SWTRIG1                 ( ( uint8_t )0x01 )				/*!<DAC channel1 software trigger */
#define  DAC_SWTRIGR_SWTRIG2                 ( ( uint8_t )0x02 )				/*!<DAC channel2 software trigger */

/*****************  Bit definition for DAC_DHR12R1 register  ******************/
#define  DAC_DHR12R1_DACC1DHR                ( ( uint16_t )0x0FFF )				/*!<DAC channel1 12-bit Right aligned
																				   data */

/*****************  Bit definition for DAC_DHR12L1 register  ******************/
#define  DAC_DHR12L1_DACC1DHR                ( ( uint16_t )0xFFF0 )				/*!<DAC channel1 12-bit Left aligned
																				   data */

/******************  Bit definition for DAC_DHR8R1 register  ******************/
#define  DAC_DHR8R1_DACC1DHR                 ( ( uint8_t )0xFF )				/*!<DAC channel1 8-bit Right aligned
																				   data */

/*****************  Bit definition for DAC_DHR12R2 register  ******************/
#define  DAC_DHR12R2_DACC2DHR                ( ( uint16_t )0x0FFF )				/*!<DAC channel2 12-bit Right aligned
																				   data */

/*****************  Bit definition for DAC_DHR12L2 register  ******************/
#define  DAC_DHR12L2_DACC2DHR                ( ( uint16_t )0xFFF0 )				/*!<DAC channel2 12-bit Left aligned
																				   data */

/******************  Bit definition for DAC_DHR8R2 register  ******************/
#define  DAC_DHR8R2_DACC2DHR                 ( ( uint8_t )0xFF )				/*!<DAC channel2 8-bit Right aligned
																				   data */

/*****************  Bit definition for DAC_DHR12RD register  ******************/
#define  DAC_DHR12RD_DACC1DHR                ( ( uint32_t )0x00000FFF )			/*!<DAC channel1 12-bit Right aligned
																				   data */
#define  DAC_DHR12RD_DACC2DHR                ( ( uint32_t )0x0FFF0000 )			/*!<DAC channel2 12-bit Right aligned
																				   data */

/*****************  Bit definition for DAC_DHR12LD register  ******************/
#define  DAC_DHR12LD_DACC1DHR                ( ( uint32_t )0x0000FFF0 )			/*!<DAC channel1 12-bit Left aligned
																				   data */
#define  DAC_DHR12LD_DACC2DHR                ( ( uint32_t )0xFFF00000 )			/*!<DAC channel2 12-bit Left aligned
																				   data */

/******************  Bit definition for DAC_DHR8RD register  ******************/
#define  DAC_DHR8RD_DACC1DHR                 ( ( uint16_t )0x00FF )				/*!<DAC channel1 8-bit Right aligned
																				   data */
#define  DAC_DHR8RD_DACC2DHR                 ( ( uint16_t )0xFF00 )				/*!<DAC channel2 8-bit Right aligned
																				   data */

/*******************  Bit definition for DAC_DOR1 register  *******************/
#define  DAC_DOR1_DACC1DOR                   ( ( uint16_t )0x0FFF )				/*!<DAC channel1 data output */

/*******************  Bit definition for DAC_DOR2 register  *******************/
#define  DAC_DOR2_DACC2DOR                   ( ( uint16_t )0x0FFF )				/*!<DAC channel2 data output */

/********************  Bit definition for DAC_SR register  ********************/
#define  DAC_SR_DMAUDR1                      ( ( uint32_t )0x00002000 )			/*!<DAC channel1 DMA underrun flag */
#define  DAC_SR_DMAUDR2                      ( ( uint32_t )0x20000000 )			/*!<DAC channel2 DMA underrun flag */

/* ****************************************************************************
  
                                   Debug MCU
  
  *****************************************************************************/

/* ****************************************************************************
  
                                      DCMI
  
  ****************************************************************************
  *******************  Bits definition for DCMI_CR register  ******************/
#define DCMI_CR_CAPTURE                      ( ( uint32_t )0x00000001 )
#define DCMI_CR_CM                           ( ( uint32_t )0x00000002 )
#define DCMI_CR_CROP                         ( ( uint32_t )0x00000004 )
#define DCMI_CR_JPEG                         ( ( uint32_t )0x00000008 )
#define DCMI_CR_ESS                          ( ( uint32_t )0x00000010 )
#define DCMI_CR_PCKPOL                       ( ( uint32_t )0x00000020 )
#define DCMI_CR_HSPOL                        ( ( uint32_t )0x00000040 )
#define DCMI_CR_VSPOL                        ( ( uint32_t )0x00000080 )
#define DCMI_CR_FCRC_0                       ( ( uint32_t )0x00000100 )
#define DCMI_CR_FCRC_1                       ( ( uint32_t )0x00000200 )
#define DCMI_CR_EDM_0                        ( ( uint32_t )0x00000400 )
#define DCMI_CR_EDM_1                        ( ( uint32_t )0x00000800 )
#define DCMI_CR_CRE                          ( ( uint32_t )0x00001000 )
#define DCMI_CR_ENABLE                       ( ( uint32_t )0x00004000 )

/********************  Bits definition for DCMI_SR register  ******************/
#define DCMI_SR_HSYNC                        ( ( uint32_t )0x00000001 )
#define DCMI_SR_VSYNC                        ( ( uint32_t )0x00000002 )
#define DCMI_SR_FNE                          ( ( uint32_t )0x00000004 )

/********************  Bits definition for DCMI_RISR register  ****************/
#define DCMI_RISR_FRAME_RIS                  ( ( uint32_t )0x00000001 )
#define DCMI_RISR_OVF_RIS                    ( ( uint32_t )0x00000002 )
#define DCMI_RISR_ERR_RIS                    ( ( uint32_t )0x00000004 )
#define DCMI_RISR_VSYNC_RIS                  ( ( uint32_t )0x00000008 )
#define DCMI_RISR_LINE_RIS                   ( ( uint32_t )0x00000010 )

/********************  Bits definition for DCMI_IER register  *****************/
#define DCMI_IER_FRAME_IE                    ( ( uint32_t )0x00000001 )
#define DCMI_IER_OVF_IE                      ( ( uint32_t )0x00000002 )
#define DCMI_IER_ERR_IE                      ( ( uint32_t )0x00000004 )
#define DCMI_IER_VSYNC_IE                    ( ( uint32_t )0x00000008 )
#define DCMI_IER_LINE_IE                     ( ( uint32_t )0x00000010 )

