etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bits definition for DCMI_MISR register  ****************/
#define DCMI_MISR_FRAME_MIS                  ( ( uint32_t )0x00000001 )
#define DCMI_MISR_OVF_MIS                    ( ( uint32_t )0x00000002 )
#define DCMI_MISR_ERR_MIS                    ( ( uint32_t )0x00000004 )
#define DCMI_MISR_VSYNC_MIS                  ( ( uint32_t )0x00000008 )
#define DCMI_MISR_LINE_MIS                   ( ( uint32_t )0x00000010 )

/********************  Bits definition for DCMI_ICR register  *****************/
#define DCMI_ICR_FRAME_ISC                   ( ( uint32_t )0x00000001 )
#define DCMI_ICR_OVF_ISC                     ( ( uint32_t )0x00000002 )
#define DCMI_ICR_ERR_ISC                     ( ( uint32_t )0x00000004 )
#define DCMI_ICR_VSYNC_ISC                   ( ( uint32_t )0x00000008 )
#define DCMI_ICR_LINE_ISC                    ( ( uint32_t )0x00000010 )

/* ****************************************************************************
  
                               DMA Controller
  
  ****************************************************************************
  *******************  Bits definition for DMA_SxCR register  *****************/
#define DMA_SxCR_CHSEL                       ( ( uint32_t )0x0E000000 )
#define DMA_SxCR_CHSEL_0                     ( ( uint32_t )0x02000000 )
#define DMA_SxCR_CHSEL_1                     ( ( uint32_t )0x04000000 )
#define DMA_SxCR_CHSEL_2                     ( ( uint32_t )0x08000000 )
#define DMA_SxCR_MBURST                      ( ( uint32_t )0x01800000 )
#define DMA_SxCR_MBURST_0                    ( ( uint32_t )0x00800000 )
#define DMA_SxCR_MBURST_1                    ( ( uint32_t )0x01000000 )
#define DMA_SxCR_PBURST                      ( ( uint32_t )0x00600000 )
#define DMA_SxCR_PBURST_0                    ( ( uint32_t )0x00200000 )
#define DMA_SxCR_PBURST_1                    ( ( uint32_t )0x00400000 )
#define DMA_SxCR_ACK                         ( ( uint32_t )0x00100000 )
#define DMA_SxCR_CT                          ( ( uint32_t )0x00080000 )
#define DMA_SxCR_DBM                         ( ( uint32_t )0x00040000 )
#define DMA_SxCR_PL                          ( ( uint32_t )0x00030000 )
#define DMA_SxCR_PL_0                        ( ( uint32_t )0x00010000 )
#define DMA_SxCR_PL_1                        ( ( uint32_t )0x00020000 )
#define DMA_SxCR_PINCOS                      ( ( uint32_t )0x00008000 )
#define DMA_SxCR_MSIZE                       ( ( uint32_t )0x00006000 )
#define DMA_SxCR_MSIZE_0                     ( ( uint32_t )0x00002000 )
#define DMA_SxCR_MSIZE_1                     ( ( uint32_t )0x00004000 )
#define DMA_SxCR_PSIZE                       ( ( uint32_t )0x00001800 )
#define DMA_SxCR_PSIZE_0                     ( ( uint32_t )0x00000800 )
#define DMA_SxCR_PSIZE_1                     ( ( uint32_t )0x00001000 )
#define DMA_SxCR_MINC                        ( ( uint32_t )0x00000400 )
#define DMA_SxCR_PINC                        ( ( uint32_t )0x00000200 )
#define DMA_SxCR_CIRC                        ( ( uint32_t )0x00000100 )
#define DMA_SxCR_DIR                         ( ( uint32_t )0x000000C0 )
#define DMA_SxCR_DIR_0                       ( ( uint32_t )0x00000040 )
#define DMA_SxCR_DIR_1                       ( ( uint32_t )0x00000080 )
#define DMA_SxCR_PFCTRL                      ( ( uint32_t )0x00000020 )
#define DMA_SxCR_TCIE                        ( ( uint32_t )0x00000010 )
#define DMA_SxCR_HTIE                        ( ( uint32_t )0x00000008 )
#define DMA_SxCR_TEIE                        ( ( uint32_t )0x00000004 )
#define DMA_SxCR_DMEIE                       ( ( uint32_t )0x00000002 )
#define DMA_SxCR_EN                          ( ( uint32_t )0x00000001 )

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define DMA_SxNDT                            ( ( uint32_t )0x0000FFFF )
#define DMA_SxNDT_0                          ( ( uint32_t )0x00000001 )
#define DMA_SxNDT_1                          ( ( uint32_t )0x00000002 )
#define DMA_SxNDT_2                          ( ( uint32_t )0x00000004 )
#define DMA_SxNDT_3                          ( ( uint32_t )0x00000008 )
#define DMA_SxNDT_4                          ( ( uint32_t )0x00000010 )
#define DMA_SxNDT_5                          ( ( uint32_t )0x00000020 )
#define DMA_SxNDT_6                          ( ( uint32_t )0x00000040 )
#define DMA_SxNDT_7                          ( ( uint32_t )0x00000080 )
#define DMA_SxNDT_8                          ( ( uint32_t )0x00000100 )
#define DMA_SxNDT_9                          ( ( uint32_t )0x00000200 )
#define DMA_SxNDT_10                         ( ( uint32_t )0x00000400 )
#define DMA_SxNDT_11                         ( ( uint32_t )0x00000800 )
#define DMA_SxNDT_12                         ( ( uint32_t )0x00001000 )
#define DMA_SxNDT_13                         ( ( uint32_t )0x00002000 )
#define DMA_SxNDT_14                         ( ( uint32_t )0x00004000 )
#define DMA_SxNDT_15                         ( ( uint32_t )0x00008000 )

/********************  Bits definition for DMA_SxFCR register  ****************/
#define DMA_SxFCR_FEIE                       ( ( uint32_t )0x00000080 )
#define DMA_SxFCR_FS                         ( ( uint32_t )0x00000038 )
#define DMA_SxFCR_FS_0                       ( ( uint32_t )0x00000008 )
#define DMA_SxFCR_FS_1                       ( ( uint32_t )0x00000010 )
#define DMA_SxFCR_FS_2                       ( ( uint32_t )0x00000020 )
#define DMA_SxFCR_DMDIS                      ( ( uint32_t )0x00000004 )
#define DMA_SxFCR_FTH                        ( ( uint32_t )0x00000003 )
#define DMA_SxFCR_FTH_0                      ( ( uint32_t )0x00000001 )
#define DMA_SxFCR_FTH_1                      ( ( uint32_t )0x00000002 )

/********************  Bits definition for DMA_LISR register  *****************/
#define DMA_LISR_TCIF3                       ( ( uint32_t )0x08000000 )
#define DMA_LISR_HTIF3                       ( ( uint32_t )0x04000000 )
#define DMA_LISR_TEIF3                       ( ( uint32_t )0x02000000 )
#define DMA_LISR_DMEIF3                      ( ( uint32_t )0x01000000 )
#define DMA_LISR_FEIF3                       ( ( uint32_t )0x00400000 )
#define DMA_LISR_TCIF2                       ( ( uint32_t )0x00200000 )
#define DMA_LISR_HTIF2                       ( ( uint32_t )0x00100000 )
#define DMA_LISR_TEIF2                       ( ( uint32_t )0x00080000 )
#define DMA_LISR_DMEIF2                      ( ( uint32_t )0x00040000 )
#define DMA_LISR_FEIF2                       ( ( uint32_t )0x00010000 )
#define DMA_LISR_TCIF1                       ( ( uint32_t )0x00000800 )
#define DMA_LISR_HTIF1                       ( ( uint32_t )0x00000400 )
#define DMA_LISR_TEIF1                       ( ( uint32_t )0x00000200 )
#define DMA_LISR_DMEIF1                      ( ( uint32_t )0x00000100 )
#define DMA_LISR_FEIF1                       ( ( uint32_t )0x00000040 )
#define DMA_LISR_TCIF0                       ( ( uint32_t )0x00000020 )
#define DMA_LISR_HTIF0                       ( ( uint32_t )0x00000010 )
#define DMA_LISR_TEIF0                       ( ( uint32_t )0x00000008 )
#define DMA_LISR_DMEIF0                      ( ( uint32_t )0x00000004 )
#define DMA_LISR_FEIF0                       ( ( uint32_t )0x00000001 )

