etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bits definition for DMA_HISR register  *****************/
#define DMA_HISR_TCIF7                       ( ( uint32_t )0x08000000 )
#define DMA_HISR_HTIF7                       ( ( uint32_t )0x04000000 )
#define DMA_HISR_TEIF7                       ( ( uint32_t )0x02000000 )
#define DMA_HISR_DMEIF7                      ( ( uint32_t )0x01000000 )
#define DMA_HISR_FEIF7                       ( ( uint32_t )0x00400000 )
#define DMA_HISR_TCIF6                       ( ( uint32_t )0x00200000 )
#define DMA_HISR_HTIF6                       ( ( uint32_t )0x00100000 )
#define DMA_HISR_TEIF6                       ( ( uint32_t )0x00080000 )
#define DMA_HISR_DMEIF6                      ( ( uint32_t )0x00040000 )
#define DMA_HISR_FEIF6                       ( ( uint32_t )0x00010000 )
#define DMA_HISR_TCIF5                       ( ( uint32_t )0x00000800 )
#define DMA_HISR_HTIF5                       ( ( uint32_t )0x00000400 )
#define DMA_HISR_TEIF5                       ( ( uint32_t )0x00000200 )
#define DMA_HISR_DMEIF5                      ( ( uint32_t )0x00000100 )
#define DMA_HISR_FEIF5                       ( ( uint32_t )0x00000040 )
#define DMA_HISR_TCIF4                       ( ( uint32_t )0x00000020 )
#define DMA_HISR_HTIF4                       ( ( uint32_t )0x00000010 )
#define DMA_HISR_TEIF4                       ( ( uint32_t )0x00000008 )
#define DMA_HISR_DMEIF4                      ( ( uint32_t )0x00000004 )
#define DMA_HISR_FEIF4                       ( ( uint32_t )0x00000001 )

/********************  Bits definition for DMA_LIFCR register  ****************/
#define DMA_LIFCR_CTCIF3                     ( ( uint32_t )0x08000000 )
#define DMA_LIFCR_CHTIF3                     ( ( uint32_t )0x04000000 )
#define DMA_LIFCR_CTEIF3                     ( ( uint32_t )0x02000000 )
#define DMA_LIFCR_CDMEIF3                    ( ( uint32_t )0x01000000 )
#define DMA_LIFCR_CFEIF3                     ( ( uint32_t )0x00400000 )
#define DMA_LIFCR_CTCIF2                     ( ( uint32_t )0x00200000 )
#define DMA_LIFCR_CHTIF2                     ( ( uint32_t )0x00100000 )
#define DMA_LIFCR_CTEIF2                     ( ( uint32_t )0x00080000 )
#define DMA_LIFCR_CDMEIF2                    ( ( uint32_t )0x00040000 )
#define DMA_LIFCR_CFEIF2                     ( ( uint32_t )0x00010000 )
#define DMA_LIFCR_CTCIF1                     ( ( uint32_t )0x00000800 )
#define DMA_LIFCR_CHTIF1                     ( ( uint32_t )0x00000400 )
#define DMA_LIFCR_CTEIF1                     ( ( uint32_t )0x00000200 )
#define DMA_LIFCR_CDMEIF1                    ( ( uint32_t )0x00000100 )
#define DMA_LIFCR_CFEIF1                     ( ( uint32_t )0x00000040 )
#define DMA_LIFCR_CTCIF0                     ( ( uint32_t )0x00000020 )
#define DMA_LIFCR_CHTIF0                     ( ( uint32_t )0x00000010 )
#define DMA_LIFCR_CTEIF0                     ( ( uint32_t )0x00000008 )
#define DMA_LIFCR_CDMEIF0                    ( ( uint32_t )0x00000004 )
#define DMA_LIFCR_CFEIF0                     ( ( uint32_t )0x00000001 )

/********************  Bits definition for DMA_HIFCR  register  ****************/
#define DMA_HIFCR_CTCIF7                     ( ( uint32_t )0x08000000 )
#define DMA_HIFCR_CHTIF7                     ( ( uint32_t )0x04000000 )
#define DMA_HIFCR_CTEIF7                     ( ( uint32_t )0x02000000 )
#define DMA_HIFCR_CDMEIF7                    ( ( uint32_t )0x01000000 )
#define DMA_HIFCR_CFEIF7                     ( ( uint32_t )0x00400000 )
#define DMA_HIFCR_CTCIF6                     ( ( uint32_t )0x00200000 )
#define DMA_HIFCR_CHTIF6                     ( ( uint32_t )0x00100000 )
#define DMA_HIFCR_CTEIF6                     ( ( uint32_t )0x00080000 )
#define DMA_HIFCR_CDMEIF6                    ( ( uint32_t )0x00040000 )
#define DMA_HIFCR_CFEIF6                     ( ( uint32_t )0x00010000 )
#define DMA_HIFCR_CTCIF5                     ( ( uint32_t )0x00000800 )
#define DMA_HIFCR_CHTIF5                     ( ( uint32_t )0x00000400 )
#define DMA_HIFCR_CTEIF5                     ( ( uint32_t )0x00000200 )
#define DMA_HIFCR_CDMEIF5                    ( ( uint32_t )0x00000100 )
#define DMA_HIFCR_CFEIF5                     ( ( uint32_t )0x00000040 )
#define DMA_HIFCR_CTCIF4                     ( ( uint32_t )0x00000020 )
#define DMA_HIFCR_CHTIF4                     ( ( uint32_t )0x00000010 )
#define DMA_HIFCR_CTEIF4                     ( ( uint32_t )0x00000008 )
#define DMA_HIFCR_CDMEIF4                    ( ( uint32_t )0x00000004 )
#define DMA_HIFCR_CFEIF4                     ( ( uint32_t )0x00000001 )

/* ****************************************************************************
  
                      External Interrupt/Event Controller
  
  ****************************************************************************
  ******************  Bit definition for EXTI_IMR register  *******************/
#define  EXTI_IMR_MR0                        ( ( uint32_t )0x00000001 )			/*!< Interrupt Mask on line 0 */
#define  EXTI_IMR_MR1                        ( ( uint32_t )0x00000002 )			/*!< Interrupt Mask on line 1 */
#define  EXTI_IMR_MR2                        ( ( uint32_t )0x00000004 )			/*!< Interrupt Mask on line 2 */
#define  EXTI_IMR_MR3                        ( ( uint32_t )0x00000008 )			/*!< Interrupt Mask on line 3 */
#define  EXTI_IMR_MR4                        ( ( uint32_t )0x00000010 )			/*!< Interrupt Mask on line 4 */
#define  EXTI_IMR_MR5                        ( ( uint32_t )0x00000020 )			/*!< Interrupt Mask on line 5 */
#define  EXTI_IMR_MR6                        ( ( uint32_t )0x00000040 )			/*!< Interrupt Mask on line 6 */
#define  EXTI_IMR_MR7                        ( ( uint32_t )0x00000080 )			/*!< Interrupt Mask on line 7 */
#define  EXTI_IMR_MR8                        ( ( uint32_t )0x00000100 )			/*!< Interrupt Mask on line 8 */
#define  EXTI_IMR_MR9                        ( ( uint32_t )0x00000200 )			/*!< Interrupt Mask on line 9 */
#define  EXTI_IMR_MR10                       ( ( uint32_t )0x00000400 )			/*!< Interrupt Mask on line 10 */
#define  EXTI_IMR_MR11                       ( ( uint32_t )0x00000800 )			/*!< Interrupt Mask on line 11 */
#define  EXTI_IMR_MR12                       ( ( uint32_t )0x00001000 )			/*!< Interrupt Mask on line 12 */
#define  EXTI_IMR_MR13                       ( ( uint32_t )0x00002000 )			/*!< Interrupt Mask on line 13 */
#define  EXTI_IMR_MR14                       ( ( uint32_t )0x00004000 )			/*!< Interrupt Mask on line 14 */
#define  EXTI_IMR_MR15                       ( ( uint32_t )0x00008000 )			/*!< Interrupt Mask on line 15 */
#define  EXTI_IMR_MR16                       ( ( uint32_t )0x00010000 )			/*!< Interrupt Mask on line 16 */
#define  EXTI_IMR_MR17                       ( ( uint32_t )0x00020000 )			/*!< Interrupt Mask on line 17 */
#define  EXTI_IMR_MR18                       ( ( uint32_t )0x00040000 )			/*!< Interrupt Mask on line 18 */
#define  EXTI_IMR_MR19                       ( ( uint32_t )0x00080000 )			/*!< Interrupt Mask on line 19 */

/*******************  Bit definition for EXTI_EMR register  *******************/
#define  EXTI_EMR_MR0                        ( ( uint32_t )0x00000001 )			/*!< Event Mask on line 0 */
#define  EXTI_EMR_MR1                        ( ( uint32_t )0x00000002 )			/*!< Event Mask on line 1 */
#define  EXTI_EMR_MR2                        ( ( uint32_t )0x00000004 )			/*!< Event Mask on line 2 */
#define  EXTI_EMR_MR3                        ( ( uint32_t )0x00000008 )			/*!< Event Mask on line 3 */
#define  EXTI_EMR_MR4                        ( ( uint32_t )0x00000010 )			/*!< Event Mask on line 4 */
#define  EXTI_EMR_MR5                        ( ( uint32_t )0x00000020 )			/*!< Event Mask on line 5 */
#define  EXTI_EMR_MR6                        ( ( uint32_t )0x00000040 )			/*!< Event Mask on line 6 */
#define  EXTI_EMR_MR7                        ( ( uint32_t )0x00000080 )			/*!< Event Mask on line 7 */
#define  EXTI_EMR_MR8                        ( ( uint32_t )0x00000100 )			/*!< Event Mask on line 8 */
#define  EXTI_EMR_MR9                        ( ( uint32_t )0x00000200 )			/*!< Event Mask on line 9 */
#define  EXTI_EMR_MR10                       ( ( uint32_t )0x00000400 )			/*!< Event Mask on line 10 */
#define  EXTI_EMR_MR11                       ( ( uint32_t )0x00000800 )			/*!< Event Mask on line 11 */
#define  EXTI_EMR_MR12                       ( ( uint32_t )0x00001000 )			/*!< Event Mask on line 12 */
#define  EXTI_EMR_MR13                       ( ( uint32_t )0x00002000 )			/*!< Event Mask on line 13 */
#define  EXTI_EMR_MR14                       ( ( uint32_t )0x00004000 )			/*!< Event Mask on line 14 */
#define  EXTI_EMR_MR15                       ( ( uint32_t )0x00008000 )			/*!< Event Mask on line 15 */
#define  EXTI_EMR_MR16                       ( ( uint32_t )0x00010000 )			/*!< Event Mask on line 16 */
#define  EXTI_EMR_MR17                       ( ( uint32_t )0x00020000 )			/*!< Event Mask on line 17 */
#define  EXTI_EMR_MR18                       ( ( uint32_t )0x00040000 )			/*!< Event Mask on line 18 */
#define  EXTI_EMR_MR19                       ( ( uint32_t )0x00080000 )			/*!< Event Mask on line 19 */

/******************  Bit definition for EXTI_RTSR register  *******************/
#define  EXTI_RTSR_TR0                       ( ( uint32_t )0x00000001 )			/*!< Rising trigger event configuration
																				   bit of line 0 */
#define  EXTI_RTSR_TR1                       ( ( uint32_t )0x00000002 )			/*!< Rising trigger event configuration
																				   bit of line 1 */
#define  EXTI_RTSR_TR2                       ( ( uint32_t )0x00000004 )			/*!< Rising trigger event configuration
																				   bit of line 2 */
#define  EXTI_RTSR_TR3                       ( ( uint32_t )0x00000008 )			/*!< Rising trigger event configuration
																				   bit of line 3 */
#define  EXTI_RTSR_TR4                       ( ( uint32_t )0x00000010 )			/*!< Rising trigger event configuration
																				   bit of line 4 */
#define  EXTI_RTSR_TR5                       ( ( uint32_t )0x00000020 )			/*!< Rising trigger event configuration
																				   bit of line 5 */
#define  EXTI_RTSR_TR6                       ( ( uint32_t )0x00000040 )			/*!< Rising trigger event configuration
																				   bit of line 6 */
#define  EXTI_RTSR_TR7                       ( ( uint32_t )0x00000080 )			/*!< Rising trigger event configuration
																				   bit of line 7 */
#define  EXTI_RTSR_TR8                       ( ( uint32_t )0x00000100 )			/*!< Rising trigger event configuration
																				   bit of line 8 */
#define  EXTI_RTSR_TR9                       ( ( uint32_t )0x00000200 )			/*!< Rising trigger event configuration
																				   bit of line 9 */
#define  EXTI_RTSR_TR10                      ( ( uint32_t )0x00000400 )			/*!< Rising trigger event configuration
																				   bit of line 10 */
#define  EXTI_RTSR_TR11                      ( ( uint32_t )0x00000800 )			/*!< Rising trigger event configuration
																				   bit of line 11 */
#define  EXTI_RTSR_TR12                      ( ( uint32_t )0x00001000 )			/*!< Rising trigger event configuration
																				   bit of line 12 */
#define  EXTI_RTSR_TR13                      ( ( uint32_t )0x00002000 )			/*!< Rising trigger event configuration
																				   bit of line 13 */
#define  EXTI_RTSR_TR14                      ( ( uint32_t )0x00004000 )			/*!< Rising trigger event configuration
																				   bit of line 14 */
#define  EXTI_RTSR_TR15                      ( ( uint32_t )0x00008000 )			/*!< Rising trigger event configuration
																				   bit of line 15 */
#define  EXTI_RTSR_TR16                      ( ( uint32_t )0x00010000 )			/*!< Rising trigger event configuration
																				   bit of line 16 */
#define  EXTI_RTSR_TR17                      ( ( uint32_t )0x00020000 )			/*!< Rising trigger event configuration
																				   bit of line 17 */
#define  EXTI_RTSR_TR18                      ( ( uint32_t )0x00040000 )			/*!< Rising trigger event configuration
																				   bit of line 18 */
#define  EXTI_RTSR_TR19                      ( ( uint32_t )0x00080000 )			/*!< Rising trigger event configuration
																				   bit of line 19 */

/******************  Bit definition for EXTI_FTSR register  *******************/
#define  EXTI_FTSR_TR0                       ( ( uint32_t )0x00000001 )			/*!< Falling trigger event configuration
																				   bit of line 0 */
#define  EXTI_FTSR_TR1                       ( ( uint32_t )0x00000002 )			/*!< Falling trigger event configuration
																				   bit of line 1 */
#define  EXTI_FTSR_TR2                       ( ( uint32_t )0x00000004 )			/*!< Falling trigger event configuration
																				   bit of line 2 */
#define  EXTI_FTSR_TR3                       ( ( uint32_t )0x00000008 )			/*!< Falling trigger event configuration
																				   bit of line 3 */
#define  EXTI_FTSR_TR4                       ( ( uint32_t )0x00000010 )			/*!< Falling trigger event configuration
																				   bit of line 4 */
#define  EXTI_FTSR_TR5                       ( ( uint32_t )0x00000020 )			/*!< Falling trigger event configuration
																				   bit of line 5 */
#define  EXTI_FTSR_TR6                       ( ( uint32_t )0x00000040 )			/*!< Falling trigger event configuration
																				   bit of line 6 */
#define  EXTI_FTSR_TR7                       ( ( uint32_t )0x00000080 )			/*!< Falling trigger event configuration
																				   bit of line 7 */
#define  EXTI_FTSR_TR8                       ( ( uint32_t )0x00000100 )			/*!< Falling trigger event configuration
																				   bit of line 8 */
#define  EXTI_FTSR_TR9                       ( ( uint32_t )0x00000200 )			/*!< Falling trigger event configuration
																				   bit of line 9 */
#define  EXTI_FTSR_TR10                      ( ( uint32_t )0x00000400 )			/*!< Falling trigger event configuration
																				   bit of line 10 */
#define  EXTI_FTSR_TR11                      ( ( uint32_t )0x00000800 )			/*!< Falling trigger event configuration
																				   bit of line 11 */
#define  EXTI_FTSR_TR12                      ( ( uint32_t )0x00001000 )			/*!< Falling trigger event configuration
																				   bit of line 12 */
#define  EXTI_FTSR_TR13                      ( ( uint32_t )0x00002000 )			/*!< Falling trigger event configuration
																				   bit of line 13 */
#define  EXTI_FTSR_TR14                      ( ( uint32_t )0x00004000 )			/*!< Falling trigger event configuration
																				   bit of line 14 */
#define  EXTI_FTSR_TR15                      ( ( uint32_t )0x00008000 )			/*!< Falling trigger event configuration
																				   bit of line 15 */
#define  EXTI_FTSR_TR16                      ( ( uint32_t )0x00010000 )			/*!< Falling trigger event configuration
																				   bit of line 16 */
#define  EXTI_FTSR_TR17                      ( ( uint32_t )0x00020000 )			/*!< Falling trigger event configuration
																				   bit of line 17 */
#define  EXTI_FTSR_TR18                      ( ( uint32_t )0x00040000 )			/*!< Falling trigger event configuration
																				   bit of line 18 */
#define  EXTI_FTSR_TR19                      ( ( uint32_t )0x00080000 )			/*!< Falling trigger event configuration
																				   bit of line 19 */

/******************  Bit definition for EXTI_SWIER register  ******************/
#define  EXTI_SWIER_SWIER0                   ( ( uint32_t )0x00000001 )			/*!< Software Interrupt on line 0 */
#define  EXTI_SWIER_SWIER1                   ( ( uint32_t )0x00000002 )			/*!< Software Interrupt on line 1 */
#define  EXTI_SWIER_SWIER2                   ( ( uint32_t )0x00000004 )			/*!< Software Interrupt on line 2 */
#define  EXTI_SWIER_SWIER3                   ( ( uint32_t )0x00000008 )			/*!< Software Interrupt on line 3 */
#define  EXTI_SWIER_SWIER4                   ( ( uint32_t )0x00000010 )			/*!< Software Interrupt on line 4 */
#define  EXTI_SWIER_SWIER5                   ( ( uint32_t )0x00000020 )			/*!< Software Interrupt on line 5 */
#define  EXTI_SWIER_SWIER6                   ( ( uint32_t )0x00000040 )			/*!< Software Interrupt on line 6 */
#define  EXTI_SWIER_SWIER7                   ( ( uint32_t )0x00000080 )			/*!< Software Interrupt on line 7 */
#define  EXTI_SWIER_SWIER8                   ( ( uint32_t )0x00000100 )			/*!< Software Interrupt on line 8 */
#define  EXTI_SWIER_SWIER9                   ( ( uint32_t )0x00000200 )			/*!< Software Interrupt on line 9 */
#define  EXTI_SWIER_SWIER10                  ( ( uint32_t )0x00000400 )			/*!< Software Interrupt on line 10 */
#define  EXTI_SWIER_SWIER11                  ( ( uint32_t )0x00000800 )			/*!< Software Interrupt on line 11 */
#define  EXTI_SWIER_SWIER12                  ( ( uint32_t )0x00001000 )			/*!< Software Interrupt on line 12 */
#define  EXTI_SWIER_SWIER13                  ( ( uint32_t )0x00002000 )			/*!< Software Interrupt on line 13 */
#define  EXTI_SWIER_SWIER14                  ( ( uint32_t )0x00004000 )			/*!< Software Interrupt on line 14 */
#define  EXTI_SWIER_SWIER15                  ( ( uint32_t )0x00008000 )			/*!< Software Interrupt on line 15 */
#define  EXTI_SWIER_SWIER16                  ( ( uint32_t )0x00010000 )			/*!< Software Interrupt on line 16 */
#define  EXTI_SWIER_SWIER17                  ( ( uint32_t )0x00020000 )			/*!< Software Interrupt on line 17 */
#define  EXTI_SWIER_SWIER18                  ( ( uint32_t )0x00040000 )			/*!< Software Interrupt on line 18 */
#define  EXTI_SWIER_SWIER19                  ( ( uint32_t )0x00080000 )			/*!< Software Interrupt on line 19 */

/*******************  Bit definition for EXTI_PR register  ********************/
#define  EXTI_PR_PR0                         ( ( uint32_t )0x00000001 )			/*!< Pending bit for line 0 */
#define  EXTI_PR_PR1                         ( ( uint32_t )0x00000002 )			/*!< Pending bit for line 1 */
#define  EXTI_PR_PR2                         ( ( uint32_t )0x00000004 )			/*!< Pending bit for line 2 */
#define  EXTI_PR_PR3                         ( ( uint32_t )0x00000008 )			/*!< Pending bit for line 3 */
#define  EXTI_PR_PR4                         ( ( uint32_t )0x00000010 )			/*!< Pending bit for line 4 */
#define  EXTI_PR_PR5                         ( ( uint32_t )0x00000020 )			/*!< Pending bit for line 5 */
#define  EXTI_PR_PR6                         ( ( uint32_t )0x00000040 )			/*!< Pending bit for line 6 */
#define  EXTI_PR_PR7                         ( ( uint32_t )0x00000080 )			/*!< Pending bit for line 7 */
#define  EXTI_PR_PR8                         ( ( uint32_t )0x00000100 )			/*!< Pending bit for line 8 */
#define  EXTI_PR_PR9                         ( ( uint32_t )0x00000200 )			/*!< Pending bit for line 9 */
#define  EXTI_PR_PR10                        ( ( uint32_t )0x00000400 )			/*!< Pending bit for line 10 */
#define  EXTI_PR_PR11                        ( ( uint32_t )0x00000800 )			/*!< Pending bit for line 11 */
#define  EXTI_PR_PR12                        ( ( uint32_t )0x00001000 )			/*!< Pending bit for line 12 */
#define  EXTI_PR_PR13                        ( ( uint32_t )0x00002000 )			/*!< Pending bit for line 13 */
#define  EXTI_PR_PR14                        ( ( uint32_t )0x00004000 )			/*!< Pending bit for line 14 */
#define  EXTI_PR_PR15                        ( ( uint32_t )0x00008000 )			/*!< Pending bit for line 15 */
#define  EXTI_PR_PR16                        ( ( uint32_t )0x00010000 )			/*!< Pending bit for line 16 */
#define  EXTI_PR_PR17                        ( ( uint32_t )0x00020000 )			/*!< Pending bit for line 17 */
#define  EXTI_PR_PR18                        ( ( uint32_t )0x00040000 )			/*!< Pending bit for line 18 */
#define  EXTI_PR_PR19                        ( ( uint32_t )0x00080000 )			/*!< Pending bit for line 19 */

