etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
  
                                      FLASH
  
  ****************************************************************************
  ******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY                    ( ( uint32_t )0x00000007 )
#define FLASH_ACR_LATENCY_0WS                ( ( uint32_t )0x00000000 )
#define FLASH_ACR_LATENCY_1WS                ( ( uint32_t )0x00000001 )
#define FLASH_ACR_LATENCY_2WS                ( ( uint32_t )0x00000002 )
#define FLASH_ACR_LATENCY_3WS                ( ( uint32_t )0x00000003 )
#define FLASH_ACR_LATENCY_4WS                ( ( uint32_t )0x00000004 )
#define FLASH_ACR_LATENCY_5WS                ( ( uint32_t )0x00000005 )
#define FLASH_ACR_LATENCY_6WS                ( ( uint32_t )0x00000006 )
#define FLASH_ACR_LATENCY_7WS                ( ( uint32_t )0x00000007 )

#define FLASH_ACR_PRFTEN                     ( ( uint32_t )0x00000100 )
#define FLASH_ACR_ICEN                       ( ( uint32_t )0x00000200 )
#define FLASH_ACR_DCEN                       ( ( uint32_t )0x00000400 )
#define FLASH_ACR_ICRST                      ( ( uint32_t )0x00000800 )
#define FLASH_ACR_DCRST                      ( ( uint32_t )0x00001000 )
#define FLASH_ACR_BYTE0_ADDRESS              ( ( uint32_t )0x40023C00 )
#define FLASH_ACR_BYTE2_ADDRESS              ( ( uint32_t )0x40023C03 )

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP                         ( ( uint32_t )0x00000001 )
#define FLASH_SR_SOP                         ( ( uint32_t )0x00000002 )
#define FLASH_SR_WRPERR                      ( ( uint32_t )0x00000010 )
#define FLASH_SR_PGAERR                      ( ( uint32_t )0x00000020 )
#define FLASH_SR_PGPERR                      ( ( uint32_t )0x00000040 )
#define FLASH_SR_PGSERR                      ( ( uint32_t )0x00000080 )
#define FLASH_SR_BSY                         ( ( uint32_t )0x00010000 )

/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG                          ( ( uint32_t )0x00000001 )
#define FLASH_CR_SER                         ( ( uint32_t )0x00000002 )
#define FLASH_CR_MER                         ( ( uint32_t )0x00000004 )
#define FLASH_CR_SNB_0                       ( ( uint32_t )0x00000008 )
#define FLASH_CR_SNB_1                       ( ( uint32_t )0x00000010 )
#define FLASH_CR_SNB_2                       ( ( uint32_t )0x00000020 )
#define FLASH_CR_SNB_3                       ( ( uint32_t )0x00000040 )
#define FLASH_CR_PSIZE_0                     ( ( uint32_t )0x00000100 )
#define FLASH_CR_PSIZE_1                     ( ( uint32_t )0x00000200 )
#define FLASH_CR_STRT                        ( ( uint32_t )0x00010000 )
#define FLASH_CR_EOPIE                       ( ( uint32_t )0x01000000 )
#define FLASH_CR_LOCK                        ( ( uint32_t )0x80000000 )

/*******************  Bits definition for FLASH_OPTCR register  ***************/
#define FLASH_OPTCR_OPTLOCK                  ( ( uint32_t )0x00000001 )
#define FLASH_OPTCR_OPTSTRT                  ( ( uint32_t )0x00000002 )
#define FLASH_OPTCR_BOR_LEV_0                ( ( uint32_t )0x00000004 )
#define FLASH_OPTCR_BOR_LEV_1                ( ( uint32_t )0x00000008 )
#define FLASH_OPTCR_BOR_LEV                  ( ( uint32_t )0x0000000C )
#define FLASH_OPTCR_WDG_SW                   ( ( uint32_t )0x00000020 )
#define FLASH_OPTCR_nRST_STOP                ( ( uint32_t )0x00000040 )
#define FLASH_OPTCR_nRST_STDBY               ( ( uint32_t )0x00000080 )
#define FLASH_OPTCR_RDP_0                    ( ( uint32_t )0x00000100 )
#define FLASH_OPTCR_RDP_1                    ( ( uint32_t )0x00000200 )
#define FLASH_OPTCR_RDP_2                    ( ( uint32_t )0x00000400 )
#define FLASH_OPTCR_RDP_3                    ( ( uint32_t )0x00000800 )
#define FLASH_OPTCR_RDP_4                    ( ( uint32_t )0x00001000 )
#define FLASH_OPTCR_RDP_5                    ( ( uint32_t )0x00002000 )
#define FLASH_OPTCR_RDP_6                    ( ( uint32_t )0x00004000 )
#define FLASH_OPTCR_RDP_7                    ( ( uint32_t )0x00008000 )
#define FLASH_OPTCR_nWRP_0                   ( ( uint32_t )0x00010000 )
#define FLASH_OPTCR_nWRP_1                   ( ( uint32_t )0x00020000 )
#define FLASH_OPTCR_nWRP_2                   ( ( uint32_t )0x00040000 )
#define FLASH_OPTCR_nWRP_3                   ( ( uint32_t )0x00080000 )
#define FLASH_OPTCR_nWRP_4                   ( ( uint32_t )0x00100000 )
#define FLASH_OPTCR_nWRP_5                   ( ( uint32_t )0x00200000 )
#define FLASH_OPTCR_nWRP_6                   ( ( uint32_t )0x00400000 )
#define FLASH_OPTCR_nWRP_7                   ( ( uint32_t )0x00800000 )
#define FLASH_OPTCR_nWRP_8                   ( ( uint32_t )0x01000000 )
#define FLASH_OPTCR_nWRP_9                   ( ( uint32_t )0x02000000 )
#define FLASH_OPTCR_nWRP_10                  ( ( uint32_t )0x04000000 )
#define FLASH_OPTCR_nWRP_11                  ( ( uint32_t )0x08000000 )

/* ****************************************************************************
  
                         Flexible Static Memory Controller
  
  ****************************************************************************
  *****************  Bit definition for FSMC_BCR1 register  *******************/
#define  FSMC_BCR1_MBKEN                     ( ( uint32_t )0x00000001 )			/*!<Memory bank enable bit */
#define  FSMC_BCR1_MUXEN                     ( ( uint32_t )0x00000002 )			/*!<Address/data multiplexing enable bit
																				   */

#define  FSMC_BCR1_MTYP                      ( ( uint32_t )0x0000000C )			/*!<MTYP[1:0] bits (Memory type) */
#define  FSMC_BCR1_MTYP_0                    ( ( uint32_t )0x00000004 )			/*!<Bit 0 */
#define  FSMC_BCR1_MTYP_1                    ( ( uint32_t )0x00000008 )			/*!<Bit 1 */

#define  FSMC_BCR1_MWID                      ( ( uint32_t )0x00000030 )			/*!<MWID[1:0] bits (Memory data bus
																				   width) */
#define  FSMC_BCR1_MWID_0                    ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BCR1_MWID_1                    ( ( uint32_t )0x00000020 )			/*!<Bit 1 */

