etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/******************  Bit definition for FSMC_BTR2 register  *******************/
#define  FSMC_BTR2_ADDSET                    ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BTR2_ADDSET_0                  ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BTR2_ADDSET_1                  ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BTR2_ADDSET_2                  ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BTR2_ADDSET_3                  ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BTR2_ADDHLD                    ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BTR2_ADDHLD_0                  ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BTR2_ADDHLD_1                  ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BTR2_ADDHLD_2                  ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BTR2_ADDHLD_3                  ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BTR2_DATAST                    ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BTR2_DATAST_0                  ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BTR2_DATAST_1                  ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BTR2_DATAST_2                  ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BTR2_DATAST_3                  ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BTR2_BUSTURN                   ( ( uint32_t )0x000F0000 )			/*!<BUSTURN[3:0] bits (Bus turnaround
																				   phase duration) */
#define  FSMC_BTR2_BUSTURN_0                 ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_BTR2_BUSTURN_1                 ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_BTR2_BUSTURN_2                 ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_BTR2_BUSTURN_3                 ( ( uint32_t )0x00080000 )			/*!<Bit 3 */

#define  FSMC_BTR2_CLKDIV                    ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BTR2_CLKDIV_0                  ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BTR2_CLKDIV_1                  ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BTR2_CLKDIV_2                  ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BTR2_CLKDIV_3                  ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BTR2_DATLAT                    ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BTR2_DATLAT_0                  ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BTR2_DATLAT_1                  ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BTR2_DATLAT_2                  ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BTR2_DATLAT_3                  ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BTR2_ACCMOD                    ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BTR2_ACCMOD_0                  ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BTR2_ACCMOD_1                  ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/*******************  Bit definition for FSMC_BTR3 register  *******************/
#define  FSMC_BTR3_ADDSET                    ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BTR3_ADDSET_0                  ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BTR3_ADDSET_1                  ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BTR3_ADDSET_2                  ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BTR3_ADDSET_3                  ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BTR3_ADDHLD                    ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BTR3_ADDHLD_0                  ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BTR3_ADDHLD_1                  ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BTR3_ADDHLD_2                  ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BTR3_ADDHLD_3                  ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BTR3_DATAST                    ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BTR3_DATAST_0                  ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BTR3_DATAST_1                  ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BTR3_DATAST_2                  ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BTR3_DATAST_3                  ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BTR3_BUSTURN                   ( ( uint32_t )0x000F0000 )			/*!<BUSTURN[3:0] bits (Bus turnaround
																				   phase duration) */
#define  FSMC_BTR3_BUSTURN_0                 ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_BTR3_BUSTURN_1                 ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_BTR3_BUSTURN_2                 ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_BTR3_BUSTURN_3                 ( ( uint32_t )0x00080000 )			/*!<Bit 3 */

#define  FSMC_BTR3_CLKDIV                    ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BTR3_CLKDIV_0                  ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BTR3_CLKDIV_1                  ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BTR3_CLKDIV_2                  ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BTR3_CLKDIV_3                  ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BTR3_DATLAT                    ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BTR3_DATLAT_0                  ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BTR3_DATLAT_1                  ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BTR3_DATLAT_2                  ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BTR3_DATLAT_3                  ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BTR3_ACCMOD                    ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BTR3_ACCMOD_0                  ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BTR3_ACCMOD_1                  ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_BTR4 register  *******************/
#define  FSMC_BTR4_ADDSET                    ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BTR4_ADDSET_0                  ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BTR4_ADDSET_1                  ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BTR4_ADDSET_2                  ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BTR4_ADDSET_3                  ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BTR4_ADDHLD                    ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BTR4_ADDHLD_0                  ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BTR4_ADDHLD_1                  ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BTR4_ADDHLD_2                  ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BTR4_ADDHLD_3                  ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BTR4_DATAST                    ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BTR4_DATAST_0                  ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BTR4_DATAST_1                  ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BTR4_DATAST_2                  ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BTR4_DATAST_3                  ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BTR4_BUSTURN                   ( ( uint32_t )0x000F0000 )			/*!<BUSTURN[3:0] bits (Bus turnaround
																				   phase duration) */
#define  FSMC_BTR4_BUSTURN_0                 ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_BTR4_BUSTURN_1                 ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_BTR4_BUSTURN_2                 ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_BTR4_BUSTURN_3                 ( ( uint32_t )0x00080000 )			/*!<Bit 3 */

#define  FSMC_BTR4_CLKDIV                    ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BTR4_CLKDIV_0                  ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BTR4_CLKDIV_1                  ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BTR4_CLKDIV_2                  ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BTR4_CLKDIV_3                  ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

