etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  FSMC_BTR4_DATLAT                    ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BTR4_DATLAT_0                  ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BTR4_DATLAT_1                  ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BTR4_DATLAT_2                  ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BTR4_DATLAT_3                  ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BTR4_ACCMOD                    ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BTR4_ACCMOD_0                  ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BTR4_ACCMOD_1                  ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_BWTR1 register  ******************/
#define  FSMC_BWTR1_ADDSET                   ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BWTR1_ADDSET_0                 ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BWTR1_ADDSET_1                 ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BWTR1_ADDSET_2                 ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BWTR1_ADDSET_3                 ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BWTR1_ADDHLD                   ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BWTR1_ADDHLD_0                 ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BWTR1_ADDHLD_1                 ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BWTR1_ADDHLD_2                 ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BWTR1_ADDHLD_3                 ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BWTR1_DATAST                   ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BWTR1_DATAST_0                 ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BWTR1_DATAST_1                 ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BWTR1_DATAST_2                 ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BWTR1_DATAST_3                 ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BWTR1_CLKDIV                   ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BWTR1_CLKDIV_0                 ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BWTR1_CLKDIV_1                 ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BWTR1_CLKDIV_2                 ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BWTR1_CLKDIV_3                 ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BWTR1_DATLAT                   ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTR1_DATLAT_0                 ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BWTR1_DATLAT_1                 ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BWTR1_DATLAT_2                 ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BWTR1_DATLAT_3                 ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BWTR1_ACCMOD                   ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTR1_ACCMOD_0                 ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BWTR1_ACCMOD_1                 ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_BWTR2 register  ******************/
#define  FSMC_BWTR2_ADDSET                   ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BWTR2_ADDSET_0                 ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BWTR2_ADDSET_1                 ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BWTR2_ADDSET_2                 ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BWTR2_ADDSET_3                 ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BWTR2_ADDHLD                   ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BWTR2_ADDHLD_0                 ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BWTR2_ADDHLD_1                 ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BWTR2_ADDHLD_2                 ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BWTR2_ADDHLD_3                 ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BWTR2_DATAST                   ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BWTR2_DATAST_0                 ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BWTR2_DATAST_1                 ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BWTR2_DATAST_2                 ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BWTR2_DATAST_3                 ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BWTR2_CLKDIV                   ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BWTR2_CLKDIV_0                 ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BWTR2_CLKDIV_1                 ( ( uint32_t )0x00200000 )			/*!<Bit 1*/
#define  FSMC_BWTR2_CLKDIV_2                 ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BWTR2_CLKDIV_3                 ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BWTR2_DATLAT                   ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTR2_DATLAT_0                 ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BWTR2_DATLAT_1                 ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BWTR2_DATLAT_2                 ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BWTR2_DATLAT_3                 ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BWTR2_ACCMOD                   ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTR2_ACCMOD_0                 ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BWTR2_ACCMOD_1                 ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_BWTR3 register  ******************/
#define  FSMC_BWTR3_ADDSET                   ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BWTR3_ADDSET_0                 ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BWTR3_ADDSET_1                 ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BWTR3_ADDSET_2                 ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BWTR3_ADDSET_3                 ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

