etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  FSMC_BWTR3_ADDHLD                   ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BWTR3_ADDHLD_0                 ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BWTR3_ADDHLD_1                 ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BWTR3_ADDHLD_2                 ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BWTR3_ADDHLD_3                 ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BWTR3_DATAST                   ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BWTR3_DATAST_0                 ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BWTR3_DATAST_1                 ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BWTR3_DATAST_2                 ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BWTR3_DATAST_3                 ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BWTR3_CLKDIV                   ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BWTR3_CLKDIV_0                 ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BWTR3_CLKDIV_1                 ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BWTR3_CLKDIV_2                 ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BWTR3_CLKDIV_3                 ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BWTR3_DATLAT                   ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTR3_DATLAT_0                 ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BWTR3_DATLAT_1                 ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BWTR3_DATLAT_2                 ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BWTR3_DATLAT_3                 ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BWTR3_ACCMOD                   ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTR3_ACCMOD_0                 ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BWTR3_ACCMOD_1                 ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_BWTR4 register  ******************/
#define  FSMC_BWTR4_ADDSET                   ( ( uint32_t )0x0000000F )			/*!<ADDSET[3:0] bits (Address setup
																				   phase duration) */
#define  FSMC_BWTR4_ADDSET_0                 ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_BWTR4_ADDSET_1                 ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_BWTR4_ADDSET_2                 ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_BWTR4_ADDSET_3                 ( ( uint32_t )0x00000008 )			/*!<Bit 3 */

#define  FSMC_BWTR4_ADDHLD                   ( ( uint32_t )0x000000F0 )			/*!<ADDHLD[3:0] bits (Address-hold phase
																				   duration) */
#define  FSMC_BWTR4_ADDHLD_0                 ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_BWTR4_ADDHLD_1                 ( ( uint32_t )0x00000020 )			/*!<Bit 1 */
#define  FSMC_BWTR4_ADDHLD_2                 ( ( uint32_t )0x00000040 )			/*!<Bit 2 */
#define  FSMC_BWTR4_ADDHLD_3                 ( ( uint32_t )0x00000080 )			/*!<Bit 3 */

#define  FSMC_BWTR4_DATAST                   ( ( uint32_t )0x0000FF00 )			/*!<DATAST [3:0] bits (Data-phase
																				   duration) */
#define  FSMC_BWTR4_DATAST_0                 ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_BWTR4_DATAST_1                 ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_BWTR4_DATAST_2                 ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_BWTR4_DATAST_3                 ( ( uint32_t )0x00000800 )			/*!<Bit 3 */

#define  FSMC_BWTR4_CLKDIV                   ( ( uint32_t )0x00F00000 )			/*!<CLKDIV[3:0] bits (Clock divide
																				   ratio) */
#define  FSMC_BWTR4_CLKDIV_0                 ( ( uint32_t )0x00100000 )			/*!<Bit 0 */
#define  FSMC_BWTR4_CLKDIV_1                 ( ( uint32_t )0x00200000 )			/*!<Bit 1 */
#define  FSMC_BWTR4_CLKDIV_2                 ( ( uint32_t )0x00400000 )			/*!<Bit 2 */
#define  FSMC_BWTR4_CLKDIV_3                 ( ( uint32_t )0x00800000 )			/*!<Bit 3 */

#define  FSMC_BWTR4_DATLAT                   ( ( uint32_t )0x0F000000 )			/*!<DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTR4_DATLAT_0                 ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_BWTR4_DATLAT_1                 ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_BWTR4_DATLAT_2                 ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_BWTR4_DATLAT_3                 ( ( uint32_t )0x08000000 )			/*!<Bit 3 */

#define  FSMC_BWTR4_ACCMOD                   ( ( uint32_t )0x30000000 )			/*!<ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTR4_ACCMOD_0                 ( ( uint32_t )0x10000000 )			/*!<Bit 0 */
#define  FSMC_BWTR4_ACCMOD_1                 ( ( uint32_t )0x20000000 )			/*!<Bit 1 */

/******************  Bit definition for FSMC_PCR2 register  *******************/
#define  FSMC_PCR2_PWAITEN                   ( ( uint32_t )0x00000002 )			/*!<Wait feature enable bit */
#define  FSMC_PCR2_PBKEN                     ( ( uint32_t )0x00000004 )			/*!<PC Card/NAND Flash memory bank
																				   enable bit */
#define  FSMC_PCR2_PTYP                      ( ( uint32_t )0x00000008 )			/*!<Memory type */

#define  FSMC_PCR2_PWID                      ( ( uint32_t )0x00000030 )			/*!<PWID[1:0] bits (NAND Flash databus
																				   width) */
#define  FSMC_PCR2_PWID_0                    ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_PCR2_PWID_1                    ( ( uint32_t )0x00000020 )			/*!<Bit 1 */

#define  FSMC_PCR2_ECCEN                     ( ( uint32_t )0x00000040 )			/*!<ECC computation logic enable bit */

#define  FSMC_PCR2_TCLR                      ( ( uint32_t )0x00001E00 )			/*!<TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCR2_TCLR_0                    ( ( uint32_t )0x00000200 )			/*!<Bit 0 */
#define  FSMC_PCR2_TCLR_1                    ( ( uint32_t )0x00000400 )			/*!<Bit 1 */
#define  FSMC_PCR2_TCLR_2                    ( ( uint32_t )0x00000800 )			/*!<Bit 2 */
#define  FSMC_PCR2_TCLR_3                    ( ( uint32_t )0x00001000 )			/*!<Bit 3 */

