etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  FSMC_PCR2_TAR                       ( ( uint32_t )0x0001E000 )			/*!<TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCR2_TAR_0                     ( ( uint32_t )0x00002000 )			/*!<Bit 0 */
#define  FSMC_PCR2_TAR_1                     ( ( uint32_t )0x00004000 )			/*!<Bit 1 */
#define  FSMC_PCR2_TAR_2                     ( ( uint32_t )0x00008000 )			/*!<Bit 2 */
#define  FSMC_PCR2_TAR_3                     ( ( uint32_t )0x00010000 )			/*!<Bit 3 */

#define  FSMC_PCR2_ECCPS                     ( ( uint32_t )0x000E0000 )			/*!<ECCPS[1:0] bits (ECC page size) */
#define  FSMC_PCR2_ECCPS_0                   ( ( uint32_t )0x00020000 )			/*!<Bit 0 */
#define  FSMC_PCR2_ECCPS_1                   ( ( uint32_t )0x00040000 )			/*!<Bit 1 */
#define  FSMC_PCR2_ECCPS_2                   ( ( uint32_t )0x00080000 )			/*!<Bit 2 */

/******************  Bit definition for FSMC_PCR3 register  *******************/
#define  FSMC_PCR3_PWAITEN                   ( ( uint32_t )0x00000002 )			/*!<Wait feature enable bit */
#define  FSMC_PCR3_PBKEN                     ( ( uint32_t )0x00000004 )			/*!<PC Card/NAND Flash memory bank
																				   enable bit */
#define  FSMC_PCR3_PTYP                      ( ( uint32_t )0x00000008 )			/*!<Memory type */

#define  FSMC_PCR3_PWID                      ( ( uint32_t )0x00000030 )			/*!<PWID[1:0] bits (NAND Flash databus
																				   width) */
#define  FSMC_PCR3_PWID_0                    ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_PCR3_PWID_1                    ( ( uint32_t )0x00000020 )			/*!<Bit 1 */

#define  FSMC_PCR3_ECCEN                     ( ( uint32_t )0x00000040 )			/*!<ECC computation logic enable bit */

#define  FSMC_PCR3_TCLR                      ( ( uint32_t )0x00001E00 )			/*!<TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCR3_TCLR_0                    ( ( uint32_t )0x00000200 )			/*!<Bit 0 */
#define  FSMC_PCR3_TCLR_1                    ( ( uint32_t )0x00000400 )			/*!<Bit 1 */
#define  FSMC_PCR3_TCLR_2                    ( ( uint32_t )0x00000800 )			/*!<Bit 2 */
#define  FSMC_PCR3_TCLR_3                    ( ( uint32_t )0x00001000 )			/*!<Bit 3 */

#define  FSMC_PCR3_TAR                       ( ( uint32_t )0x0001E000 )			/*!<TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCR3_TAR_0                     ( ( uint32_t )0x00002000 )			/*!<Bit 0 */
#define  FSMC_PCR3_TAR_1                     ( ( uint32_t )0x00004000 )			/*!<Bit 1 */
#define  FSMC_PCR3_TAR_2                     ( ( uint32_t )0x00008000 )			/*!<Bit 2 */
#define  FSMC_PCR3_TAR_3                     ( ( uint32_t )0x00010000 )			/*!<Bit 3 */

#define  FSMC_PCR3_ECCPS                     ( ( uint32_t )0x000E0000 )			/*!<ECCPS[2:0] bits (ECC page size) */
#define  FSMC_PCR3_ECCPS_0                   ( ( uint32_t )0x00020000 )			/*!<Bit 0 */
#define  FSMC_PCR3_ECCPS_1                   ( ( uint32_t )0x00040000 )			/*!<Bit 1 */
#define  FSMC_PCR3_ECCPS_2                   ( ( uint32_t )0x00080000 )			/*!<Bit 2 */

/******************  Bit definition for FSMC_PCR4 register  *******************/
#define  FSMC_PCR4_PWAITEN                   ( ( uint32_t )0x00000002 )			/*!<Wait feature enable bit */
#define  FSMC_PCR4_PBKEN                     ( ( uint32_t )0x00000004 )			/*!<PC Card/NAND Flash memory bank
																				   enable bit */
#define  FSMC_PCR4_PTYP                      ( ( uint32_t )0x00000008 )			/*!<Memory type */

#define  FSMC_PCR4_PWID                      ( ( uint32_t )0x00000030 )			/*!<PWID[1:0] bits (NAND Flash databus
																				   width) */
#define  FSMC_PCR4_PWID_0                    ( ( uint32_t )0x00000010 )			/*!<Bit 0 */
#define  FSMC_PCR4_PWID_1                    ( ( uint32_t )0x00000020 )			/*!<Bit 1 */

#define  FSMC_PCR4_ECCEN                     ( ( uint32_t )0x00000040 )			/*!<ECC computation logic enable bit */

#define  FSMC_PCR4_TCLR                      ( ( uint32_t )0x00001E00 )			/*!<TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCR4_TCLR_0                    ( ( uint32_t )0x00000200 )			/*!<Bit 0 */
#define  FSMC_PCR4_TCLR_1                    ( ( uint32_t )0x00000400 )			/*!<Bit 1 */
#define  FSMC_PCR4_TCLR_2                    ( ( uint32_t )0x00000800 )			/*!<Bit 2 */
#define  FSMC_PCR4_TCLR_3                    ( ( uint32_t )0x00001000 )			/*!<Bit 3 */

#define  FSMC_PCR4_TAR                       ( ( uint32_t )0x0001E000 )			/*!<TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCR4_TAR_0                     ( ( uint32_t )0x00002000 )			/*!<Bit 0 */
#define  FSMC_PCR4_TAR_1                     ( ( uint32_t )0x00004000 )			/*!<Bit 1 */
#define  FSMC_PCR4_TAR_2                     ( ( uint32_t )0x00008000 )			/*!<Bit 2 */
#define  FSMC_PCR4_TAR_3                     ( ( uint32_t )0x00010000 )			/*!<Bit 3 */

#define  FSMC_PCR4_ECCPS                     ( ( uint32_t )0x000E0000 )			/*!<ECCPS[2:0] bits (ECC page size) */
#define  FSMC_PCR4_ECCPS_0                   ( ( uint32_t )0x00020000 )			/*!<Bit 0 */
#define  FSMC_PCR4_ECCPS_1                   ( ( uint32_t )0x00040000 )			/*!<Bit 1 */
#define  FSMC_PCR4_ECCPS_2                   ( ( uint32_t )0x00080000 )			/*!<Bit 2 */

/*******************  Bit definition for FSMC_SR2 register  *******************/
#define  FSMC_SR2_IRS                        ( ( uint8_t )0x01 )				/*!<Interrupt Rising Edge status */
#define  FSMC_SR2_ILS                        ( ( uint8_t )0x02 )				/*!<Interrupt Level status */
#define  FSMC_SR2_IFS                        ( ( uint8_t )0x04 )				/*!<Interrupt Falling Edge status */
#define  FSMC_SR2_IREN                       ( ( uint8_t )0x08 )				/*!<Interrupt Rising Edge detection
																				   Enable bit */
#define  FSMC_SR2_ILEN                       ( ( uint8_t )0x10 )				/*!<Interrupt Level detection Enable bit
																				   */
#define  FSMC_SR2_IFEN                       ( ( uint8_t )0x20 )				/*!<Interrupt Falling Edge detection
																				   Enable bit */
#define  FSMC_SR2_FEMPT                      ( ( uint8_t )0x40 )				/*!<FIFO empty */

/*******************  Bit definition for FSMC_SR3 register  *******************/
#define  FSMC_SR3_IRS                        ( ( uint8_t )0x01 )				/*!<Interrupt Rising Edge status */
#define  FSMC_SR3_ILS                        ( ( uint8_t )0x02 )				/*!<Interrupt Level status */
#define  FSMC_SR3_IFS                        ( ( uint8_t )0x04 )				/*!<Interrupt Falling Edge status */
#define  FSMC_SR3_IREN                       ( ( uint8_t )0x08 )				/*!<Interrupt Rising Edge detection
																				   Enable bit */
#define  FSMC_SR3_ILEN                       ( ( uint8_t )0x10 )				/*!<Interrupt Level detection Enable bit
																				   */
#define  FSMC_SR3_IFEN                       ( ( uint8_t )0x20 )				/*!<Interrupt Falling Edge detection
																				   Enable bit */
#define  FSMC_SR3_FEMPT                      ( ( uint8_t )0x40 )				/*!<FIFO empty */

/*******************  Bit definition for FSMC_SR4 register  *******************/
#define  FSMC_SR4_IRS                        ( ( uint8_t )0x01 )				/*!<Interrupt Rising Edge status */
#define  FSMC_SR4_ILS                        ( ( uint8_t )0x02 )				/*!<Interrupt Level status */
#define  FSMC_SR4_IFS                        ( ( uint8_t )0x04 )				/*!<Interrupt Falling Edge status */
#define  FSMC_SR4_IREN                       ( ( uint8_t )0x08 )				/*!<Interrupt Rising Edge detection
																				   Enable bit */
#define  FSMC_SR4_ILEN                       ( ( uint8_t )0x10 )				/*!<Interrupt Level detection Enable bit
																				   */
#define  FSMC_SR4_IFEN                       ( ( uint8_t )0x20 )				/*!<Interrupt Falling Edge detection
																				   Enable bit */
#define  FSMC_SR4_FEMPT                      ( ( uint8_t )0x40 )				/*!<FIFO empty */

/******************  Bit definition for FSMC_PMEM2 register  ******************/
#define  FSMC_PMEM2_MEMSET2                  ( ( uint32_t )0x000000FF )			/*!<MEMSET2[7:0] bits (Common memory 2
																				   setup time) */
#define  FSMC_PMEM2_MEMSET2_0                ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_PMEM2_MEMSET2_1                ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_PMEM2_MEMSET2_2                ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_PMEM2_MEMSET2_3                ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  FSMC_PMEM2_MEMSET2_4                ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  FSMC_PMEM2_MEMSET2_5                ( ( uint32_t )0x00000020 )			/*!<Bit 5 */
#define  FSMC_PMEM2_MEMSET2_6                ( ( uint32_t )0x00000040 )			/*!<Bit 6 */
#define  FSMC_PMEM2_MEMSET2_7                ( ( uint32_t )0x00000080 )			/*!<Bit 7 */

