etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  FSMC_PMEM2_MEMWAIT2                 ( ( uint32_t )0x0000FF00 )			/*!<MEMWAIT2[7:0] bits (Common memory 2
																				   wait time) */
#define  FSMC_PMEM2_MEMWAIT2_0               ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_PMEM2_MEMWAIT2_1               ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_PMEM2_MEMWAIT2_2               ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_PMEM2_MEMWAIT2_3               ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  FSMC_PMEM2_MEMWAIT2_4               ( ( uint32_t )0x00001000 )			/*!<Bit 4 */
#define  FSMC_PMEM2_MEMWAIT2_5               ( ( uint32_t )0x00002000 )			/*!<Bit 5 */
#define  FSMC_PMEM2_MEMWAIT2_6               ( ( uint32_t )0x00004000 )			/*!<Bit 6 */
#define  FSMC_PMEM2_MEMWAIT2_7               ( ( uint32_t )0x00008000 )			/*!<Bit 7 */

#define  FSMC_PMEM2_MEMHOLD2                 ( ( uint32_t )0x00FF0000 )			/*!<MEMHOLD2[7:0] bits (Common memory 2
																				   hold time) */
#define  FSMC_PMEM2_MEMHOLD2_0               ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_PMEM2_MEMHOLD2_1               ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_PMEM2_MEMHOLD2_2               ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_PMEM2_MEMHOLD2_3               ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  FSMC_PMEM2_MEMHOLD2_4               ( ( uint32_t )0x00100000 )			/*!<Bit 4 */
#define  FSMC_PMEM2_MEMHOLD2_5               ( ( uint32_t )0x00200000 )			/*!<Bit 5 */
#define  FSMC_PMEM2_MEMHOLD2_6               ( ( uint32_t )0x00400000 )			/*!<Bit 6 */
#define  FSMC_PMEM2_MEMHOLD2_7               ( ( uint32_t )0x00800000 )			/*!<Bit 7 */

#define  FSMC_PMEM2_MEMHIZ2                  ( ( uint32_t )0xFF000000 )			/*!<MEMHIZ2[7:0] bits (Common memory 2
																				   databus HiZ time) */
#define  FSMC_PMEM2_MEMHIZ2_0                ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_PMEM2_MEMHIZ2_1                ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_PMEM2_MEMHIZ2_2                ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_PMEM2_MEMHIZ2_3                ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  FSMC_PMEM2_MEMHIZ2_4                ( ( uint32_t )0x10000000 )			/*!<Bit 4 */
#define  FSMC_PMEM2_MEMHIZ2_5                ( ( uint32_t )0x20000000 )			/*!<Bit 5 */
#define  FSMC_PMEM2_MEMHIZ2_6                ( ( uint32_t )0x40000000 )			/*!<Bit 6 */
#define  FSMC_PMEM2_MEMHIZ2_7                ( ( uint32_t )0x80000000 )			/*!<Bit 7 */

/******************  Bit definition for FSMC_PMEM3 register  ******************/
#define  FSMC_PMEM3_MEMSET3                  ( ( uint32_t )0x000000FF )			/*!<MEMSET3[7:0] bits (Common memory 3
																				   setup time) */
#define  FSMC_PMEM3_MEMSET3_0                ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_PMEM3_MEMSET3_1                ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_PMEM3_MEMSET3_2                ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_PMEM3_MEMSET3_3                ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  FSMC_PMEM3_MEMSET3_4                ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  FSMC_PMEM3_MEMSET3_5                ( ( uint32_t )0x00000020 )			/*!<Bit 5 */
#define  FSMC_PMEM3_MEMSET3_6                ( ( uint32_t )0x00000040 )			/*!<Bit 6 */
#define  FSMC_PMEM3_MEMSET3_7                ( ( uint32_t )0x00000080 )			/*!<Bit 7 */

#define  FSMC_PMEM3_MEMWAIT3                 ( ( uint32_t )0x0000FF00 )			/*!<MEMWAIT3[7:0] bits (Common memory 3
																				   wait time) */
#define  FSMC_PMEM3_MEMWAIT3_0               ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_PMEM3_MEMWAIT3_1               ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_PMEM3_MEMWAIT3_2               ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_PMEM3_MEMWAIT3_3               ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  FSMC_PMEM3_MEMWAIT3_4               ( ( uint32_t )0x00001000 )			/*!<Bit 4 */
#define  FSMC_PMEM3_MEMWAIT3_5               ( ( uint32_t )0x00002000 )			/*!<Bit 5 */
#define  FSMC_PMEM3_MEMWAIT3_6               ( ( uint32_t )0x00004000 )			/*!<Bit 6 */
#define  FSMC_PMEM3_MEMWAIT3_7               ( ( uint32_t )0x00008000 )			/*!<Bit 7 */

#define  FSMC_PMEM3_MEMHOLD3                 ( ( uint32_t )0x00FF0000 )			/*!<MEMHOLD3[7:0] bits (Common memory 3
																				   hold time) */
#define  FSMC_PMEM3_MEMHOLD3_0               ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_PMEM3_MEMHOLD3_1               ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_PMEM3_MEMHOLD3_2               ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_PMEM3_MEMHOLD3_3               ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  FSMC_PMEM3_MEMHOLD3_4               ( ( uint32_t )0x00100000 )			/*!<Bit 4 */
#define  FSMC_PMEM3_MEMHOLD3_5               ( ( uint32_t )0x00200000 )			/*!<Bit 5 */
#define  FSMC_PMEM3_MEMHOLD3_6               ( ( uint32_t )0x00400000 )			/*!<Bit 6 */
#define  FSMC_PMEM3_MEMHOLD3_7               ( ( uint32_t )0x00800000 )			/*!<Bit 7 */

#define  FSMC_PMEM3_MEMHIZ3                  ( ( uint32_t )0xFF000000 )			/*!<MEMHIZ3[7:0] bits (Common memory 3
																				   databus HiZ time) */
#define  FSMC_PMEM3_MEMHIZ3_0                ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_PMEM3_MEMHIZ3_1                ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_PMEM3_MEMHIZ3_2                ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_PMEM3_MEMHIZ3_3                ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  FSMC_PMEM3_MEMHIZ3_4                ( ( uint32_t )0x10000000 )			/*!<Bit 4 */
#define  FSMC_PMEM3_MEMHIZ3_5                ( ( uint32_t )0x20000000 )			/*!<Bit 5 */
#define  FSMC_PMEM3_MEMHIZ3_6                ( ( uint32_t )0x40000000 )			/*!<Bit 6 */
#define  FSMC_PMEM3_MEMHIZ3_7                ( ( uint32_t )0x80000000 )			/*!<Bit 7 */

