etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/******************  Bit definition for FSMC_PATT3 register  ******************/
#define  FSMC_PATT3_ATTSET3                  ( ( uint32_t )0x000000FF )			/*!<ATTSET3[7:0] bits (Attribute memory
																				   3 setup time) */
#define  FSMC_PATT3_ATTSET3_0                ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_PATT3_ATTSET3_1                ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_PATT3_ATTSET3_2                ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_PATT3_ATTSET3_3                ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  FSMC_PATT3_ATTSET3_4                ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  FSMC_PATT3_ATTSET3_5                ( ( uint32_t )0x00000020 )			/*!<Bit 5 */
#define  FSMC_PATT3_ATTSET3_6                ( ( uint32_t )0x00000040 )			/*!<Bit 6 */
#define  FSMC_PATT3_ATTSET3_7                ( ( uint32_t )0x00000080 )			/*!<Bit 7 */

#define  FSMC_PATT3_ATTWAIT3                 ( ( uint32_t )0x0000FF00 )			/*!<ATTWAIT3[7:0] bits (Attribute memory
																				   3 wait time) */
#define  FSMC_PATT3_ATTWAIT3_0               ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_PATT3_ATTWAIT3_1               ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_PATT3_ATTWAIT3_2               ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_PATT3_ATTWAIT3_3               ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  FSMC_PATT3_ATTWAIT3_4               ( ( uint32_t )0x00001000 )			/*!<Bit 4 */
#define  FSMC_PATT3_ATTWAIT3_5               ( ( uint32_t )0x00002000 )			/*!<Bit 5 */
#define  FSMC_PATT3_ATTWAIT3_6               ( ( uint32_t )0x00004000 )			/*!<Bit 6 */
#define  FSMC_PATT3_ATTWAIT3_7               ( ( uint32_t )0x00008000 )			/*!<Bit 7 */

#define  FSMC_PATT3_ATTHOLD3                 ( ( uint32_t )0x00FF0000 )			/*!<ATTHOLD3[7:0] bits (Attribute memory
																				   3 hold time) */
#define  FSMC_PATT3_ATTHOLD3_0               ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_PATT3_ATTHOLD3_1               ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_PATT3_ATTHOLD3_2               ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_PATT3_ATTHOLD3_3               ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  FSMC_PATT3_ATTHOLD3_4               ( ( uint32_t )0x00100000 )			/*!<Bit 4 */
#define  FSMC_PATT3_ATTHOLD3_5               ( ( uint32_t )0x00200000 )			/*!<Bit 5 */
#define  FSMC_PATT3_ATTHOLD3_6               ( ( uint32_t )0x00400000 )			/*!<Bit 6 */
#define  FSMC_PATT3_ATTHOLD3_7               ( ( uint32_t )0x00800000 )			/*!<Bit 7 */

#define  FSMC_PATT3_ATTHIZ3                  ( ( uint32_t )0xFF000000 )			/*!<ATTHIZ3[7:0] bits (Attribute memory
																				   3 databus HiZ time) */
#define  FSMC_PATT3_ATTHIZ3_0                ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_PATT3_ATTHIZ3_1                ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_PATT3_ATTHIZ3_2                ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_PATT3_ATTHIZ3_3                ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  FSMC_PATT3_ATTHIZ3_4                ( ( uint32_t )0x10000000 )			/*!<Bit 4 */
#define  FSMC_PATT3_ATTHIZ3_5                ( ( uint32_t )0x20000000 )			/*!<Bit 5 */
#define  FSMC_PATT3_ATTHIZ3_6                ( ( uint32_t )0x40000000 )			/*!<Bit 6 */
#define  FSMC_PATT3_ATTHIZ3_7                ( ( uint32_t )0x80000000 )			/*!<Bit 7 */

/******************  Bit definition for FSMC_PATT4 register  ******************/
#define  FSMC_PATT4_ATTSET4                  ( ( uint32_t )0x000000FF )			/*!<ATTSET4[7:0] bits (Attribute memory
																				   4 setup time) */
#define  FSMC_PATT4_ATTSET4_0                ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_PATT4_ATTSET4_1                ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_PATT4_ATTSET4_2                ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_PATT4_ATTSET4_3                ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  FSMC_PATT4_ATTSET4_4                ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  FSMC_PATT4_ATTSET4_5                ( ( uint32_t )0x00000020 )			/*!<Bit 5 */
#define  FSMC_PATT4_ATTSET4_6                ( ( uint32_t )0x00000040 )			/*!<Bit 6 */
#define  FSMC_PATT4_ATTSET4_7                ( ( uint32_t )0x00000080 )			/*!<Bit 7 */

#define  FSMC_PATT4_ATTWAIT4                 ( ( uint32_t )0x0000FF00 )			/*!<ATTWAIT4[7:0] bits (Attribute memory
																				   4 wait time) */
#define  FSMC_PATT4_ATTWAIT4_0               ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_PATT4_ATTWAIT4_1               ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_PATT4_ATTWAIT4_2               ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_PATT4_ATTWAIT4_3               ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  FSMC_PATT4_ATTWAIT4_4               ( ( uint32_t )0x00001000 )			/*!<Bit 4 */
#define  FSMC_PATT4_ATTWAIT4_5               ( ( uint32_t )0x00002000 )			/*!<Bit 5 */
#define  FSMC_PATT4_ATTWAIT4_6               ( ( uint32_t )0x00004000 )			/*!<Bit 6 */
#define  FSMC_PATT4_ATTWAIT4_7               ( ( uint32_t )0x00008000 )			/*!<Bit 7 */

#define  FSMC_PATT4_ATTHOLD4                 ( ( uint32_t )0x00FF0000 )			/*!<ATTHOLD4[7:0] bits (Attribute memory
																				   4 hold time) */
#define  FSMC_PATT4_ATTHOLD4_0               ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_PATT4_ATTHOLD4_1               ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_PATT4_ATTHOLD4_2               ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_PATT4_ATTHOLD4_3               ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  FSMC_PATT4_ATTHOLD4_4               ( ( uint32_t )0x00100000 )			/*!<Bit 4 */
#define  FSMC_PATT4_ATTHOLD4_5               ( ( uint32_t )0x00200000 )			/*!<Bit 5 */
#define  FSMC_PATT4_ATTHOLD4_6               ( ( uint32_t )0x00400000 )			/*!<Bit 6 */
#define  FSMC_PATT4_ATTHOLD4_7               ( ( uint32_t )0x00800000 )			/*!<Bit 7 */

