etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  FSMC_PATT4_ATTHIZ4                  ( ( uint32_t )0xFF000000 )			/*!<ATTHIZ4[7:0] bits (Attribute memory
																				   4 databus HiZ time) */
#define  FSMC_PATT4_ATTHIZ4_0                ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_PATT4_ATTHIZ4_1                ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_PATT4_ATTHIZ4_2                ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_PATT4_ATTHIZ4_3                ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  FSMC_PATT4_ATTHIZ4_4                ( ( uint32_t )0x10000000 )			/*!<Bit 4 */
#define  FSMC_PATT4_ATTHIZ4_5                ( ( uint32_t )0x20000000 )			/*!<Bit 5 */
#define  FSMC_PATT4_ATTHIZ4_6                ( ( uint32_t )0x40000000 )			/*!<Bit 6 */
#define  FSMC_PATT4_ATTHIZ4_7                ( ( uint32_t )0x80000000 )			/*!<Bit 7 */

/******************  Bit definition for FSMC_PIO4 register  *******************/
#define  FSMC_PIO4_IOSET4                    ( ( uint32_t )0x000000FF )			/*!<IOSET4[7:0] bits (I/O 4 setup time)
																				   */
#define  FSMC_PIO4_IOSET4_0                  ( ( uint32_t )0x00000001 )			/*!<Bit 0 */
#define  FSMC_PIO4_IOSET4_1                  ( ( uint32_t )0x00000002 )			/*!<Bit 1 */
#define  FSMC_PIO4_IOSET4_2                  ( ( uint32_t )0x00000004 )			/*!<Bit 2 */
#define  FSMC_PIO4_IOSET4_3                  ( ( uint32_t )0x00000008 )			/*!<Bit 3 */
#define  FSMC_PIO4_IOSET4_4                  ( ( uint32_t )0x00000010 )			/*!<Bit 4 */
#define  FSMC_PIO4_IOSET4_5                  ( ( uint32_t )0x00000020 )			/*!<Bit 5 */
#define  FSMC_PIO4_IOSET4_6                  ( ( uint32_t )0x00000040 )			/*!<Bit 6 */
#define  FSMC_PIO4_IOSET4_7                  ( ( uint32_t )0x00000080 )			/*!<Bit 7 */

#define  FSMC_PIO4_IOWAIT4                   ( ( uint32_t )0x0000FF00 )			/*!<IOWAIT4[7:0] bits (I/O 4 wait time)
																				   */
#define  FSMC_PIO4_IOWAIT4_0                 ( ( uint32_t )0x00000100 )			/*!<Bit 0 */
#define  FSMC_PIO4_IOWAIT4_1                 ( ( uint32_t )0x00000200 )			/*!<Bit 1 */
#define  FSMC_PIO4_IOWAIT4_2                 ( ( uint32_t )0x00000400 )			/*!<Bit 2 */
#define  FSMC_PIO4_IOWAIT4_3                 ( ( uint32_t )0x00000800 )			/*!<Bit 3 */
#define  FSMC_PIO4_IOWAIT4_4                 ( ( uint32_t )0x00001000 )			/*!<Bit 4 */
#define  FSMC_PIO4_IOWAIT4_5                 ( ( uint32_t )0x00002000 )			/*!<Bit 5 */
#define  FSMC_PIO4_IOWAIT4_6                 ( ( uint32_t )0x00004000 )			/*!<Bit 6 */
#define  FSMC_PIO4_IOWAIT4_7                 ( ( uint32_t )0x00008000 )			/*!<Bit 7 */

#define  FSMC_PIO4_IOHOLD4                   ( ( uint32_t )0x00FF0000 )			/*!<IOHOLD4[7:0] bits (I/O 4 hold time)
																				   */
#define  FSMC_PIO4_IOHOLD4_0                 ( ( uint32_t )0x00010000 )			/*!<Bit 0 */
#define  FSMC_PIO4_IOHOLD4_1                 ( ( uint32_t )0x00020000 )			/*!<Bit 1 */
#define  FSMC_PIO4_IOHOLD4_2                 ( ( uint32_t )0x00040000 )			/*!<Bit 2 */
#define  FSMC_PIO4_IOHOLD4_3                 ( ( uint32_t )0x00080000 )			/*!<Bit 3 */
#define  FSMC_PIO4_IOHOLD4_4                 ( ( uint32_t )0x00100000 )			/*!<Bit 4 */
#define  FSMC_PIO4_IOHOLD4_5                 ( ( uint32_t )0x00200000 )			/*!<Bit 5 */
#define  FSMC_PIO4_IOHOLD4_6                 ( ( uint32_t )0x00400000 )			/*!<Bit 6 */
#define  FSMC_PIO4_IOHOLD4_7                 ( ( uint32_t )0x00800000 )			/*!<Bit 7 */

#define  FSMC_PIO4_IOHIZ4                    ( ( uint32_t )0xFF000000 )			/*!<IOHIZ4[7:0] bits (I/O 4 databus HiZ
																				   time) */
#define  FSMC_PIO4_IOHIZ4_0                  ( ( uint32_t )0x01000000 )			/*!<Bit 0 */
#define  FSMC_PIO4_IOHIZ4_1                  ( ( uint32_t )0x02000000 )			/*!<Bit 1 */
#define  FSMC_PIO4_IOHIZ4_2                  ( ( uint32_t )0x04000000 )			/*!<Bit 2 */
#define  FSMC_PIO4_IOHIZ4_3                  ( ( uint32_t )0x08000000 )			/*!<Bit 3 */
#define  FSMC_PIO4_IOHIZ4_4                  ( ( uint32_t )0x10000000 )			/*!<Bit 4 */
#define  FSMC_PIO4_IOHIZ4_5                  ( ( uint32_t )0x20000000 )			/*!<Bit 5 */
#define  FSMC_PIO4_IOHIZ4_6                  ( ( uint32_t )0x40000000 )			/*!<Bit 6 */
#define  FSMC_PIO4_IOHIZ4_7                  ( ( uint32_t )0x80000000 )			/*!<Bit 7 */

/******************  Bit definition for FSMC_ECCR2 register  ******************/
#define  FSMC_ECCR2_ECC2                     ( ( uint32_t )0xFFFFFFFF )			/*!<ECC result */

/******************  Bit definition for FSMC_ECCR3 register  ******************/
#define  FSMC_ECCR3_ECC3                     ( ( uint32_t )0xFFFFFFFF )			/*!<ECC result */

/* ****************************************************************************
  
                              General Purpose I/O
  
  ****************************************************************************
  *****************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0                    ( ( uint32_t )0x00000003 )
#define GPIO_MODER_MODER0_0                  ( ( uint32_t )0x00000001 )
#define GPIO_MODER_MODER0_1                  ( ( uint32_t )0x00000002 )

#define GPIO_MODER_MODER1                    ( ( uint32_t )0x0000000C )
#define GPIO_MODER_MODER1_0                  ( ( uint32_t )0x00000004 )
#define GPIO_MODER_MODER1_1                  ( ( uint32_t )0x00000008 )

#define GPIO_MODER_MODER2                    ( ( uint32_t )0x00000030 )
#define GPIO_MODER_MODER2_0                  ( ( uint32_t )0x00000010 )
#define GPIO_MODER_MODER2_1                  ( ( uint32_t )0x00000020 )

#define GPIO_MODER_MODER3                    ( ( uint32_t )0x000000C0 )
#define GPIO_MODER_MODER3_0                  ( ( uint32_t )0x00000040 )
#define GPIO_MODER_MODER3_1                  ( ( uint32_t )0x00000080 )

#define GPIO_MODER_MODER4                    ( ( uint32_t )0x00000300 )
#define GPIO_MODER_MODER4_0                  ( ( uint32_t )0x00000100 )
#define GPIO_MODER_MODER4_1                  ( ( uint32_t )0x00000200 )

#define GPIO_MODER_MODER5                    ( ( uint32_t )0x00000C00 )
#define GPIO_MODER_MODER5_0                  ( ( uint32_t )0x00000400 )
#define GPIO_MODER_MODER5_1                  ( ( uint32_t )0x00000800 )

#define GPIO_MODER_MODER6                    ( ( uint32_t )0x00003000 )
#define GPIO_MODER_MODER6_0                  ( ( uint32_t )0x00001000 )
#define GPIO_MODER_MODER6_1                  ( ( uint32_t )0x00002000 )

#define GPIO_MODER_MODER7                    ( ( uint32_t )0x0000C000 )
#define GPIO_MODER_MODER7_0                  ( ( uint32_t )0x00004000 )
#define GPIO_MODER_MODER7_1                  ( ( uint32_t )0x00008000 )

#define GPIO_MODER_MODER8                    ( ( uint32_t )0x00030000 )
#define GPIO_MODER_MODER8_0                  ( ( uint32_t )0x00010000 )
#define GPIO_MODER_MODER8_1                  ( ( uint32_t )0x00020000 )

#define GPIO_MODER_MODER9                    ( ( uint32_t )0x000C0000 )
#define GPIO_MODER_MODER9_0                  ( ( uint32_t )0x00040000 )
#define GPIO_MODER_MODER9_1                  ( ( uint32_t )0x00080000 )

