etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPDR0                    ( ( uint32_t )0x00000003 )
#define GPIO_PUPDR_PUPDR0_0                  ( ( uint32_t )0x00000001 )
#define GPIO_PUPDR_PUPDR0_1                  ( ( uint32_t )0x00000002 )

#define GPIO_PUPDR_PUPDR1                    ( ( uint32_t )0x0000000C )
#define GPIO_PUPDR_PUPDR1_0                  ( ( uint32_t )0x00000004 )
#define GPIO_PUPDR_PUPDR1_1                  ( ( uint32_t )0x00000008 )

#define GPIO_PUPDR_PUPDR2                    ( ( uint32_t )0x00000030 )
#define GPIO_PUPDR_PUPDR2_0                  ( ( uint32_t )0x00000010 )
#define GPIO_PUPDR_PUPDR2_1                  ( ( uint32_t )0x00000020 )

#define GPIO_PUPDR_PUPDR3                    ( ( uint32_t )0x000000C0 )
#define GPIO_PUPDR_PUPDR3_0                  ( ( uint32_t )0x00000040 )
#define GPIO_PUPDR_PUPDR3_1                  ( ( uint32_t )0x00000080 )

#define GPIO_PUPDR_PUPDR4                    ( ( uint32_t )0x00000300 )
#define GPIO_PUPDR_PUPDR4_0                  ( ( uint32_t )0x00000100 )
#define GPIO_PUPDR_PUPDR4_1                  ( ( uint32_t )0x00000200 )

#define GPIO_PUPDR_PUPDR5                    ( ( uint32_t )0x00000C00 )
#define GPIO_PUPDR_PUPDR5_0                  ( ( uint32_t )0x00000400 )
#define GPIO_PUPDR_PUPDR5_1                  ( ( uint32_t )0x00000800 )

#define GPIO_PUPDR_PUPDR6                    ( ( uint32_t )0x00003000 )
#define GPIO_PUPDR_PUPDR6_0                  ( ( uint32_t )0x00001000 )
#define GPIO_PUPDR_PUPDR6_1                  ( ( uint32_t )0x00002000 )

#define GPIO_PUPDR_PUPDR7                    ( ( uint32_t )0x0000C000 )
#define GPIO_PUPDR_PUPDR7_0                  ( ( uint32_t )0x00004000 )
#define GPIO_PUPDR_PUPDR7_1                  ( ( uint32_t )0x00008000 )

#define GPIO_PUPDR_PUPDR8                    ( ( uint32_t )0x00030000 )
#define GPIO_PUPDR_PUPDR8_0                  ( ( uint32_t )0x00010000 )
#define GPIO_PUPDR_PUPDR8_1                  ( ( uint32_t )0x00020000 )

#define GPIO_PUPDR_PUPDR9                    ( ( uint32_t )0x000C0000 )
#define GPIO_PUPDR_PUPDR9_0                  ( ( uint32_t )0x00040000 )
#define GPIO_PUPDR_PUPDR9_1                  ( ( uint32_t )0x00080000 )

#define GPIO_PUPDR_PUPDR10                   ( ( uint32_t )0x00300000 )
#define GPIO_PUPDR_PUPDR10_0                 ( ( uint32_t )0x00100000 )
#define GPIO_PUPDR_PUPDR10_1                 ( ( uint32_t )0x00200000 )

#define GPIO_PUPDR_PUPDR11                   ( ( uint32_t )0x00C00000 )
#define GPIO_PUPDR_PUPDR11_0                 ( ( uint32_t )0x00400000 )
#define GPIO_PUPDR_PUPDR11_1                 ( ( uint32_t )0x00800000 )

#define GPIO_PUPDR_PUPDR12                   ( ( uint32_t )0x03000000 )
#define GPIO_PUPDR_PUPDR12_0                 ( ( uint32_t )0x01000000 )
#define GPIO_PUPDR_PUPDR12_1                 ( ( uint32_t )0x02000000 )

#define GPIO_PUPDR_PUPDR13                   ( ( uint32_t )0x0C000000 )
#define GPIO_PUPDR_PUPDR13_0                 ( ( uint32_t )0x04000000 )
#define GPIO_PUPDR_PUPDR13_1                 ( ( uint32_t )0x08000000 )

#define GPIO_PUPDR_PUPDR14                   ( ( uint32_t )0x30000000 )
#define GPIO_PUPDR_PUPDR14_0                 ( ( uint32_t )0x10000000 )
#define GPIO_PUPDR_PUPDR14_1                 ( ( uint32_t )0x20000000 )

#define GPIO_PUPDR_PUPDR15                   ( ( uint32_t )0xC0000000 )
#define GPIO_PUPDR_PUPDR15_0                 ( ( uint32_t )0x40000000 )
#define GPIO_PUPDR_PUPDR15_1                 ( ( uint32_t )0x80000000 )

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR_0                       ( ( uint32_t )0x00000001 )
#define GPIO_IDR_IDR_1                       ( ( uint32_t )0x00000002 )
#define GPIO_IDR_IDR_2                       ( ( uint32_t )0x00000004 )
#define GPIO_IDR_IDR_3                       ( ( uint32_t )0x00000008 )
#define GPIO_IDR_IDR_4                       ( ( uint32_t )0x00000010 )
#define GPIO_IDR_IDR_5                       ( ( uint32_t )0x00000020 )
#define GPIO_IDR_IDR_6                       ( ( uint32_t )0x00000040 )
#define GPIO_IDR_IDR_7                       ( ( uint32_t )0x00000080 )
#define GPIO_IDR_IDR_8                       ( ( uint32_t )0x00000100 )
#define GPIO_IDR_IDR_9                       ( ( uint32_t )0x00000200 )
#define GPIO_IDR_IDR_10                      ( ( uint32_t )0x00000400 )
#define GPIO_IDR_IDR_11                      ( ( uint32_t )0x00000800 )
#define GPIO_IDR_IDR_12                      ( ( uint32_t )0x00001000 )
#define GPIO_IDR_IDR_13                      ( ( uint32_t )0x00002000 )
#define GPIO_IDR_IDR_14                      ( ( uint32_t )0x00004000 )
#define GPIO_IDR_IDR_15                      ( ( uint32_t )0x00008000 )
/* Old GPIO_IDR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_IDR_0                    GPIO_IDR_IDR_0
#define GPIO_OTYPER_IDR_1                    GPIO_IDR_IDR_1
#define GPIO_OTYPER_IDR_2                    GPIO_IDR_IDR_2
#define GPIO_OTYPER_IDR_3                    GPIO_IDR_IDR_3
#define GPIO_OTYPER_IDR_4                    GPIO_IDR_IDR_4
#define GPIO_OTYPER_IDR_5                    GPIO_IDR_IDR_5
#define GPIO_OTYPER_IDR_6                    GPIO_IDR_IDR_6
#define GPIO_OTYPER_IDR_7                    GPIO_IDR_IDR_7
#define GPIO_OTYPER_IDR_8                    GPIO_IDR_IDR_8
#define GPIO_OTYPER_IDR_9                    GPIO_IDR_IDR_9
#define GPIO_OTYPER_IDR_10                   GPIO_IDR_IDR_10
#define GPIO_OTYPER_IDR_11                   GPIO_IDR_IDR_11
#define GPIO_OTYPER_IDR_12                   GPIO_IDR_IDR_12
#define GPIO_OTYPER_IDR_13                   GPIO_IDR_IDR_13
#define GPIO_OTYPER_IDR_14                   GPIO_IDR_IDR_14
#define GPIO_OTYPER_IDR_15                   GPIO_IDR_IDR_15

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR_0                       ( ( uint32_t )0x00000001 )
#define GPIO_ODR_ODR_1                       ( ( uint32_t )0x00000002 )
#define GPIO_ODR_ODR_2                       ( ( uint32_t )0x00000004 )
#define GPIO_ODR_ODR_3                       ( ( uint32_t )0x00000008 )
#define GPIO_ODR_ODR_4                       ( ( uint32_t )0x00000010 )
#define GPIO_ODR_ODR_5                       ( ( uint32_t )0x00000020 )
#define GPIO_ODR_ODR_6                       ( ( uint32_t )0x00000040 )
#define GPIO_ODR_ODR_7                       ( ( uint32_t )0x00000080 )
#define GPIO_ODR_ODR_8                       ( ( uint32_t )0x00000100 )
#define GPIO_ODR_ODR_9                       ( ( uint32_t )0x00000200 )
#define GPIO_ODR_ODR_10                      ( ( uint32_t )0x00000400 )
#define GPIO_ODR_ODR_11                      ( ( uint32_t )0x00000800 )
#define GPIO_ODR_ODR_12                      ( ( uint32_t )0x00001000 )
#define GPIO_ODR_ODR_13                      ( ( uint32_t )0x00002000 )
#define GPIO_ODR_ODR_14                      ( ( uint32_t )0x00004000 )
#define GPIO_ODR_ODR_15                      ( ( uint32_t )0x00008000 )
/* Old GPIO_ODR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_ODR_0                    GPIO_ODR_ODR_0
#define GPIO_OTYPER_ODR_1                    GPIO_ODR_ODR_1
#define GPIO_OTYPER_ODR_2                    GPIO_ODR_ODR_2
#define GPIO_OTYPER_ODR_3                    GPIO_ODR_ODR_3
#define GPIO_OTYPER_ODR_4                    GPIO_ODR_ODR_4
#define GPIO_OTYPER_ODR_5                    GPIO_ODR_ODR_5
#define GPIO_OTYPER_ODR_6                    GPIO_ODR_ODR_6
#define GPIO_OTYPER_ODR_7                    GPIO_ODR_ODR_7
#define GPIO_OTYPER_ODR_8                    GPIO_ODR_ODR_8
#define GPIO_OTYPER_ODR_9                    GPIO_ODR_ODR_9
#define GPIO_OTYPER_ODR_10                   GPIO_ODR_ODR_10
#define GPIO_OTYPER_ODR_11                   GPIO_ODR_ODR_11
#define GPIO_OTYPER_ODR_12                   GPIO_ODR_ODR_12
#define GPIO_OTYPER_ODR_13                   GPIO_ODR_ODR_13
#define GPIO_OTYPER_ODR_14                   GPIO_ODR_ODR_14
#define GPIO_OTYPER_ODR_15                   GPIO_ODR_ODR_15

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS_0                       ( ( uint32_t )0x00000001 )
#define GPIO_BSRR_BS_1                       ( ( uint32_t )0x00000002 )
#define GPIO_BSRR_BS_2                       ( ( uint32_t )0x00000004 )
#define GPIO_BSRR_BS_3                       ( ( uint32_t )0x00000008 )
#define GPIO_BSRR_BS_4                       ( ( uint32_t )0x00000010 )
#define GPIO_BSRR_BS_5                       ( ( uint32_t )0x00000020 )
#define GPIO_BSRR_BS_6                       ( ( uint32_t )0x00000040 )
#define GPIO_BSRR_BS_7                       ( ( uint32_t )0x00000080 )
#define GPIO_BSRR_BS_8                       ( ( uint32_t )0x00000100 )
#define GPIO_BSRR_BS_9                       ( ( uint32_t )0x00000200 )
#define GPIO_BSRR_BS_10                      ( ( uint32_t )0x00000400 )
#define GPIO_BSRR_BS_11                      ( ( uint32_t )0x00000800 )
#define GPIO_BSRR_BS_12                      ( ( uint32_t )0x00001000 )
#define GPIO_BSRR_BS_13                      ( ( uint32_t )0x00002000 )
#define GPIO_BSRR_BS_14                      ( ( uint32_t )0x00004000 )
#define GPIO_BSRR_BS_15                      ( ( uint32_t )0x00008000 )
#define GPIO_BSRR_BR_0                       ( ( uint32_t )0x00010000 )
#define GPIO_BSRR_BR_1                       ( ( uint32_t )0x00020000 )
#define GPIO_BSRR_BR_2                       ( ( uint32_t )0x00040000 )
#define GPIO_BSRR_BR_3                       ( ( uint32_t )0x00080000 )
#define GPIO_BSRR_BR_4                       ( ( uint32_t )0x00100000 )
#define GPIO_BSRR_BR_5                       ( ( uint32_t )0x00200000 )
#define GPIO_BSRR_BR_6                       ( ( uint32_t )0x00400000 )
#define GPIO_BSRR_BR_7                       ( ( uint32_t )0x00800000 )
#define GPIO_BSRR_BR_8                       ( ( uint32_t )0x01000000 )
#define GPIO_BSRR_BR_9                       ( ( uint32_t )0x02000000 )
#define GPIO_BSRR_BR_10                      ( ( uint32_t )0x04000000 )
#define GPIO_BSRR_BR_11                      ( ( uint32_t )0x08000000 )
#define GPIO_BSRR_BR_12                      ( ( uint32_t )0x10000000 )
#define GPIO_BSRR_BR_13                      ( ( uint32_t )0x20000000 )
#define GPIO_BSRR_BR_14                      ( ( uint32_t )0x40000000 )
#define GPIO_BSRR_BR_15                      ( ( uint32_t )0x80000000 )

