etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
  
                                      HASH
  
  ****************************************************************************
  *****************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT                         ( ( uint32_t )0x00000004 )
#define HASH_CR_DMAE                         ( ( uint32_t )0x00000008 )
#define HASH_CR_DATATYPE                     ( ( uint32_t )0x00000030 )
#define HASH_CR_DATATYPE_0                   ( ( uint32_t )0x00000010 )
#define HASH_CR_DATATYPE_1                   ( ( uint32_t )0x00000020 )
#define HASH_CR_MODE                         ( ( uint32_t )0x00000040 )
#define HASH_CR_ALGO                         ( ( uint32_t )0x00000080 )
#define HASH_CR_NBW                          ( ( uint32_t )0x00000F00 )
#define HASH_CR_NBW_0                        ( ( uint32_t )0x00000100 )
#define HASH_CR_NBW_1                        ( ( uint32_t )0x00000200 )
#define HASH_CR_NBW_2                        ( ( uint32_t )0x00000400 )
#define HASH_CR_NBW_3                        ( ( uint32_t )0x00000800 )
#define HASH_CR_DINNE                        ( ( uint32_t )0x00001000 )
#define HASH_CR_LKEY                         ( ( uint32_t )0x00010000 )

/******************  Bits definition for HASH_STR register  *******************/
#define HASH_STR_NBW                         ( ( uint32_t )0x0000001F )
#define HASH_STR_NBW_0                       ( ( uint32_t )0x00000001 )
#define HASH_STR_NBW_1                       ( ( uint32_t )0x00000002 )
#define HASH_STR_NBW_2                       ( ( uint32_t )0x00000004 )
#define HASH_STR_NBW_3                       ( ( uint32_t )0x00000008 )
#define HASH_STR_NBW_4                       ( ( uint32_t )0x00000010 )
#define HASH_STR_DCAL                        ( ( uint32_t )0x00000100 )

/******************  Bits definition for HASH_IMR register  *******************/
#define HASH_IMR_DINIM                       ( ( uint32_t )0x00000001 )
#define HASH_IMR_DCIM                        ( ( uint32_t )0x00000002 )

/******************  Bits definition for HASH_SR register  ********************/
#define HASH_SR_DINIS                        ( ( uint32_t )0x00000001 )
#define HASH_SR_DCIS                         ( ( uint32_t )0x00000002 )
#define HASH_SR_DMAS                         ( ( uint32_t )0x00000004 )
#define HASH_SR_BUSY                         ( ( uint32_t )0x00000008 )

/* ****************************************************************************
  
                        Inter-integrated Circuit Interface
  
  ****************************************************************************
  ******************  Bit definition for I2C_CR1 register  ********************/
#define  I2C_CR1_PE                          ( ( uint16_t )0x0001 )				/*!<Peripheral Enable */
#define  I2C_CR1_SMBUS                       ( ( uint16_t )0x0002 )				/*!<SMBus Mode */
#define  I2C_CR1_SMBTYPE                     ( ( uint16_t )0x0008 )				/*!<SMBus Type */
#define  I2C_CR1_ENARP                       ( ( uint16_t )0x0010 )				/*!<ARP Enable */
#define  I2C_CR1_ENPEC                       ( ( uint16_t )0x0020 )				/*!<PEC Enable */
#define  I2C_CR1_ENGC                        ( ( uint16_t )0x0040 )				/*!<General Call Enable */
#define  I2C_CR1_NOSTRETCH                   ( ( uint16_t )0x0080 )				/*!<Clock Stretching Disable (Slave
																				   mode) */
#define  I2C_CR1_START                       ( ( uint16_t )0x0100 )				/*!<Start Generation */
#define  I2C_CR1_STOP                        ( ( uint16_t )0x0200 )				/*!<Stop Generation */
#define  I2C_CR1_ACK                         ( ( uint16_t )0x0400 )				/*!<Acknowledge Enable */
#define  I2C_CR1_POS                         ( ( uint16_t )0x0800 )				/*!<Acknowledge/PEC Position (for data
																				   reception) */
#define  I2C_CR1_PEC                         ( ( uint16_t )0x1000 )				/*!<Packet Error Checking */
#define  I2C_CR1_ALERT                       ( ( uint16_t )0x2000 )				/*!<SMBus Alert */
#define  I2C_CR1_SWRST                       ( ( uint16_t )0x8000 )				/*!<Software Reset */

/*******************  Bit definition for I2C_CR2 register  ********************/
#define  I2C_CR2_FREQ                        ( ( uint16_t )0x003F )				/*!<FREQ[5:0] bits (Peripheral Clock
																				   Frequency) */
#define  I2C_CR2_FREQ_0                      ( ( uint16_t )0x0001 )				/*!<Bit 0 */
#define  I2C_CR2_FREQ_1                      ( ( uint16_t )0x0002 )				/*!<Bit 1 */
#define  I2C_CR2_FREQ_2                      ( ( uint16_t )0x0004 )				/*!<Bit 2 */
#define  I2C_CR2_FREQ_3                      ( ( uint16_t )0x0008 )				/*!<Bit 3 */
#define  I2C_CR2_FREQ_4                      ( ( uint16_t )0x0010 )				/*!<Bit 4 */
#define  I2C_CR2_FREQ_5                      ( ( uint16_t )0x0020 )				/*!<Bit 5 */

#define  I2C_CR2_ITERREN                     ( ( uint16_t )0x0100 )				/*!<Error Interrupt Enable */
#define  I2C_CR2_ITEVTEN                     ( ( uint16_t )0x0200 )				/*!<Event Interrupt Enable */
#define  I2C_CR2_ITBUFEN                     ( ( uint16_t )0x0400 )				/*!<Buffer Interrupt Enable */
#define  I2C_CR2_DMAEN                       ( ( uint16_t )0x0800 )				/*!<DMA Requests Enable */
#define  I2C_CR2_LAST                        ( ( uint16_t )0x1000 )				/*!<DMA Last Transfer */

/*******************  Bit definition for I2C_OAR1 register  *******************/
#define  I2C_OAR1_ADD1_7                     ( ( uint16_t )0x00FE )				/*!<Interface Address */
#define  I2C_OAR1_ADD8_9                     ( ( uint16_t )0x0300 )				/*!<Interface Address */

#define  I2C_OAR1_ADD0                       ( ( uint16_t )0x0001 )				/*!<Bit 0 */
#define  I2C_OAR1_ADD1                       ( ( uint16_t )0x0002 )				/*!<Bit 1 */
#define  I2C_OAR1_ADD2                       ( ( uint16_t )0x0004 )				/*!<Bit 2 */
#define  I2C_OAR1_ADD3                       ( ( uint16_t )0x0008 )				/*!<Bit 3 */
#define  I2C_OAR1_ADD4                       ( ( uint16_t )0x0010 )				/*!<Bit 4 */
#define  I2C_OAR1_ADD5                       ( ( uint16_t )0x0020 )				/*!<Bit 5 */
#define  I2C_OAR1_ADD6                       ( ( uint16_t )0x0040 )				/*!<Bit 6 */
#define  I2C_OAR1_ADD7                       ( ( uint16_t )0x0080 )				/*!<Bit 7 */
#define  I2C_OAR1_ADD8                       ( ( uint16_t )0x0100 )				/*!<Bit 8 */
#define  I2C_OAR1_ADD9                       ( ( uint16_t )0x0200 )				/*!<Bit 9 */

#define  I2C_OAR1_ADDMODE                    ( ( uint16_t )0x8000 )				/*!<Addressing Mode (Slave mode) */

/*******************  Bit definition for I2C_OAR2 register  *******************/
#define  I2C_OAR2_ENDUAL                     ( ( uint8_t )0x01 )				/*!<Dual addressing mode enable */
#define  I2C_OAR2_ADD2                       ( ( uint8_t )0xFE )				/*!<Interface address */

