etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bit definition for I2C_DR register  ********************/
#define  I2C_DR_DR                           ( ( uint8_t )0xFF )				/*!<8-bit Data Register */

/*******************  Bit definition for I2C_SR1 register  ********************/
#define  I2C_SR1_SB                          ( ( uint16_t )0x0001 )				/*!<Start Bit (Master mode) */
#define  I2C_SR1_ADDR                        ( ( uint16_t )0x0002 )				/*!<Address sent (master mode)/matched
																				   (slave mode) */
#define  I2C_SR1_BTF                         ( ( uint16_t )0x0004 )				/*!<Byte Transfer Finished */
#define  I2C_SR1_ADD10                       ( ( uint16_t )0x0008 )				/*!<10-bit header sent (Master mode) */
#define  I2C_SR1_STOPF                       ( ( uint16_t )0x0010 )				/*!<Stop detection (Slave mode) */
#define  I2C_SR1_RXNE                        ( ( uint16_t )0x0040 )				/*!<Data Register not Empty (receivers)
																				   */
#define  I2C_SR1_TXE                         ( ( uint16_t )0x0080 )				/*!<Data Register Empty (transmitters)
																				   */
#define  I2C_SR1_BERR                        ( ( uint16_t )0x0100 )				/*!<Bus Error */
#define  I2C_SR1_ARLO                        ( ( uint16_t )0x0200 )				/*!<Arbitration Lost (master mode) */
#define  I2C_SR1_AF                          ( ( uint16_t )0x0400 )				/*!<Acknowledge Failure */
#define  I2C_SR1_OVR                         ( ( uint16_t )0x0800 )				/*!<Overrun/Underrun */
#define  I2C_SR1_PECERR                      ( ( uint16_t )0x1000 )				/*!<PEC Error in reception */
#define  I2C_SR1_TIMEOUT                     ( ( uint16_t )0x4000 )				/*!<Timeout or Tlow Error */
#define  I2C_SR1_SMBALERT                    ( ( uint16_t )0x8000 )				/*!<SMBus Alert */

/*******************  Bit definition for I2C_SR2 register  ********************/
#define  I2C_SR2_MSL                         ( ( uint16_t )0x0001 )				/*!<Master/Slave */
#define  I2C_SR2_BUSY                        ( ( uint16_t )0x0002 )				/*!<Bus Busy */
#define  I2C_SR2_TRA                         ( ( uint16_t )0x0004 )				/*!<Transmitter/Receiver */
#define  I2C_SR2_GENCALL                     ( ( uint16_t )0x0010 )				/*!<General Call Address (Slave mode) */
#define  I2C_SR2_SMBDEFAULT                  ( ( uint16_t )0x0020 )				/*!<SMBus Device Default Address (Slave
																				   mode) */
#define  I2C_SR2_SMBHOST                     ( ( uint16_t )0x0040 )				/*!<SMBus Host Header (Slave mode) */
#define  I2C_SR2_DUALF                       ( ( uint16_t )0x0080 )				/*!<Dual Flag (Slave mode) */
#define  I2C_SR2_PEC                         ( ( uint16_t )0xFF00 )				/*!<Packet Error Checking Register */

/*******************  Bit definition for I2C_CCR register  ********************/
#define  I2C_CCR_CCR                         ( ( uint16_t )0x0FFF )				/*!<Clock Control Register in
																				   Fast/Standard mode (Master mode) */
#define  I2C_CCR_DUTY                        ( ( uint16_t )0x4000 )				/*!<Fast Mode Duty Cycle */
#define  I2C_CCR_FS                          ( ( uint16_t )0x8000 )				/*!<I2C Master Mode Selection */

/******************  Bit definition for I2C_TRISE register  *******************/
#define  I2C_TRISE_TRISE                     ( ( uint8_t )0x3F )				/*!<Maximum Rise Time in Fast/Standard
																				   mode (Master mode) */

/* ****************************************************************************
  
                             Independent WATCHDOG
  
  ****************************************************************************
  ******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_KR_KEY                         ( ( uint16_t )0xFFFF )				/*!<Key value (write only, read 0000h)
																				   */

/*******************  Bit definition for IWDG_PR register  ********************/
#define  IWDG_PR_PR                          ( ( uint8_t )0x07 )				/*!<PR[2:0] (Prescaler divider) */
#define  IWDG_PR_PR_0                        ( ( uint8_t )0x01 )				/*!<Bit 0 */
#define  IWDG_PR_PR_1                        ( ( uint8_t )0x02 )				/*!<Bit 1 */
#define  IWDG_PR_PR_2                        ( ( uint8_t )0x04 )				/*!<Bit 2 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         ( ( uint16_t )0x0FFF )				/*!<Watchdog counter reload value */

/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         ( ( uint8_t )0x01 )				/*!<Watchdog prescaler value update */
#define  IWDG_SR_RVU                         ( ( uint8_t )0x02 )				/*!<Watchdog counter reload value update
																				   */

/* ****************************************************************************
  
                               Power Control
  
  ****************************************************************************
  *******************  Bit definition for PWR_CR register  ********************/
#define  PWR_CR_LPDS                         ( ( uint16_t )0x0001 )		/*!< Low-Power Deepsleep */
#define  PWR_CR_PDDS                         ( ( uint16_t )0x0002 )		/*!< Power Down Deepsleep */
#define  PWR_CR_CWUF                         ( ( uint16_t )0x0004 )		/*!< Clear Wakeup Flag */
#define  PWR_CR_CSBF                         ( ( uint16_t )0x0008 )		/*!< Clear Standby Flag */
#define  PWR_CR_PVDE                         ( ( uint16_t )0x0010 )		/*!< Power Voltage Detector Enable */

#define  PWR_CR_PLS                          ( ( uint16_t )0x00E0 )		/*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        ( ( uint16_t )0x0020 )		/*!< Bit 0 */
#define  PWR_CR_PLS_1                        ( ( uint16_t )0x0040 )		/*!< Bit 1 */
#define  PWR_CR_PLS_2                        ( ( uint16_t )0x0080 )		/*!< Bit 2 */


/*!< PVD level configuration */
#define  PWR_CR_PLS_LEV0                     ( ( uint16_t )0x0000 )		/*!< PVD level 0 */
#define  PWR_CR_PLS_LEV1                     ( ( uint16_t )0x0020 )		/*!< PVD level 1 */
#define  PWR_CR_PLS_LEV2                     ( ( uint16_t )0x0040 )		/*!< PVD level 2 */
#define  PWR_CR_PLS_LEV3                     ( ( uint16_t )0x0060 )		/*!< PVD level 3 */
#define  PWR_CR_PLS_LEV4                     ( ( uint16_t )0x0080 )		/*!< PVD level 4 */
#define  PWR_CR_PLS_LEV5                     ( ( uint16_t )0x00A0 )		/*!< PVD level 5 */
#define  PWR_CR_PLS_LEV6                     ( ( uint16_t )0x00C0 )		/*!< PVD level 6 */
#define  PWR_CR_PLS_LEV7                     ( ( uint16_t )0x00E0 )		/*!< PVD level 7 */

#define  PWR_CR_DBP                          ( ( uint16_t )0x0100 )		/*!< Disable Backup Domain write protection */
#define  PWR_CR_FPDS                         ( ( uint16_t )0x0200 )		/*!< Flash power down in Stop mode */
#define  PWR_CR_VOS                          ( ( uint16_t )0x4000 )		/*!< Regulator voltage scaling output selection
																		   */
/* Legacy define */
#define  PWR_CR_PMODE                        PWR_CR_VOS

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                         ( ( uint16_t )0x0001 )		/*!< Wakeup Flag */
#define  PWR_CSR_SBF                         ( ( uint16_t )0x0002 )		/*!< Standby Flag */
#define  PWR_CSR_PVDO                        ( ( uint16_t )0x0004 )		/*!< PVD Output */
#define  PWR_CSR_BRR                         ( ( uint16_t )0x0008 )		/*!< Backup regulator ready */
#define  PWR_CSR_EWUP                        ( ( uint16_t )0x0100 )		/*!< Enable WKUP pin */
#define  PWR_CSR_BRE                         ( ( uint16_t )0x0200 )		/*!< Backup regulator enable */
#define  PWR_CSR_VOSRDY                      ( ( uint16_t )0x4000 )		/*!< Regulator voltage scaling output selection
																		   ready */
/* Legacy define */
#define  PWR_CSR_REGRDY                      PWR_CSR_VOSRDY

