etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
  
                           Reset and Clock Control
  
  ****************************************************************************
  *******************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ( ( uint32_t )0x00000001 )
#define  RCC_CR_HSIRDY                       ( ( uint32_t )0x00000002 )

#define  RCC_CR_HSITRIM                      ( ( uint32_t )0x000000F8 )
#define  RCC_CR_HSITRIM_0                    ( ( uint32_t )0x00000008 )	/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1                    ( ( uint32_t )0x00000010 )	/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2                    ( ( uint32_t )0x00000020 )	/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3                    ( ( uint32_t )0x00000040 )	/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4                    ( ( uint32_t )0x00000080 )	/*!<Bit 4 */

#define  RCC_CR_HSICAL                       ( ( uint32_t )0x0000FF00 )
#define  RCC_CR_HSICAL_0                     ( ( uint32_t )0x00000100 )	/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                     ( ( uint32_t )0x00000200 )	/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                     ( ( uint32_t )0x00000400 )	/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                     ( ( uint32_t )0x00000800 )	/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                     ( ( uint32_t )0x00001000 )	/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                     ( ( uint32_t )0x00002000 )	/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                     ( ( uint32_t )0x00004000 )	/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                     ( ( uint32_t )0x00008000 )	/*!<Bit 7 */

#define  RCC_CR_HSEON                        ( ( uint32_t )0x00010000 )
#define  RCC_CR_HSERDY                       ( ( uint32_t )0x00020000 )
#define  RCC_CR_HSEBYP                       ( ( uint32_t )0x00040000 )
#define  RCC_CR_CSSON                        ( ( uint32_t )0x00080000 )
#define  RCC_CR_PLLON                        ( ( uint32_t )0x01000000 )
#define  RCC_CR_PLLRDY                       ( ( uint32_t )0x02000000 )
#define  RCC_CR_PLLI2SON                     ( ( uint32_t )0x04000000 )
#define  RCC_CR_PLLI2SRDY                    ( ( uint32_t )0x08000000 )

/********************  Bit definition for RCC_PLLCFGR register  ***************/
#define  RCC_PLLCFGR_PLLM                    ( ( uint32_t )0x0000003F )
#define  RCC_PLLCFGR_PLLM_0                  ( ( uint32_t )0x00000001 )
#define  RCC_PLLCFGR_PLLM_1                  ( ( uint32_t )0x00000002 )
#define  RCC_PLLCFGR_PLLM_2                  ( ( uint32_t )0x00000004 )
#define  RCC_PLLCFGR_PLLM_3                  ( ( uint32_t )0x00000008 )
#define  RCC_PLLCFGR_PLLM_4                  ( ( uint32_t )0x00000010 )
#define  RCC_PLLCFGR_PLLM_5                  ( ( uint32_t )0x00000020 )

#define  RCC_PLLCFGR_PLLN                     ( ( uint32_t )0x00007FC0 )
#define  RCC_PLLCFGR_PLLN_0                   ( ( uint32_t )0x00000040 )
#define  RCC_PLLCFGR_PLLN_1                   ( ( uint32_t )0x00000080 )
#define  RCC_PLLCFGR_PLLN_2                   ( ( uint32_t )0x00000100 )
#define  RCC_PLLCFGR_PLLN_3                   ( ( uint32_t )0x00000200 )
#define  RCC_PLLCFGR_PLLN_4                   ( ( uint32_t )0x00000400 )
#define  RCC_PLLCFGR_PLLN_5                   ( ( uint32_t )0x00000800 )
#define  RCC_PLLCFGR_PLLN_6                   ( ( uint32_t )0x00001000 )
#define  RCC_PLLCFGR_PLLN_7                   ( ( uint32_t )0x00002000 )
#define  RCC_PLLCFGR_PLLN_8                   ( ( uint32_t )0x00004000 )

#define  RCC_PLLCFGR_PLLP                    ( ( uint32_t )0x00030000 )
#define  RCC_PLLCFGR_PLLP_0                  ( ( uint32_t )0x00010000 )
#define  RCC_PLLCFGR_PLLP_1                  ( ( uint32_t )0x00020000 )

#define  RCC_PLLCFGR_PLLSRC                  ( ( uint32_t )0x00400000 )
#define  RCC_PLLCFGR_PLLSRC_HSE              ( ( uint32_t )0x00400000 )
#define  RCC_PLLCFGR_PLLSRC_HSI              ( ( uint32_t )0x00000000 )

#define  RCC_PLLCFGR_PLLQ                    ( ( uint32_t )0x0F000000 )
#define  RCC_PLLCFGR_PLLQ_0                  ( ( uint32_t )0x01000000 )
#define  RCC_PLLCFGR_PLLQ_1                  ( ( uint32_t )0x02000000 )
#define  RCC_PLLCFGR_PLLQ_2                  ( ( uint32_t )0x04000000 )
#define  RCC_PLLCFGR_PLLQ_3                  ( ( uint32_t )0x08000000 )

/* *******************  Bit definition for RCC_CFGR register  *****************
  !< SW configuration*/
#define  RCC_CFGR_SW                         ( ( uint32_t )0x00000003 )			/*!< SW[1:0] bits (System clock Switch)
																				   */
#define  RCC_CFGR_SW_0                       ( ( uint32_t )0x00000001 )			/*!< Bit 0 */
#define  RCC_CFGR_SW_1                       ( ( uint32_t )0x00000002 )			/*!< Bit 1 */

#define  RCC_CFGR_SW_HSI                     ( ( uint32_t )0x00000000 )			/*!< HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     ( ( uint32_t )0x00000001 )			/*!< HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     ( ( uint32_t )0x00000002 )			/*!< PLL selected as system clock */

/*!< SWS configuration */
#define  RCC_CFGR_SWS                        ( ( uint32_t )0x0000000C )			/*!< SWS[1:0] bits (System Clock Switch
																				   Status) */
#define  RCC_CFGR_SWS_0                      ( ( uint32_t )0x00000004 )			/*!< Bit 0 */
#define  RCC_CFGR_SWS_1                      ( ( uint32_t )0x00000008 )			/*!< Bit 1 */

#define  RCC_CFGR_SWS_HSI                    ( ( uint32_t )0x00000000 )			/*!< HSI oscillator used as system clock
																				   */
#define  RCC_CFGR_SWS_HSE                    ( ( uint32_t )0x00000004 )			/*!< HSE oscillator used as system clock
																				   */
#define  RCC_CFGR_SWS_PLL                    ( ( uint32_t )0x00000008 )			/*!< PLL used as system clock */

/*!< HPRE configuration */
#define  RCC_CFGR_HPRE                       ( ( uint32_t )0x000000F0 )			/*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     ( ( uint32_t )0x00000010 )			/*!< Bit 0 */
#define  RCC_CFGR_HPRE_1                     ( ( uint32_t )0x00000020 )			/*!< Bit 1 */
#define  RCC_CFGR_HPRE_2                     ( ( uint32_t )0x00000040 )			/*!< Bit 2 */
#define  RCC_CFGR_HPRE_3                     ( ( uint32_t )0x00000080 )			/*!< Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  ( ( uint32_t )0x00000000 )			/*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  ( ( uint32_t )0x00000080 )			/*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  ( ( uint32_t )0x00000090 )			/*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  ( ( uint32_t )0x000000A0 )			/*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 ( ( uint32_t )0x000000B0 )			/*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 ( ( uint32_t )0x000000C0 )			/*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                ( ( uint32_t )0x000000D0 )			/*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                ( ( uint32_t )0x000000E0 )			/*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                ( ( uint32_t )0x000000F0 )			/*!< SYSCLK divided by 512 */

