etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/*!< PPRE1 configuration */
#define  RCC_CFGR_PPRE1                      ( ( uint32_t )0x00001C00 )			/*!< PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_CFGR_PPRE1_0                    ( ( uint32_t )0x00000400 )			/*!< Bit 0 */
#define  RCC_CFGR_PPRE1_1                    ( ( uint32_t )0x00000800 )			/*!< Bit 1 */
#define  RCC_CFGR_PPRE1_2                    ( ( uint32_t )0x00001000 )			/*!< Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 ( ( uint32_t )0x00000000 )			/*!< HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 ( ( uint32_t )0x00001000 )			/*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 ( ( uint32_t )0x00001400 )			/*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 ( ( uint32_t )0x00001800 )			/*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                ( ( uint32_t )0x00001C00 )			/*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define  RCC_CFGR_PPRE2                      ( ( uint32_t )0x0000E000 )			/*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    ( ( uint32_t )0x00002000 )			/*!< Bit 0 */
#define  RCC_CFGR_PPRE2_1                    ( ( uint32_t )0x00004000 )			/*!< Bit 1 */
#define  RCC_CFGR_PPRE2_2                    ( ( uint32_t )0x00008000 )			/*!< Bit 2 */

#define  RCC_CFGR_PPRE2_DIV1                 ( ( uint32_t )0x00000000 )			/*!< HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 ( ( uint32_t )0x00008000 )			/*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 ( ( uint32_t )0x0000A000 )			/*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 ( ( uint32_t )0x0000C000 )			/*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                ( ( uint32_t )0x0000E000 )			/*!< HCLK divided by 16 */

/*!< RTCPRE configuration */
#define  RCC_CFGR_RTCPRE                     ( ( uint32_t )0x001F0000 )
#define  RCC_CFGR_RTCPRE_0                   ( ( uint32_t )0x00010000 )
#define  RCC_CFGR_RTCPRE_1                   ( ( uint32_t )0x00020000 )
#define  RCC_CFGR_RTCPRE_2                   ( ( uint32_t )0x00040000 )
#define  RCC_CFGR_RTCPRE_3                   ( ( uint32_t )0x00080000 )
#define  RCC_CFGR_RTCPRE_4                   ( ( uint32_t )0x00100000 )

/*!< MCO1 configuration */
#define  RCC_CFGR_MCO1                       ( ( uint32_t )0x00600000 )
#define  RCC_CFGR_MCO1_0                     ( ( uint32_t )0x00200000 )
#define  RCC_CFGR_MCO1_1                     ( ( uint32_t )0x00400000 )

#define  RCC_CFGR_I2SSRC                     ( ( uint32_t )0x00800000 )

#define  RCC_CFGR_MCO1PRE                    ( ( uint32_t )0x07000000 )
#define  RCC_CFGR_MCO1PRE_0                  ( ( uint32_t )0x01000000 )
#define  RCC_CFGR_MCO1PRE_1                  ( ( uint32_t )0x02000000 )
#define  RCC_CFGR_MCO1PRE_2                  ( ( uint32_t )0x04000000 )

#define  RCC_CFGR_MCO2PRE                    ( ( uint32_t )0x38000000 )
#define  RCC_CFGR_MCO2PRE_0                  ( ( uint32_t )0x08000000 )
#define  RCC_CFGR_MCO2PRE_1                  ( ( uint32_t )0x10000000 )
#define  RCC_CFGR_MCO2PRE_2                  ( ( uint32_t )0x20000000 )

#define  RCC_CFGR_MCO2                       ( ( uint32_t )0xC0000000 )
#define  RCC_CFGR_MCO2_0                     ( ( uint32_t )0x40000000 )
#define  RCC_CFGR_MCO2_1                     ( ( uint32_t )0x80000000 )

/********************  Bit definition for RCC_CIR register  *******************/
#define  RCC_CIR_LSIRDYF                     ( ( uint32_t )0x00000001 )
#define  RCC_CIR_LSERDYF                     ( ( uint32_t )0x00000002 )
#define  RCC_CIR_HSIRDYF                     ( ( uint32_t )0x00000004 )
#define  RCC_CIR_HSERDYF                     ( ( uint32_t )0x00000008 )
#define  RCC_CIR_PLLRDYF                     ( ( uint32_t )0x00000010 )
#define  RCC_CIR_PLLI2SRDYF                  ( ( uint32_t )0x00000020 )
#define  RCC_CIR_CSSF                        ( ( uint32_t )0x00000080 )
#define  RCC_CIR_LSIRDYIE                    ( ( uint32_t )0x00000100 )
#define  RCC_CIR_LSERDYIE                    ( ( uint32_t )0x00000200 )
#define  RCC_CIR_HSIRDYIE                    ( ( uint32_t )0x00000400 )
#define  RCC_CIR_HSERDYIE                    ( ( uint32_t )0x00000800 )
#define  RCC_CIR_PLLRDYIE                    ( ( uint32_t )0x00001000 )
#define  RCC_CIR_PLLI2SRDYIE                 ( ( uint32_t )0x00002000 )
#define  RCC_CIR_LSIRDYC                     ( ( uint32_t )0x00010000 )
#define  RCC_CIR_LSERDYC                     ( ( uint32_t )0x00020000 )
#define  RCC_CIR_HSIRDYC                     ( ( uint32_t )0x00040000 )
#define  RCC_CIR_HSERDYC                     ( ( uint32_t )0x00080000 )
#define  RCC_CIR_PLLRDYC                     ( ( uint32_t )0x00100000 )
#define  RCC_CIR_PLLI2SRDYC                  ( ( uint32_t )0x00200000 )
#define  RCC_CIR_CSSC                        ( ( uint32_t )0x00800000 )

/********************  Bit definition for RCC_AHB1RSTR register  **************/
#define  RCC_AHB1RSTR_GPIOARST               ( ( uint32_t )0x00000001 )
#define  RCC_AHB1RSTR_GPIOBRST               ( ( uint32_t )0x00000002 )
#define  RCC_AHB1RSTR_GPIOCRST               ( ( uint32_t )0x00000004 )
#define  RCC_AHB1RSTR_GPIODRST               ( ( uint32_t )0x00000008 )
#define  RCC_AHB1RSTR_GPIOERST               ( ( uint32_t )0x00000010 )
#define  RCC_AHB1RSTR_GPIOFRST               ( ( uint32_t )0x00000020 )
#define  RCC_AHB1RSTR_GPIOGRST               ( ( uint32_t )0x00000040 )
#define  RCC_AHB1RSTR_GPIOHRST               ( ( uint32_t )0x00000080 )
#define  RCC_AHB1RSTR_GPIOIRST               ( ( uint32_t )0x00000100 )
#define  RCC_AHB1RSTR_CRCRST                 ( ( uint32_t )0x00001000 )
#define  RCC_AHB1RSTR_DMA1RST                ( ( uint32_t )0x00200000 )
#define  RCC_AHB1RSTR_DMA2RST                ( ( uint32_t )0x00400000 )
#define  RCC_AHB1RSTR_ETHMACRST              ( ( uint32_t )0x02000000 )
#define  RCC_AHB1RSTR_OTGHRST                ( ( uint32_t )0x10000000 )

/********************  Bit definition for RCC_AHB2RSTR register  **************/
#define  RCC_AHB2RSTR_DCMIRST                ( ( uint32_t )0x00000001 )
#define  RCC_AHB2RSTR_CRYPRST                ( ( uint32_t )0x00000010 )
#define  RCC_AHB2RSTR_HSAHRST                ( ( uint32_t )0x00000020 )
#define  RCC_AHB2RSTR_RNGRST                 ( ( uint32_t )0x00000040 )
#define  RCC_AHB2RSTR_OTGFSRST               ( ( uint32_t )0x00000080 )

/********************  Bit definition for RCC_AHB3RSTR register  **************/
#define  RCC_AHB3RSTR_FSMCRST                ( ( uint32_t )0x00000001 )

/********************  Bit definition for RCC_APB1RSTR register  **************/
#define  RCC_APB1RSTR_TIM2RST                ( ( uint32_t )0x00000001 )
#define  RCC_APB1RSTR_TIM3RST                ( ( uint32_t )0x00000002 )
#define  RCC_APB1RSTR_TIM4RST                ( ( uint32_t )0x00000004 )
#define  RCC_APB1RSTR_TIM5RST                ( ( uint32_t )0x00000008 )
#define  RCC_APB1RSTR_TIM6RST                ( ( uint32_t )0x00000010 )
#define  RCC_APB1RSTR_TIM7RST                ( ( uint32_t )0x00000020 )
#define  RCC_APB1RSTR_TIM12RST               ( ( uint32_t )0x00000040 )
#define  RCC_APB1RSTR_TIM13RST               ( ( uint32_t )0x00000080 )
#define  RCC_APB1RSTR_TIM14RST               ( ( uint32_t )0x00000100 )
#define  RCC_APB1RSTR_WWDGEN                 ( ( uint32_t )0x00000800 )
#define  RCC_APB1RSTR_SPI2RST                ( ( uint32_t )0x00008000 )
#define  RCC_APB1RSTR_SPI3RST                ( ( uint32_t )0x00010000 )
#define  RCC_APB1RSTR_USART2RST              ( ( uint32_t )0x00020000 )
#define  RCC_APB1RSTR_USART3RST              ( ( uint32_t )0x00040000 )
#define  RCC_APB1RSTR_UART4RST               ( ( uint32_t )0x00080000 )
#define  RCC_APB1RSTR_UART5RST               ( ( uint32_t )0x00100000 )
#define  RCC_APB1RSTR_I2C1RST                ( ( uint32_t )0x00200000 )
#define  RCC_APB1RSTR_I2C2RST                ( ( uint32_t )0x00400000 )
#define  RCC_APB1RSTR_I2C3RST                ( ( uint32_t )0x00800000 )
#define  RCC_APB1RSTR_CAN1RST                ( ( uint32_t )0x02000000 )
#define  RCC_APB1RSTR_CAN2RST                ( ( uint32_t )0x04000000 )
#define  RCC_APB1RSTR_PWRRST                 ( ( uint32_t )0x10000000 )
#define  RCC_APB1RSTR_DACRST                 ( ( uint32_t )0x20000000 )

/********************  Bit definition for RCC_APB2RSTR register  **************/
#define  RCC_APB2RSTR_TIM1RST                ( ( uint32_t )0x00000001 )
#define  RCC_APB2RSTR_TIM8RST                ( ( uint32_t )0x00000002 )
#define  RCC_APB2RSTR_USART1RST              ( ( uint32_t )0x00000010 )
#define  RCC_APB2RSTR_USART6RST              ( ( uint32_t )0x00000020 )
#define  RCC_APB2RSTR_ADCRST                 ( ( uint32_t )0x00000100 )
#define  RCC_APB2RSTR_SDIORST                ( ( uint32_t )0x00000800 )
#define  RCC_APB2RSTR_SPI1RST                ( ( uint32_t )0x00001000 )
#define  RCC_APB2RSTR_SYSCFGRST              ( ( uint32_t )0x00004000 )
#define  RCC_APB2RSTR_TIM9RST                ( ( uint32_t )0x00010000 )
#define  RCC_APB2RSTR_TIM10RST               ( ( uint32_t )0x00020000 )
#define  RCC_APB2RSTR_TIM11RST               ( ( uint32_t )0x00040000 )
/* Old SPI1RST bit definition, maintained for legacy purpose */
#define  RCC_APB2RSTR_SPI1                   RCC_APB2RSTR_SPI1RST

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define  RCC_AHB1ENR_GPIOAEN                 ( ( uint32_t )0x00000001 )
#define  RCC_AHB1ENR_GPIOBEN                 ( ( uint32_t )0x00000002 )
#define  RCC_AHB1ENR_GPIOCEN                 ( ( uint32_t )0x00000004 )
#define  RCC_AHB1ENR_GPIODEN                 ( ( uint32_t )0x00000008 )
#define  RCC_AHB1ENR_GPIOEEN                 ( ( uint32_t )0x00000010 )
#define  RCC_AHB1ENR_GPIOFEN                 ( ( uint32_t )0x00000020 )
#define  RCC_AHB1ENR_GPIOGEN                 ( ( uint32_t )0x00000040 )
#define  RCC_AHB1ENR_GPIOHEN                 ( ( uint32_t )0x00000080 )
#define  RCC_AHB1ENR_GPIOIEN                 ( ( uint32_t )0x00000100 )
#define  RCC_AHB1ENR_CRCEN                   ( ( uint32_t )0x00001000 )
#define  RCC_AHB1ENR_BKPSRAMEN               ( ( uint32_t )0x00040000 )
#define  RCC_AHB1ENR_CCMDATARAMEN            ( ( uint32_t )0x00100000 )
#define  RCC_AHB1ENR_DMA1EN                  ( ( uint32_t )0x00200000 )
#define  RCC_AHB1ENR_DMA2EN                  ( ( uint32_t )0x00400000 )
#define  RCC_AHB1ENR_ETHMACEN                ( ( uint32_t )0x02000000 )
#define  RCC_AHB1ENR_ETHMACTXEN              ( ( uint32_t )0x04000000 )
#define  RCC_AHB1ENR_ETHMACRXEN              ( ( uint32_t )0x08000000 )
#define  RCC_AHB1ENR_ETHMACPTPEN             ( ( uint32_t )0x10000000 )
#define  RCC_AHB1ENR_OTGHSEN                 ( ( uint32_t )0x20000000 )
#define  RCC_AHB1ENR_OTGHSULPIEN             ( ( uint32_t )0x40000000 )

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define  RCC_AHB2ENR_DCMIEN                  ( ( uint32_t )0x00000001 )
#define  RCC_AHB2ENR_CRYPEN                  ( ( uint32_t )0x00000010 )
#define  RCC_AHB2ENR_HASHEN                  ( ( uint32_t )0x00000020 )
#define  RCC_AHB2ENR_RNGEN                   ( ( uint32_t )0x00000040 )
#define  RCC_AHB2ENR_OTGFSEN                 ( ( uint32_t )0x00000080 )

