etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bit definition for RCC_AHB3ENR register  ***************/
#define  RCC_AHB3ENR_FSMCEN                  ( ( uint32_t )0x00000001 )

/********************  Bit definition for RCC_APB1ENR register  ***************/
#define  RCC_APB1ENR_TIM2EN                  ( ( uint32_t )0x00000001 )
#define  RCC_APB1ENR_TIM3EN                  ( ( uint32_t )0x00000002 )
#define  RCC_APB1ENR_TIM4EN                  ( ( uint32_t )0x00000004 )
#define  RCC_APB1ENR_TIM5EN                  ( ( uint32_t )0x00000008 )
#define  RCC_APB1ENR_TIM6EN                  ( ( uint32_t )0x00000010 )
#define  RCC_APB1ENR_TIM7EN                  ( ( uint32_t )0x00000020 )
#define  RCC_APB1ENR_TIM12EN                 ( ( uint32_t )0x00000040 )
#define  RCC_APB1ENR_TIM13EN                 ( ( uint32_t )0x00000080 )
#define  RCC_APB1ENR_TIM14EN                 ( ( uint32_t )0x00000100 )
#define  RCC_APB1ENR_WWDGEN                  ( ( uint32_t )0x00000800 )
#define  RCC_APB1ENR_SPI2EN                  ( ( uint32_t )0x00004000 )
#define  RCC_APB1ENR_SPI3EN                  ( ( uint32_t )0x00008000 )
#define  RCC_APB1ENR_USART2EN                ( ( uint32_t )0x00020000 )
#define  RCC_APB1ENR_USART3EN                ( ( uint32_t )0x00040000 )
#define  RCC_APB1ENR_UART4EN                 ( ( uint32_t )0x00080000 )
#define  RCC_APB1ENR_UART5EN                 ( ( uint32_t )0x00100000 )
#define  RCC_APB1ENR_I2C1EN                  ( ( uint32_t )0x00200000 )
#define  RCC_APB1ENR_I2C2EN                  ( ( uint32_t )0x00400000 )
#define  RCC_APB1ENR_I2C3EN                  ( ( uint32_t )0x00800000 )
#define  RCC_APB1ENR_CAN1EN                  ( ( uint32_t )0x02000000 )
#define  RCC_APB1ENR_CAN2EN                  ( ( uint32_t )0x04000000 )
#define  RCC_APB1ENR_PWREN                   ( ( uint32_t )0x10000000 )
#define  RCC_APB1ENR_DACEN                   ( ( uint32_t )0x20000000 )

/********************  Bit definition for RCC_APB2ENR register  ***************/
#define  RCC_APB2ENR_TIM1EN                  ( ( uint32_t )0x00000001 )
#define  RCC_APB2ENR_TIM8EN                  ( ( uint32_t )0x00000002 )
#define  RCC_APB2ENR_USART1EN                ( ( uint32_t )0x00000010 )
#define  RCC_APB2ENR_USART6EN                ( ( uint32_t )0x00000020 )
#define  RCC_APB2ENR_ADC1EN                  ( ( uint32_t )0x00000100 )
#define  RCC_APB2ENR_ADC2EN                  ( ( uint32_t )0x00000200 )
#define  RCC_APB2ENR_ADC3EN                  ( ( uint32_t )0x00000400 )
#define  RCC_APB2ENR_SDIOEN                  ( ( uint32_t )0x00000800 )
#define  RCC_APB2ENR_SPI1EN                  ( ( uint32_t )0x00001000 )
#define  RCC_APB2ENR_SYSCFGEN                ( ( uint32_t )0x00004000 )
#define  RCC_APB2ENR_TIM11EN                 ( ( uint32_t )0x00040000 )
#define  RCC_APB2ENR_TIM10EN                 ( ( uint32_t )0x00020000 )
#define  RCC_APB2ENR_TIM9EN                  ( ( uint32_t )0x00010000 )

/********************  Bit definition for RCC_AHB1LPENR register  *************/
#define  RCC_AHB1LPENR_GPIOALPEN             ( ( uint32_t )0x00000001 )
#define  RCC_AHB1LPENR_GPIOBLPEN             ( ( uint32_t )0x00000002 )
#define  RCC_AHB1LPENR_GPIOCLPEN             ( ( uint32_t )0x00000004 )
#define  RCC_AHB1LPENR_GPIODLPEN             ( ( uint32_t )0x00000008 )
#define  RCC_AHB1LPENR_GPIOELPEN             ( ( uint32_t )0x00000010 )
#define  RCC_AHB1LPENR_GPIOFLPEN             ( ( uint32_t )0x00000020 )
#define  RCC_AHB1LPENR_GPIOGLPEN             ( ( uint32_t )0x00000040 )
#define  RCC_AHB1LPENR_GPIOHLPEN             ( ( uint32_t )0x00000080 )
#define  RCC_AHB1LPENR_GPIOILPEN             ( ( uint32_t )0x00000100 )
#define  RCC_AHB1LPENR_CRCLPEN               ( ( uint32_t )0x00001000 )
#define  RCC_AHB1LPENR_FLITFLPEN             ( ( uint32_t )0x00008000 )
#define  RCC_AHB1LPENR_SRAM1LPEN             ( ( uint32_t )0x00010000 )
#define  RCC_AHB1LPENR_SRAM2LPEN             ( ( uint32_t )0x00020000 )
#define  RCC_AHB1LPENR_BKPSRAMLPEN           ( ( uint32_t )0x00040000 )
#define  RCC_AHB1LPENR_DMA1LPEN              ( ( uint32_t )0x00200000 )
#define  RCC_AHB1LPENR_DMA2LPEN              ( ( uint32_t )0x00400000 )
#define  RCC_AHB1LPENR_ETHMACLPEN            ( ( uint32_t )0x02000000 )
#define  RCC_AHB1LPENR_ETHMACTXLPEN          ( ( uint32_t )0x04000000 )
#define  RCC_AHB1LPENR_ETHMACRXLPEN          ( ( uint32_t )0x08000000 )
#define  RCC_AHB1LPENR_ETHMACPTPLPEN         ( ( uint32_t )0x10000000 )
#define  RCC_AHB1LPENR_OTGHSLPEN             ( ( uint32_t )0x20000000 )
#define  RCC_AHB1LPENR_OTGHSULPILPEN         ( ( uint32_t )0x40000000 )

/********************  Bit definition for RCC_AHB2LPENR register  *************/
#define  RCC_AHB2LPENR_DCMILPEN              ( ( uint32_t )0x00000001 )
#define  RCC_AHB2LPENR_CRYPLPEN              ( ( uint32_t )0x00000010 )
#define  RCC_AHB2LPENR_HASHLPEN              ( ( uint32_t )0x00000020 )
#define  RCC_AHB2LPENR_RNGLPEN               ( ( uint32_t )0x00000040 )
#define  RCC_AHB2LPENR_OTGFSLPEN             ( ( uint32_t )0x00000080 )

/********************  Bit definition for RCC_AHB3LPENR register  *************/
#define  RCC_AHB3LPENR_FSMCLPEN              ( ( uint32_t )0x00000001 )

/********************  Bit definition for RCC_APB1LPENR register  *************/
#define  RCC_APB1LPENR_TIM2LPEN              ( ( uint32_t )0x00000001 )
#define  RCC_APB1LPENR_TIM3LPEN              ( ( uint32_t )0x00000002 )
#define  RCC_APB1LPENR_TIM4LPEN              ( ( uint32_t )0x00000004 )
#define  RCC_APB1LPENR_TIM5LPEN              ( ( uint32_t )0x00000008 )
#define  RCC_APB1LPENR_TIM6LPEN              ( ( uint32_t )0x00000010 )
#define  RCC_APB1LPENR_TIM7LPEN              ( ( uint32_t )0x00000020 )
#define  RCC_APB1LPENR_TIM12LPEN             ( ( uint32_t )0x00000040 )
#define  RCC_APB1LPENR_TIM13LPEN             ( ( uint32_t )0x00000080 )
#define  RCC_APB1LPENR_TIM14LPEN             ( ( uint32_t )0x00000100 )
#define  RCC_APB1LPENR_WWDGLPEN              ( ( uint32_t )0x00000800 )
#define  RCC_APB1LPENR_SPI2LPEN              ( ( uint32_t )0x00004000 )
#define  RCC_APB1LPENR_SPI3LPEN              ( ( uint32_t )0x00008000 )
#define  RCC_APB1LPENR_USART2LPEN            ( ( uint32_t )0x00020000 )
#define  RCC_APB1LPENR_USART3LPEN            ( ( uint32_t )0x00040000 )
#define  RCC_APB1LPENR_UART4LPEN             ( ( uint32_t )0x00080000 )
#define  RCC_APB1LPENR_UART5LPEN             ( ( uint32_t )0x00100000 )
#define  RCC_APB1LPENR_I2C1LPEN              ( ( uint32_t )0x00200000 )
#define  RCC_APB1LPENR_I2C2LPEN              ( ( uint32_t )0x00400000 )
#define  RCC_APB1LPENR_I2C3LPEN              ( ( uint32_t )0x00800000 )
#define  RCC_APB1LPENR_CAN1LPEN              ( ( uint32_t )0x02000000 )
#define  RCC_APB1LPENR_CAN2LPEN              ( ( uint32_t )0x04000000 )
#define  RCC_APB1LPENR_PWRLPEN               ( ( uint32_t )0x10000000 )
#define  RCC_APB1LPENR_DACLPEN               ( ( uint32_t )0x20000000 )

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define  RCC_APB2LPENR_TIM1LPEN              ( ( uint32_t )0x00000001 )
#define  RCC_APB2LPENR_TIM8LPEN              ( ( uint32_t )0x00000002 )
#define  RCC_APB2LPENR_USART1LPEN            ( ( uint32_t )0x00000010 )
#define  RCC_APB2LPENR_USART6LPEN            ( ( uint32_t )0x00000020 )
#define  RCC_APB2LPENR_ADC1LPEN              ( ( uint32_t )0x00000100 )
#define  RCC_APB2LPENR_ADC2PEN               ( ( uint32_t )0x00000200 )
#define  RCC_APB2LPENR_ADC3LPEN              ( ( uint32_t )0x00000400 )
#define  RCC_APB2LPENR_SDIOLPEN              ( ( uint32_t )0x00000800 )
#define  RCC_APB2LPENR_SPI1LPEN              ( ( uint32_t )0x00001000 )
#define  RCC_APB2LPENR_SYSCFGLPEN            ( ( uint32_t )0x00004000 )
#define  RCC_APB2LPENR_TIM9LPEN              ( ( uint32_t )0x00010000 )
#define  RCC_APB2LPENR_TIM10LPEN             ( ( uint32_t )0x00020000 )
#define  RCC_APB2LPENR_TIM11LPEN             ( ( uint32_t )0x00040000 )

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      ( ( uint32_t )0x00000001 )
#define  RCC_BDCR_LSERDY                     ( ( uint32_t )0x00000002 )
#define  RCC_BDCR_LSEBYP                     ( ( uint32_t )0x00000004 )

