etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  RCC_BDCR_RTCSEL                    ( ( uint32_t )0x00000300 )
#define  RCC_BDCR_RTCSEL_0                  ( ( uint32_t )0x00000100 )
#define  RCC_BDCR_RTCSEL_1                  ( ( uint32_t )0x00000200 )

#define  RCC_BDCR_RTCEN                      ( ( uint32_t )0x00008000 )
#define  RCC_BDCR_BDRST                      ( ( uint32_t )0x00010000 )

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ( ( uint32_t )0x00000001 )
#define  RCC_CSR_LSIRDY                      ( ( uint32_t )0x00000002 )
#define  RCC_CSR_RMVF                        ( ( uint32_t )0x01000000 )
#define  RCC_CSR_BORRSTF                     ( ( uint32_t )0x02000000 )
#define  RCC_CSR_PADRSTF                     ( ( uint32_t )0x04000000 )
#define  RCC_CSR_PORRSTF                     ( ( uint32_t )0x08000000 )
#define  RCC_CSR_SFTRSTF                     ( ( uint32_t )0x10000000 )
#define  RCC_CSR_WDGRSTF                     ( ( uint32_t )0x20000000 )
#define  RCC_CSR_WWDGRSTF                    ( ( uint32_t )0x40000000 )
#define  RCC_CSR_LPWRRSTF                    ( ( uint32_t )0x80000000 )

/********************  Bit definition for RCC_SSCGR register  *****************/
#define  RCC_SSCGR_MODPER                    ( ( uint32_t )0x00001FFF )
#define  RCC_SSCGR_INCSTEP                   ( ( uint32_t )0x0FFFE000 )
#define  RCC_SSCGR_SPREADSEL                 ( ( uint32_t )0x40000000 )
#define  RCC_SSCGR_SSCGEN                    ( ( uint32_t )0x80000000 )

/********************  Bit definition for RCC_PLLI2SCFGR register  ************/
#define  RCC_PLLI2SCFGR_PLLI2SN              ( ( uint32_t )0x00007FC0 )
#define  RCC_PLLI2SCFGR_PLLI2SR              ( ( uint32_t )0x70000000 )

/* ****************************************************************************
  
                                      RNG
  
  ****************************************************************************
  *******************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ( ( uint32_t )0x00000004 )
#define RNG_CR_IE                            ( ( uint32_t )0x00000008 )

/********************  Bits definition for RNG_SR register  *******************/
#define RNG_SR_DRDY                          ( ( uint32_t )0x00000001 )
#define RNG_SR_CECS                          ( ( uint32_t )0x00000002 )
#define RNG_SR_SECS                          ( ( uint32_t )0x00000004 )
#define RNG_SR_CEIS                          ( ( uint32_t )0x00000020 )
#define RNG_SR_SEIS                          ( ( uint32_t )0x00000040 )

/* ****************************************************************************
  
                             Real-Time Clock (RTC)
  
  ****************************************************************************
  *******************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ( ( uint32_t )0x00400000 )
#define RTC_TR_HT                            ( ( uint32_t )0x00300000 )
#define RTC_TR_HT_0                          ( ( uint32_t )0x00100000 )
#define RTC_TR_HT_1                          ( ( uint32_t )0x00200000 )
#define RTC_TR_HU                            ( ( uint32_t )0x000F0000 )
#define RTC_TR_HU_0                          ( ( uint32_t )0x00010000 )
#define RTC_TR_HU_1                          ( ( uint32_t )0x00020000 )
#define RTC_TR_HU_2                          ( ( uint32_t )0x00040000 )
#define RTC_TR_HU_3                          ( ( uint32_t )0x00080000 )
#define RTC_TR_MNT                           ( ( uint32_t )0x00007000 )
#define RTC_TR_MNT_0                         ( ( uint32_t )0x00001000 )
#define RTC_TR_MNT_1                         ( ( uint32_t )0x00002000 )
#define RTC_TR_MNT_2                         ( ( uint32_t )0x00004000 )
#define RTC_TR_MNU                           ( ( uint32_t )0x00000F00 )
#define RTC_TR_MNU_0                         ( ( uint32_t )0x00000100 )
#define RTC_TR_MNU_1                         ( ( uint32_t )0x00000200 )
#define RTC_TR_MNU_2                         ( ( uint32_t )0x00000400 )
#define RTC_TR_MNU_3                         ( ( uint32_t )0x00000800 )
#define RTC_TR_ST                            ( ( uint32_t )0x00000070 )
#define RTC_TR_ST_0                          ( ( uint32_t )0x00000010 )
#define RTC_TR_ST_1                          ( ( uint32_t )0x00000020 )
#define RTC_TR_ST_2                          ( ( uint32_t )0x00000040 )
#define RTC_TR_SU                            ( ( uint32_t )0x0000000F )
#define RTC_TR_SU_0                          ( ( uint32_t )0x00000001 )
#define RTC_TR_SU_1                          ( ( uint32_t )0x00000002 )
#define RTC_TR_SU_2                          ( ( uint32_t )0x00000004 )
#define RTC_TR_SU_3                          ( ( uint32_t )0x00000008 )

/********************  Bits definition for RTC_DR register  *******************/
#define RTC_DR_YT                            ( ( uint32_t )0x00F00000 )
#define RTC_DR_YT_0                          ( ( uint32_t )0x00100000 )
#define RTC_DR_YT_1                          ( ( uint32_t )0x00200000 )
#define RTC_DR_YT_2                          ( ( uint32_t )0x00400000 )
#define RTC_DR_YT_3                          ( ( uint32_t )0x00800000 )
#define RTC_DR_YU                            ( ( uint32_t )0x000F0000 )
#define RTC_DR_YU_0                          ( ( uint32_t )0x00010000 )
#define RTC_DR_YU_1                          ( ( uint32_t )0x00020000 )
#define RTC_DR_YU_2                          ( ( uint32_t )0x00040000 )
#define RTC_DR_YU_3                          ( ( uint32_t )0x00080000 )
#define RTC_DR_WDU                           ( ( uint32_t )0x0000E000 )
#define RTC_DR_WDU_0                         ( ( uint32_t )0x00002000 )
#define RTC_DR_WDU_1                         ( ( uint32_t )0x00004000 )
#define RTC_DR_WDU_2                         ( ( uint32_t )0x00008000 )
#define RTC_DR_MT                            ( ( uint32_t )0x00001000 )
#define RTC_DR_MU                            ( ( uint32_t )0x00000F00 )
#define RTC_DR_MU_0                          ( ( uint32_t )0x00000100 )
#define RTC_DR_MU_1                          ( ( uint32_t )0x00000200 )
#define RTC_DR_MU_2                          ( ( uint32_t )0x00000400 )
#define RTC_DR_MU_3                          ( ( uint32_t )0x00000800 )
#define RTC_DR_DT                            ( ( uint32_t )0x00000030 )
#define RTC_DR_DT_0                          ( ( uint32_t )0x00000010 )
#define RTC_DR_DT_1                          ( ( uint32_t )0x00000020 )
#define RTC_DR_DU                            ( ( uint32_t )0x0000000F )
#define RTC_DR_DU_0                          ( ( uint32_t )0x00000001 )
#define RTC_DR_DU_1                          ( ( uint32_t )0x00000002 )
#define RTC_DR_DU_2                          ( ( uint32_t )0x00000004 )
#define RTC_DR_DU_3                          ( ( uint32_t )0x00000008 )

/********************  Bits definition for RTC_CR register  *******************/
#define RTC_CR_COE                           ( ( uint32_t )0x00800000 )
#define RTC_CR_OSEL                          ( ( uint32_t )0x00600000 )
#define RTC_CR_OSEL_0                        ( ( uint32_t )0x00200000 )
#define RTC_CR_OSEL_1                        ( ( uint32_t )0x00400000 )
#define RTC_CR_POL                           ( ( uint32_t )0x00100000 )
#define RTC_CR_COSEL                         ( ( uint32_t )0x00080000 )
#define RTC_CR_BCK                           ( ( uint32_t )0x00040000 )
#define RTC_CR_SUB1H                         ( ( uint32_t )0x00020000 )
#define RTC_CR_ADD1H                         ( ( uint32_t )0x00010000 )
#define RTC_CR_TSIE                          ( ( uint32_t )0x00008000 )
#define RTC_CR_WUTIE                         ( ( uint32_t )0x00004000 )
#define RTC_CR_ALRBIE                        ( ( uint32_t )0x00002000 )
#define RTC_CR_ALRAIE                        ( ( uint32_t )0x00001000 )
#define RTC_CR_TSE                           ( ( uint32_t )0x00000800 )
#define RTC_CR_WUTE                          ( ( uint32_t )0x00000400 )
#define RTC_CR_ALRBE                         ( ( uint32_t )0x00000200 )
#define RTC_CR_ALRAE                         ( ( uint32_t )0x00000100 )
#define RTC_CR_DCE                           ( ( uint32_t )0x00000080 )
#define RTC_CR_FMT                           ( ( uint32_t )0x00000040 )
#define RTC_CR_BYPSHAD                       ( ( uint32_t )0x00000020 )
#define RTC_CR_REFCKON                       ( ( uint32_t )0x00000010 )
#define RTC_CR_TSEDGE                        ( ( uint32_t )0x00000008 )
#define RTC_CR_WUCKSEL                       ( ( uint32_t )0x00000007 )
#define RTC_CR_WUCKSEL_0                     ( ( uint32_t )0x00000001 )
#define RTC_CR_WUCKSEL_1                     ( ( uint32_t )0x00000002 )
#define RTC_CR_WUCKSEL_2                     ( ( uint32_t )0x00000004 )

/********************  Bits definition for RTC_ISR register  ******************/
#define RTC_ISR_RECALPF                      ( ( uint32_t )0x00010000 )
#define RTC_ISR_TAMP1F                       ( ( uint32_t )0x00002000 )
#define RTC_ISR_TSOVF                        ( ( uint32_t )0x00001000 )
#define RTC_ISR_TSF                          ( ( uint32_t )0x00000800 )
#define RTC_ISR_WUTF                         ( ( uint32_t )0x00000400 )
#define RTC_ISR_ALRBF                        ( ( uint32_t )0x00000200 )
#define RTC_ISR_ALRAF                        ( ( uint32_t )0x00000100 )
#define RTC_ISR_INIT                         ( ( uint32_t )0x00000080 )
#define RTC_ISR_INITF                        ( ( uint32_t )0x00000040 )
#define RTC_ISR_RSF                          ( ( uint32_t )0x00000020 )
#define RTC_ISR_INITS                        ( ( uint32_t )0x00000010 )
#define RTC_ISR_SHPF                         ( ( uint32_t )0x00000008 )
#define RTC_ISR_WUTWF                        ( ( uint32_t )0x00000004 )
#define RTC_ISR_ALRBWF                       ( ( uint32_t )0x00000002 )
#define RTC_ISR_ALRAWF                       ( ( uint32_t )0x00000001 )

