etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bits definition for RTC_PRER register  *****************/
#define RTC_PRER_PREDIV_A                    ( ( uint32_t )0x007F0000 )
#define RTC_PRER_PREDIV_S                    ( ( uint32_t )0x00001FFF )

/********************  Bits definition for RTC_WUTR register  *****************/
#define RTC_WUTR_WUT                         ( ( uint32_t )0x0000FFFF )

/********************  Bits definition for RTC_CALIBR register  ***************/
#define RTC_CALIBR_DCS                       ( ( uint32_t )0x00000080 )
#define RTC_CALIBR_DC                        ( ( uint32_t )0x0000001F )

/********************  Bits definition for RTC_ALRMAR register  ***************/
#define RTC_ALRMAR_MSK4                      ( ( uint32_t )0x80000000 )
#define RTC_ALRMAR_WDSEL                     ( ( uint32_t )0x40000000 )
#define RTC_ALRMAR_DT                        ( ( uint32_t )0x30000000 )
#define RTC_ALRMAR_DT_0                      ( ( uint32_t )0x10000000 )
#define RTC_ALRMAR_DT_1                      ( ( uint32_t )0x20000000 )
#define RTC_ALRMAR_DU                        ( ( uint32_t )0x0F000000 )
#define RTC_ALRMAR_DU_0                      ( ( uint32_t )0x01000000 )
#define RTC_ALRMAR_DU_1                      ( ( uint32_t )0x02000000 )
#define RTC_ALRMAR_DU_2                      ( ( uint32_t )0x04000000 )
#define RTC_ALRMAR_DU_3                      ( ( uint32_t )0x08000000 )
#define RTC_ALRMAR_MSK3                      ( ( uint32_t )0x00800000 )
#define RTC_ALRMAR_PM                        ( ( uint32_t )0x00400000 )
#define RTC_ALRMAR_HT                        ( ( uint32_t )0x00300000 )
#define RTC_ALRMAR_HT_0                      ( ( uint32_t )0x00100000 )
#define RTC_ALRMAR_HT_1                      ( ( uint32_t )0x00200000 )
#define RTC_ALRMAR_HU                        ( ( uint32_t )0x000F0000 )
#define RTC_ALRMAR_HU_0                      ( ( uint32_t )0x00010000 )
#define RTC_ALRMAR_HU_1                      ( ( uint32_t )0x00020000 )
#define RTC_ALRMAR_HU_2                      ( ( uint32_t )0x00040000 )
#define RTC_ALRMAR_HU_3                      ( ( uint32_t )0x00080000 )
#define RTC_ALRMAR_MSK2                      ( ( uint32_t )0x00008000 )
#define RTC_ALRMAR_MNT                       ( ( uint32_t )0x00007000 )
#define RTC_ALRMAR_MNT_0                     ( ( uint32_t )0x00001000 )
#define RTC_ALRMAR_MNT_1                     ( ( uint32_t )0x00002000 )
#define RTC_ALRMAR_MNT_2                     ( ( uint32_t )0x00004000 )
#define RTC_ALRMAR_MNU                       ( ( uint32_t )0x00000F00 )
#define RTC_ALRMAR_MNU_0                     ( ( uint32_t )0x00000100 )
#define RTC_ALRMAR_MNU_1                     ( ( uint32_t )0x00000200 )
#define RTC_ALRMAR_MNU_2                     ( ( uint32_t )0x00000400 )
#define RTC_ALRMAR_MNU_3                     ( ( uint32_t )0x00000800 )
#define RTC_ALRMAR_MSK1                      ( ( uint32_t )0x00000080 )
#define RTC_ALRMAR_ST                        ( ( uint32_t )0x00000070 )
#define RTC_ALRMAR_ST_0                      ( ( uint32_t )0x00000010 )
#define RTC_ALRMAR_ST_1                      ( ( uint32_t )0x00000020 )
#define RTC_ALRMAR_ST_2                      ( ( uint32_t )0x00000040 )
#define RTC_ALRMAR_SU                        ( ( uint32_t )0x0000000F )
#define RTC_ALRMAR_SU_0                      ( ( uint32_t )0x00000001 )
#define RTC_ALRMAR_SU_1                      ( ( uint32_t )0x00000002 )
#define RTC_ALRMAR_SU_2                      ( ( uint32_t )0x00000004 )
#define RTC_ALRMAR_SU_3                      ( ( uint32_t )0x00000008 )

/********************  Bits definition for RTC_ALRMBR register  ***************/
#define RTC_ALRMBR_MSK4                      ( ( uint32_t )0x80000000 )
#define RTC_ALRMBR_WDSEL                     ( ( uint32_t )0x40000000 )
#define RTC_ALRMBR_DT                        ( ( uint32_t )0x30000000 )
#define RTC_ALRMBR_DT_0                      ( ( uint32_t )0x10000000 )
#define RTC_ALRMBR_DT_1                      ( ( uint32_t )0x20000000 )
#define RTC_ALRMBR_DU                        ( ( uint32_t )0x0F000000 )
#define RTC_ALRMBR_DU_0                      ( ( uint32_t )0x01000000 )
#define RTC_ALRMBR_DU_1                      ( ( uint32_t )0x02000000 )
#define RTC_ALRMBR_DU_2                      ( ( uint32_t )0x04000000 )
#define RTC_ALRMBR_DU_3                      ( ( uint32_t )0x08000000 )
#define RTC_ALRMBR_MSK3                      ( ( uint32_t )0x00800000 )
#define RTC_ALRMBR_PM                        ( ( uint32_t )0x00400000 )
#define RTC_ALRMBR_HT                        ( ( uint32_t )0x00300000 )
#define RTC_ALRMBR_HT_0                      ( ( uint32_t )0x00100000 )
#define RTC_ALRMBR_HT_1                      ( ( uint32_t )0x00200000 )
#define RTC_ALRMBR_HU                        ( ( uint32_t )0x000F0000 )
#define RTC_ALRMBR_HU_0                      ( ( uint32_t )0x00010000 )
#define RTC_ALRMBR_HU_1                      ( ( uint32_t )0x00020000 )
#define RTC_ALRMBR_HU_2                      ( ( uint32_t )0x00040000 )
#define RTC_ALRMBR_HU_3                      ( ( uint32_t )0x00080000 )
#define RTC_ALRMBR_MSK2                      ( ( uint32_t )0x00008000 )
#define RTC_ALRMBR_MNT                       ( ( uint32_t )0x00007000 )
#define RTC_ALRMBR_MNT_0                     ( ( uint32_t )0x00001000 )
#define RTC_ALRMBR_MNT_1                     ( ( uint32_t )0x00002000 )
#define RTC_ALRMBR_MNT_2                     ( ( uint32_t )0x00004000 )
#define RTC_ALRMBR_MNU                       ( ( uint32_t )0x00000F00 )
#define RTC_ALRMBR_MNU_0                     ( ( uint32_t )0x00000100 )
#define RTC_ALRMBR_MNU_1                     ( ( uint32_t )0x00000200 )
#define RTC_ALRMBR_MNU_2                     ( ( uint32_t )0x00000400 )
#define RTC_ALRMBR_MNU_3                     ( ( uint32_t )0x00000800 )
#define RTC_ALRMBR_MSK1                      ( ( uint32_t )0x00000080 )
#define RTC_ALRMBR_ST                        ( ( uint32_t )0x00000070 )
#define RTC_ALRMBR_ST_0                      ( ( uint32_t )0x00000010 )
#define RTC_ALRMBR_ST_1                      ( ( uint32_t )0x00000020 )
#define RTC_ALRMBR_ST_2                      ( ( uint32_t )0x00000040 )
#define RTC_ALRMBR_SU                        ( ( uint32_t )0x0000000F )
#define RTC_ALRMBR_SU_0                      ( ( uint32_t )0x00000001 )
#define RTC_ALRMBR_SU_1                      ( ( uint32_t )0x00000002 )
#define RTC_ALRMBR_SU_2                      ( ( uint32_t )0x00000004 )
#define RTC_ALRMBR_SU_3                      ( ( uint32_t )0x00000008 )

