etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS                  ( ( uint32_t )0x0F000000 )
#define RTC_ALRMASSR_MASKSS_0                ( ( uint32_t )0x01000000 )
#define RTC_ALRMASSR_MASKSS_1                ( ( uint32_t )0x02000000 )
#define RTC_ALRMASSR_MASKSS_2                ( ( uint32_t )0x04000000 )
#define RTC_ALRMASSR_MASKSS_3                ( ( uint32_t )0x08000000 )
#define RTC_ALRMASSR_SS                      ( ( uint32_t )0x00007FFF )

/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_MASKSS                  ( ( uint32_t )0x0F000000 )
#define RTC_ALRMBSSR_MASKSS_0                ( ( uint32_t )0x01000000 )
#define RTC_ALRMBSSR_MASKSS_1                ( ( uint32_t )0x02000000 )
#define RTC_ALRMBSSR_MASKSS_2                ( ( uint32_t )0x04000000 )
#define RTC_ALRMBSSR_MASKSS_3                ( ( uint32_t )0x08000000 )
#define RTC_ALRMBSSR_SS                      ( ( uint32_t )0x00007FFF )

/********************  Bits definition for RTC_BKP0R register  ****************/
#define RTC_BKP0R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP1R register  ****************/
#define RTC_BKP1R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP2R register  ****************/
#define RTC_BKP2R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP3R register  ****************/
#define RTC_BKP3R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP4R register  ****************/
#define RTC_BKP4R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP5R register  ****************/
#define RTC_BKP5R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP6R register  ****************/
#define RTC_BKP6R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP7R register  ****************/
#define RTC_BKP7R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP8R register  ****************/
#define RTC_BKP8R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP9R register  ****************/
#define RTC_BKP9R                            ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP10R register  ***************/
#define RTC_BKP10R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP11R register  ***************/
#define RTC_BKP11R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP12R register  ***************/
#define RTC_BKP12R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP13R register  ***************/
#define RTC_BKP13R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP14R register  ***************/
#define RTC_BKP14R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP15R register  ***************/
#define RTC_BKP15R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP16R register  ***************/
#define RTC_BKP16R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP17R register  ***************/
#define RTC_BKP17R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP18R register  ***************/
#define RTC_BKP18R                           ( ( uint32_t )0xFFFFFFFF )

/********************  Bits definition for RTC_BKP19R register  ***************/
#define RTC_BKP19R                           ( ( uint32_t )0xFFFFFFFF )

/* ****************************************************************************
  
                            SD host Interface
  
  ****************************************************************************
  *****************  Bit definition for SDIO_POWER register  ******************/
#define  SDIO_POWER_PWRCTRL                  ( ( uint8_t )0x03 )				/*!<PWRCTRL[1:0] bits (Power supply
																				   control bits) */
#define  SDIO_POWER_PWRCTRL_0                ( ( uint8_t )0x01 )				/*!<Bit 0 */
#define  SDIO_POWER_PWRCTRL_1                ( ( uint8_t )0x02 )				/*!<Bit 1 */

/******************  Bit definition for SDIO_CLKCR register  ******************/
#define  SDIO_CLKCR_CLKDIV                   ( ( uint16_t )0x00FF )				/*!<Clock divide factor */
#define  SDIO_CLKCR_CLKEN                    ( ( uint16_t )0x0100 )				/*!<Clock enable bit */
#define  SDIO_CLKCR_PWRSAV                   ( ( uint16_t )0x0200 )				/*!<Power saving configuration bit */
#define  SDIO_CLKCR_BYPASS                   ( ( uint16_t )0x0400 )				/*!<Clock divider bypass enable bit */

#define  SDIO_CLKCR_WIDBUS                   ( ( uint16_t )0x1800 )				/*!<WIDBUS[1:0] bits (Wide bus mode
																				   enable bit) */
#define  SDIO_CLKCR_WIDBUS_0                 ( ( uint16_t )0x0800 )				/*!<Bit 0 */
#define  SDIO_CLKCR_WIDBUS_1                 ( ( uint16_t )0x1000 )				/*!<Bit 1 */

#define  SDIO_CLKCR_NEGEDGE                  ( ( uint16_t )0x2000 )				/*!<SDIO_CK dephasing selection bit */
#define  SDIO_CLKCR_HWFC_EN                  ( ( uint16_t )0x4000 )				/*!<HW Flow Control enable */

/*******************  Bit definition for SDIO_ARG register  *******************/
#define  SDIO_ARG_CMDARG                     ( ( uint32_t )0xFFFFFFFF )				/*!<Command argument */

/*******************  Bit definition for SDIO_CMD register  *******************/
#define  SDIO_CMD_CMDINDEX                   ( ( uint16_t )0x003F )				/*!<Command Index */

#define  SDIO_CMD_WAITRESP                   ( ( uint16_t )0x00C0 )				/*!<WAITRESP[1:0] bits (Wait for
																				   response bits) */
#define  SDIO_CMD_WAITRESP_0                 ( ( uint16_t )0x0040 )				/*!< Bit 0 */
#define  SDIO_CMD_WAITRESP_1                 ( ( uint16_t )0x0080 )				/*!< Bit 1 */

