etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  SDIO_CMD_WAITINT                    ( ( uint16_t )0x0100 )				/*!<CPSM Waits for Interrupt Request */
#define  SDIO_CMD_WAITPEND                   ( ( uint16_t )0x0200 )				/*!<CPSM Waits for ends of data transfer
																				   (CmdPend internal signal) */
#define  SDIO_CMD_CPSMEN                     ( ( uint16_t )0x0400 )				/*!<Command path state machine (CPSM)
																				   Enable bit */
#define  SDIO_CMD_SDIOSUSPEND                ( ( uint16_t )0x0800 )				/*!<SD I/O suspend command */
#define  SDIO_CMD_ENCMDCOMPL                 ( ( uint16_t )0x1000 )				/*!<Enable CMD completion */
#define  SDIO_CMD_NIEN                       ( ( uint16_t )0x2000 )				/*!<Not Interrupt Enable */
#define  SDIO_CMD_CEATACMD                   ( ( uint16_t )0x4000 )				/*!<CE-ATA command */

/*****************  Bit definition for SDIO_RESPCMD register  *****************/
#define  SDIO_RESPCMD_RESPCMD                ( ( uint8_t )0x3F )				/*!<Response command index */

/******************  Bit definition for SDIO_RESP0 register  ******************/
#define  SDIO_RESP0_CARDSTATUS0              ( ( uint32_t )0xFFFFFFFF )			/*!<Card Status */

/******************  Bit definition for SDIO_RESP1 register  ******************/
#define  SDIO_RESP1_CARDSTATUS1              ( ( uint32_t )0xFFFFFFFF )			/*!<Card Status */

/******************  Bit definition for SDIO_RESP2 register  ******************/
#define  SDIO_RESP2_CARDSTATUS2              ( ( uint32_t )0xFFFFFFFF )			/*!<Card Status */

/******************  Bit definition for SDIO_RESP3 register  ******************/
#define  SDIO_RESP3_CARDSTATUS3              ( ( uint32_t )0xFFFFFFFF )			/*!<Card Status */

/******************  Bit definition for SDIO_RESP4 register  ******************/
#define  SDIO_RESP4_CARDSTATUS4              ( ( uint32_t )0xFFFFFFFF )			/*!<Card Status */

/******************  Bit definition for SDIO_DTIMER register  *****************/
#define  SDIO_DTIMER_DATATIME                ( ( uint32_t )0xFFFFFFFF )			/*!<Data timeout period. */

/******************  Bit definition for SDIO_DLEN register  *******************/
#define  SDIO_DLEN_DATALENGTH                ( ( uint32_t )0x01FFFFFF )			/*!<Data length value */

/******************  Bit definition for SDIO_DCTRL register  ******************/
#define  SDIO_DCTRL_DTEN                     ( ( uint16_t )0x0001 )				/*!<Data transfer enabled bit */
#define  SDIO_DCTRL_DTDIR                    ( ( uint16_t )0x0002 )				/*!<Data transfer direction selection */
#define  SDIO_DCTRL_DTMODE                   ( ( uint16_t )0x0004 )				/*!<Data transfer mode selection */
#define  SDIO_DCTRL_DMAEN                    ( ( uint16_t )0x0008 )				/*!<DMA enabled bit */

#define  SDIO_DCTRL_DBLOCKSIZE               ( ( uint16_t )0x00F0 )				/*!<DBLOCKSIZE[3:0] bits (Data block
																				   size) */
#define  SDIO_DCTRL_DBLOCKSIZE_0             ( ( uint16_t )0x0010 )				/*!<Bit 0 */
#define  SDIO_DCTRL_DBLOCKSIZE_1             ( ( uint16_t )0x0020 )				/*!<Bit 1 */
#define  SDIO_DCTRL_DBLOCKSIZE_2             ( ( uint16_t )0x0040 )				/*!<Bit 2 */
#define  SDIO_DCTRL_DBLOCKSIZE_3             ( ( uint16_t )0x0080 )				/*!<Bit 3 */

#define  SDIO_DCTRL_RWSTART                  ( ( uint16_t )0x0100 )				/*!<Read wait start */
#define  SDIO_DCTRL_RWSTOP                   ( ( uint16_t )0x0200 )				/*!<Read wait stop */
#define  SDIO_DCTRL_RWMOD                    ( ( uint16_t )0x0400 )				/*!<Read wait mode */
#define  SDIO_DCTRL_SDIOEN                   ( ( uint16_t )0x0800 )				/*!<SD I/O enable functions */

/******************  Bit definition for SDIO_DCOUNT register  *****************/
#define  SDIO_DCOUNT_DATACOUNT               ( ( uint32_t )0x01FFFFFF )			/*!<Data count value */

/******************  Bit definition for SDIO_STA register  ********************/
#define  SDIO_STA_CCRCFAIL                   ( ( uint32_t )0x00000001 )			/*!<Command response received (CRC check
																				   failed) */
#define  SDIO_STA_DCRCFAIL                   ( ( uint32_t )0x00000002 )			/*!<Data block sent/received (CRC check
																				   failed) */
#define  SDIO_STA_CTIMEOUT                   ( ( uint32_t )0x00000004 )			/*!<Command response timeout */
#define  SDIO_STA_DTIMEOUT                   ( ( uint32_t )0x00000008 )			/*!<Data timeout */
#define  SDIO_STA_TXUNDERR                   ( ( uint32_t )0x00000010 )			/*!<Transmit FIFO underrun error */
#define  SDIO_STA_RXOVERR                    ( ( uint32_t )0x00000020 )			/*!<Received FIFO overrun error */
#define  SDIO_STA_CMDREND                    ( ( uint32_t )0x00000040 )			/*!<Command response received (CRC check
																				   passed) */
#define  SDIO_STA_CMDSENT                    ( ( uint32_t )0x00000080 )			/*!<Command sent (no response required)
																				   */
#define  SDIO_STA_DATAEND                    ( ( uint32_t )0x00000100 )			/*!<Data end (data counter, SDIDCOUNT,
																				   is zero) */
#define  SDIO_STA_STBITERR                   ( ( uint32_t )0x00000200 )			/*!<Start bit not detected on all data
																				   signals in wide bus mode */
#define  SDIO_STA_DBCKEND                    ( ( uint32_t )0x00000400 )			/*!<Data block sent/received (CRC check
																				   passed) */
#define  SDIO_STA_CMDACT                     ( ( uint32_t )0x00000800 )			/*!<Command transfer in progress */
#define  SDIO_STA_TXACT                      ( ( uint32_t )0x00001000 )			/*!<Data transmit in progress */
#define  SDIO_STA_RXACT                      ( ( uint32_t )0x00002000 )			/*!<Data receive in progress */
#define  SDIO_STA_TXFIFOHE                   ( ( uint32_t )0x00004000 )			/*!<Transmit FIFO Half Empty: at least 8
																				   words can be written into the FIFO */
#define  SDIO_STA_RXFIFOHF                   ( ( uint32_t )0x00008000 )			/*!<Receive FIFO Half Full: there are at
																				   least 8 words in the FIFO */
#define  SDIO_STA_TXFIFOF                    ( ( uint32_t )0x00010000 )			/*!<Transmit FIFO full */
#define  SDIO_STA_RXFIFOF                    ( ( uint32_t )0x00020000 )			/*!<Receive FIFO full */
#define  SDIO_STA_TXFIFOE                    ( ( uint32_t )0x00040000 )			/*!<Transmit FIFO empty */
#define  SDIO_STA_RXFIFOE                    ( ( uint32_t )0x00080000 )			/*!<Receive FIFO empty */
#define  SDIO_STA_TXDAVL                     ( ( uint32_t )0x00100000 )			/*!<Data available in transmit FIFO */
#define  SDIO_STA_RXDAVL                     ( ( uint32_t )0x00200000 )			/*!<Data available in receive FIFO */
#define  SDIO_STA_SDIOIT                     ( ( uint32_t )0x00400000 )			/*!<SDIO interrupt received */
#define  SDIO_STA_CEATAEND                   ( ( uint32_t )0x00800000 )			/*!<CE-ATA command completion signal
																				   received for CMD61 */

/*******************  Bit definition for SDIO_ICR register  *******************/
#define  SDIO_ICR_CCRCFAILC                  ( ( uint32_t )0x00000001 )			/*!<CCRCFAIL flag clear bit */
#define  SDIO_ICR_DCRCFAILC                  ( ( uint32_t )0x00000002 )			/*!<DCRCFAIL flag clear bit */
#define  SDIO_ICR_CTIMEOUTC                  ( ( uint32_t )0x00000004 )			/*!<CTIMEOUT flag clear bit */
#define  SDIO_ICR_DTIMEOUTC                  ( ( uint32_t )0x00000008 )			/*!<DTIMEOUT flag clear bit */
#define  SDIO_ICR_TXUNDERRC                  ( ( uint32_t )0x00000010 )			/*!<TXUNDERR flag clear bit */
#define  SDIO_ICR_RXOVERRC                   ( ( uint32_t )0x00000020 )			/*!<RXOVERR flag clear bit */
#define  SDIO_ICR_CMDRENDC                   ( ( uint32_t )0x00000040 )			/*!<CMDREND flag clear bit */
#define  SDIO_ICR_CMDSENTC                   ( ( uint32_t )0x00000080 )			/*!<CMDSENT flag clear bit */
#define  SDIO_ICR_DATAENDC                   ( ( uint32_t )0x00000100 )			/*!<DATAEND flag clear bit */
#define  SDIO_ICR_STBITERRC                  ( ( uint32_t )0x00000200 )			/*!<STBITERR flag clear bit */
#define  SDIO_ICR_DBCKENDC                   ( ( uint32_t )0x00000400 )			/*!<DBCKEND flag clear bit */
#define  SDIO_ICR_SDIOITC                    ( ( uint32_t )0x00400000 )			/*!<SDIOIT flag clear bit */
#define  SDIO_ICR_CEATAENDC                  ( ( uint32_t )0x00800000 )			/*!<CEATAEND flag clear bit */

/******************  Bit definition for SDIO_MASK register  *******************/
#define  SDIO_MASK_CCRCFAILIE                ( ( uint32_t )0x00000001 )			/*!<Command CRC Fail Interrupt Enable */
#define  SDIO_MASK_DCRCFAILIE                ( ( uint32_t )0x00000002 )			/*!<Data CRC Fail Interrupt Enable */
#define  SDIO_MASK_CTIMEOUTIE                ( ( uint32_t )0x00000004 )			/*!<Command TimeOut Interrupt Enable */
#define  SDIO_MASK_DTIMEOUTIE                ( ( uint32_t )0x00000008 )			/*!<Data TimeOut Interrupt Enable */
#define  SDIO_MASK_TXUNDERRIE                ( ( uint32_t )0x00000010 )			/*!<Tx FIFO UnderRun Error Interrupt
																				   Enable */
#define  SDIO_MASK_RXOVERRIE                 ( ( uint32_t )0x00000020 )			/*!<Rx FIFO OverRun Error Interrupt
																				   Enable */
#define  SDIO_MASK_CMDRENDIE                 ( ( uint32_t )0x00000040 )			/*!<Command Response Received Interrupt
																				   Enable */
#define  SDIO_MASK_CMDSENTIE                 ( ( uint32_t )0x00000080 )			/*!<Command Sent Interrupt Enable */
#define  SDIO_MASK_DATAENDIE                 ( ( uint32_t )0x00000100 )			/*!<Data End Interrupt Enable */
#define  SDIO_MASK_STBITERRIE                ( ( uint32_t )0x00000200 )			/*!<Start Bit Error Interrupt Enable */
#define  SDIO_MASK_DBCKENDIE                 ( ( uint32_t )0x00000400 )			/*!<Data Block End Interrupt Enable */
#define  SDIO_MASK_CMDACTIE                  ( ( uint32_t )0x00000800 )			/*!<CCommand Acting Interrupt Enable */
#define  SDIO_MASK_TXACTIE                   ( ( uint32_t )0x00001000 )			/*!<Data Transmit Acting Interrupt
																				   Enable */
#define  SDIO_MASK_RXACTIE                   ( ( uint32_t )0x00002000 )			/*!<Data receive acting interrupt
																				   enabled */
#define  SDIO_MASK_TXFIFOHEIE                ( ( uint32_t )0x00004000 )			/*!<Tx FIFO Half Empty interrupt Enable
																				   */
#define  SDIO_MASK_RXFIFOHFIE                ( ( uint32_t )0x00008000 )			/*!<Rx FIFO Half Full interrupt Enable
																				   */
#define  SDIO_MASK_TXFIFOFIE                 ( ( uint32_t )0x00010000 )			/*!<Tx FIFO Full interrupt Enable */
#define  SDIO_MASK_RXFIFOFIE                 ( ( uint32_t )0x00020000 )			/*!<Rx FIFO Full interrupt Enable */
#define  SDIO_MASK_TXFIFOEIE                 ( ( uint32_t )0x00040000 )			/*!<Tx FIFO Empty interrupt Enable */
#define  SDIO_MASK_RXFIFOEIE                 ( ( uint32_t )0x00080000 )			/*!<Rx FIFO Empty interrupt Enable */
#define  SDIO_MASK_TXDAVLIE                  ( ( uint32_t )0x00100000 )			/*!<Data available in Tx FIFO interrupt
																				   Enable */
#define  SDIO_MASK_RXDAVLIE                  ( ( uint32_t )0x00200000 )			/*!<Data available in Rx FIFO interrupt
																				   Enable */
#define  SDIO_MASK_SDIOITIE                  ( ( uint32_t )0x00400000 )			/*!<SDIO Mode Interrupt Received
																				   interrupt Enable */
#define  SDIO_MASK_CEATAENDIE                ( ( uint32_t )0x00800000 )			/*!<CE-ATA command completion signal
																				   received Interrupt Enable */

/*****************  Bit definition for SDIO_FIFOCNT register  *****************/
#define  SDIO_FIFOCNT_FIFOCOUNT              ( ( uint32_t )0x00FFFFFF )			/*!<Remaining number of words to be
																				   written to or read from the FIFO */

/******************  Bit definition for SDIO_FIFO register  *******************/
#define  SDIO_FIFO_FIFODATA                  ( ( uint32_t )0xFFFFFFFF )			/*!<Receive and transmit FIFO data */

