etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* ****************************************************************************
  
                                   SYSCFG
  
  ****************************************************************************
  *****************  Bit definition for SYSCFG_MEMRMP register  ***************/
#define SYSCFG_MEMRMP_MEM_MODE          ( ( uint32_t )0x00000003 )	/*!<SYSCFG_Memory Remap Config */
#define SYSCFG_MEMRMP_MEM_MODE_0        ( ( uint32_t )0x00000001 )
#define SYSCFG_MEMRMP_MEM_MODE_1        ( ( uint32_t )0x00000002 )

/******************  Bit definition for SYSCFG_PMC register  ******************/
#define SYSCFG_PMC_MII_RMII_SEL         ( ( uint32_t )0x00800000 )	/*!<Ethernet PHY interface selection */
/* Old MII_RMII_SEL bit definition, maintained for legacy purpose */
#define SYSCFG_PMC_MII_RMII             SYSCFG_PMC_MII_RMII_SEL

/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0            ( ( uint16_t )0x000F )	/*!<EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1            ( ( uint16_t )0x00F0 )	/*!<EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2            ( ( uint16_t )0x0F00 )	/*!<EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3            ( ( uint16_t )0xF000 )	/*!<EXTI 3 configuration */
/**
 * @brief   EXTI0 configuration
 */
#define SYSCFG_EXTICR1_EXTI0_PA         ( ( uint16_t )0x0000 )	/*!<PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB         ( ( uint16_t )0x0001 )	/*!<PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC         ( ( uint16_t )0x0002 )	/*!<PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD         ( ( uint16_t )0x0003 )	/*!<PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE         ( ( uint16_t )0x0004 )	/*!<PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PF         ( ( uint16_t )0x0005 )	/*!<PF[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PG         ( ( uint16_t )0x0006 )	/*!<PG[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PH         ( ( uint16_t )0x0007 )	/*!<PH[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PI         ( ( uint16_t )0x0008 )	/*!<PI[0] pin */
/**
 * @brief   EXTI1 configuration
 */
#define SYSCFG_EXTICR1_EXTI1_PA         ( ( uint16_t )0x0000 )	/*!<PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB         ( ( uint16_t )0x0010 )	/*!<PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC         ( ( uint16_t )0x0020 )	/*!<PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD         ( ( uint16_t )0x0030 )	/*!<PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE         ( ( uint16_t )0x0040 )	/*!<PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PF         ( ( uint16_t )0x0050 )	/*!<PF[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PG         ( ( uint16_t )0x0060 )	/*!<PG[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PH         ( ( uint16_t )0x0070 )	/*!<PH[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PI         ( ( uint16_t )0x0080 )	/*!<PI[1] pin */
/**
 * @brief   EXTI2 configuration
 */
#define SYSCFG_EXTICR1_EXTI2_PA         ( ( uint16_t )0x0000 )	/*!<PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB         ( ( uint16_t )0x0100 )	/*!<PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC         ( ( uint16_t )0x0200 )	/*!<PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD         ( ( uint16_t )0x0300 )	/*!<PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE         ( ( uint16_t )0x0400 )	/*!<PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PF         ( ( uint16_t )0x0500 )	/*!<PF[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PG         ( ( uint16_t )0x0600 )	/*!<PG[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PH         ( ( uint16_t )0x0700 )	/*!<PH[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PI         ( ( uint16_t )0x0800 )	/*!<PI[2] pin */
/**
 * @brief   EXTI3 configuration
 */
#define SYSCFG_EXTICR1_EXTI3_PA         ( ( uint16_t )0x0000 )	/*!<PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB         ( ( uint16_t )0x1000 )	/*!<PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC         ( ( uint16_t )0x2000 )	/*!<PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD         ( ( uint16_t )0x3000 )	/*!<PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE         ( ( uint16_t )0x4000 )	/*!<PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PF         ( ( uint16_t )0x5000 )	/*!<PF[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PG         ( ( uint16_t )0x6000 )	/*!<PG[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PH         ( ( uint16_t )0x7000 )	/*!<PH[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PI         ( ( uint16_t )0x8000 )	/*!<PI[3] pin */

/*****************  Bit definition for SYSCFG_EXTICR2 register  ***************/
#define SYSCFG_EXTICR2_EXTI4            ( ( uint16_t )0x000F )	/*!<EXTI 4 configuration */
#define SYSCFG_EXTICR2_EXTI5            ( ( uint16_t )0x00F0 )	/*!<EXTI 5 configuration */
#define SYSCFG_EXTICR2_EXTI6            ( ( uint16_t )0x0F00 )	/*!<EXTI 6 configuration */
#define SYSCFG_EXTICR2_EXTI7            ( ( uint16_t )0xF000 )	/*!<EXTI 7 configuration */
/**
 * @brief   EXTI4 configuration
 */
#define SYSCFG_EXTICR2_EXTI4_PA         ( ( uint16_t )0x0000 )	/*!<PA[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PB         ( ( uint16_t )0x0001 )	/*!<PB[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PC         ( ( uint16_t )0x0002 )	/*!<PC[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PD         ( ( uint16_t )0x0003 )	/*!<PD[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PE         ( ( uint16_t )0x0004 )	/*!<PE[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PF         ( ( uint16_t )0x0005 )	/*!<PF[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PG         ( ( uint16_t )0x0006 )	/*!<PG[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PH         ( ( uint16_t )0x0007 )	/*!<PH[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PI         ( ( uint16_t )0x0008 )	/*!<PI[4] pin */
/**
 * @brief   EXTI5 configuration
 */
#define SYSCFG_EXTICR2_EXTI5_PA         ( ( uint16_t )0x0000 )	/*!<PA[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PB         ( ( uint16_t )0x0010 )	/*!<PB[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PC         ( ( uint16_t )0x0020 )	/*!<PC[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PD         ( ( uint16_t )0x0030 )	/*!<PD[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PE         ( ( uint16_t )0x0040 )	/*!<PE[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PF         ( ( uint16_t )0x0050 )	/*!<PF[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PG         ( ( uint16_t )0x0060 )	/*!<PG[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PH         ( ( uint16_t )0x0070 )	/*!<PH[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PI         ( ( uint16_t )0x0080 )	/*!<PI[5] pin */
/**
 * @brief   EXTI6 configuration
 */
#define SYSCFG_EXTICR2_EXTI6_PA         ( ( uint16_t )0x0000 )	/*!<PA[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PB         ( ( uint16_t )0x0100 )	/*!<PB[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PC         ( ( uint16_t )0x0200 )	/*!<PC[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PD         ( ( uint16_t )0x0300 )	/*!<PD[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PE         ( ( uint16_t )0x0400 )	/*!<PE[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PF         ( ( uint16_t )0x0500 )	/*!<PF[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PG         ( ( uint16_t )0x0600 )	/*!<PG[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PH         ( ( uint16_t )0x0700 )	/*!<PH[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PI         ( ( uint16_t )0x0800 )	/*!<PI[6] pin */
/**
 * @brief   EXTI7 configuration
 */
#define SYSCFG_EXTICR2_EXTI7_PA         ( ( uint16_t )0x0000 )	/*!<PA[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PB         ( ( uint16_t )0x1000 )	/*!<PB[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PC         ( ( uint16_t )0x2000 )	/*!<PC[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PD         ( ( uint16_t )0x3000 )	/*!<PD[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PE         ( ( uint16_t )0x4000 )	/*!<PE[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PF         ( ( uint16_t )0x5000 )	/*!<PF[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PG         ( ( uint16_t )0x6000 )	/*!<PG[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PH         ( ( uint16_t )0x7000 )	/*!<PH[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PI         ( ( uint16_t )0x8000 )	/*!<PI[7] pin */

/*****************  Bit definition for SYSCFG_EXTICR3 register  ***************/
#define SYSCFG_EXTICR3_EXTI8            ( ( uint16_t )0x000F )	/*!<EXTI 8 configuration */
#define SYSCFG_EXTICR3_EXTI9            ( ( uint16_t )0x00F0 )	/*!<EXTI 9 configuration */
#define SYSCFG_EXTICR3_EXTI10           ( ( uint16_t )0x0F00 )	/*!<EXTI 10 configuration */
#define SYSCFG_EXTICR3_EXTI11           ( ( uint16_t )0xF000 )	/*!<EXTI 11 configuration */

/**
 * @brief   EXTI8 configuration
 */
#define SYSCFG_EXTICR3_EXTI8_PA         ( ( uint16_t )0x0000 )	/*!<PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         ( ( uint16_t )0x0001 )	/*!<PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         ( ( uint16_t )0x0002 )	/*!<PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         ( ( uint16_t )0x0003 )	/*!<PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         ( ( uint16_t )0x0004 )	/*!<PE[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PF         ( ( uint16_t )0x0005 )	/*!<PF[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PG         ( ( uint16_t )0x0006 )	/*!<PG[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PH         ( ( uint16_t )0x0007 )	/*!<PH[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PI         ( ( uint16_t )0x0008 )	/*!<PI[8] pin */
/**
 * @brief   EXTI9 configuration
 */
#define SYSCFG_EXTICR3_EXTI9_PA         ( ( uint16_t )0x0000 )	/*!<PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         ( ( uint16_t )0x0010 )	/*!<PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         ( ( uint16_t )0x0020 )	/*!<PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         ( ( uint16_t )0x0030 )	/*!<PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         ( ( uint16_t )0x0040 )	/*!<PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PF         ( ( uint16_t )0x0050 )	/*!<PF[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PG         ( ( uint16_t )0x0060 )	/*!<PG[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PH         ( ( uint16_t )0x0070 )	/*!<PH[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PI         ( ( uint16_t )0x0080 )	/*!<PI[9] pin */
/**
 * @brief   EXTI10 configuration
 */
#define SYSCFG_EXTICR3_EXTI10_PA        ( ( uint16_t )0x0000 )	/*!<PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        ( ( uint16_t )0x0100 )	/*!<PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        ( ( uint16_t )0x0200 )	/*!<PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        ( ( uint16_t )0x0300 )	/*!<PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        ( ( uint16_t )0x0400 )	/*!<PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PF        ( ( uint16_t )0x0500 )	/*!<PF[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PG        ( ( uint16_t )0x0600 )	/*!<PG[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PH        ( ( uint16_t )0x0700 )	/*!<PH[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PI        ( ( uint16_t )0x0800 )	/*!<PI[10] pin */
/**
 * @brief   EXTI11 configuration
 */
#define SYSCFG_EXTICR3_EXTI11_PA        ( ( uint16_t )0x0000 )	/*!<PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        ( ( uint16_t )0x1000 )	/*!<PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        ( ( uint16_t )0x2000 )	/*!<PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        ( ( uint16_t )0x3000 )	/*!<PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        ( ( uint16_t )0x4000 )	/*!<PE[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PF        ( ( uint16_t )0x5000 )	/*!<PF[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PG        ( ( uint16_t )0x6000 )	/*!<PG[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PH        ( ( uint16_t )0x7000 )	/*!<PH[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PI        ( ( uint16_t )0x8000 )	/*!<PI[11] pin */

/*****************  Bit definition for SYSCFG_EXTICR4 register  ***************/
#define SYSCFG_EXTICR4_EXTI12           ( ( uint16_t )0x000F )	/*!<EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13           ( ( uint16_t )0x00F0 )	/*!<EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14           ( ( uint16_t )0x0F00 )	/*!<EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15           ( ( uint16_t )0xF000 )	/*!<EXTI 15 configuration */
/**
 * @brief   EXTI12 configuration
 */
#define SYSCFG_EXTICR4_EXTI12_PA        ( ( uint16_t )0x0000 )	/*!<PA[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PB        ( ( uint16_t )0x0001 )	/*!<PB[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PC        ( ( uint16_t )0x0002 )	/*!<PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        ( ( uint16_t )0x0003 )	/*!<PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        ( ( uint16_t )0x0004 )	/*!<PE[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PF        ( ( uint16_t )0x0005 )	/*!<PF[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PG        ( ( uint16_t )0x0006 )	/*!<PG[12] pin */
#define SYSCFG_EXTICR3_EXTI12_PH        ( ( uint16_t )0x0007 )	/*!<PH[12] pin */
/**
 * @brief   EXTI13 configuration
 */
#define SYSCFG_EXTICR4_EXTI13_PA        ( ( uint16_t )0x0000 )	/*!<PA[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PB        ( ( uint16_t )0x0010 )	/*!<PB[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PC        ( ( uint16_t )0x0020 )	/*!<PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        ( ( uint16_t )0x0030 )	/*!<PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        ( ( uint16_t )0x0040 )	/*!<PE[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PF        ( ( uint16_t )0x0050 )	/*!<PF[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PG        ( ( uint16_t )0x0060 )	/*!<PG[13] pin */
#define SYSCFG_EXTICR3_EXTI13_PH        ( ( uint16_t )0x0070 )	/*!<PH[13] pin */
/**
 * @brief   EXTI14 configuration
 */
#define SYSCFG_EXTICR4_EXTI14_PA        ( ( uint16_t )0x0000 )	/*!<PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        ( ( uint16_t )0x0100 )	/*!<PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        ( ( uint16_t )0x0200 )	/*!<PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        ( ( uint16_t )0x0300 )	/*!<PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        ( ( uint16_t )0x0400 )	/*!<PE[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PF        ( ( uint16_t )0x0500 )	/*!<PF[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PG        ( ( uint16_t )0x0600 )	/*!<PG[14] pin */
#define SYSCFG_EXTICR3_EXTI14_PH        ( ( uint16_t )0x0700 )	/*!<PH[14] pin */
/**
 * @brief   EXTI15 configuration
 */
#define SYSCFG_EXTICR4_EXTI15_PA        ( ( uint16_t )0x0000 )	/*!<PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        ( ( uint16_t )0x1000 )	/*!<PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        ( ( uint16_t )0x2000 )	/*!<PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        ( ( uint16_t )0x3000 )	/*!<PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        ( ( uint16_t )0x4000 )	/*!<PE[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PF        ( ( uint16_t )0x5000 )	/*!<PF[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PG        ( ( uint16_t )0x6000 )	/*!<PG[15] pin */
#define SYSCFG_EXTICR3_EXTI15_PH        ( ( uint16_t )0x7000 )	/*!<PH[15] pin */

/******************  Bit definition for SYSCFG_CMPCR register  ****************/
#define SYSCFG_CMPCR_CMP_PD             ( ( uint32_t )0x00000001 )	/*!<Compensation cell ready flag */
#define SYSCFG_CMPCR_READY              ( ( uint32_t )0x00000100 )	/*!<Compensation cell power-down */

