etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  TIM_CCMR2_IC3F                      ( ( uint16_t )0x00F0 )				/*!<IC3F[3:0] bits (Input Capture 3
																				   Filter) */
#define  TIM_CCMR2_IC3F_0                    ( ( uint16_t )0x0010 )				/*!<Bit 0 */
#define  TIM_CCMR2_IC3F_1                    ( ( uint16_t )0x0020 )				/*!<Bit 1 */
#define  TIM_CCMR2_IC3F_2                    ( ( uint16_t )0x0040 )				/*!<Bit 2 */
#define  TIM_CCMR2_IC3F_3                    ( ( uint16_t )0x0080 )				/*!<Bit 3 */

#define  TIM_CCMR2_IC4PSC                    ( ( uint16_t )0x0C00 )				/*!<IC4PSC[1:0] bits (Input Capture 4
																				   Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  ( ( uint16_t )0x0400 )				/*!<Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  ( ( uint16_t )0x0800 )				/*!<Bit 1 */

#define  TIM_CCMR2_IC4F                      ( ( uint16_t )0xF000 )				/*!<IC4F[3:0] bits (Input Capture 4
																				   Filter) */
#define  TIM_CCMR2_IC4F_0                    ( ( uint16_t )0x1000 )				/*!<Bit 0 */
#define  TIM_CCMR2_IC4F_1                    ( ( uint16_t )0x2000 )				/*!<Bit 1 */
#define  TIM_CCMR2_IC4F_2                    ( ( uint16_t )0x4000 )				/*!<Bit 2 */
#define  TIM_CCMR2_IC4F_3                    ( ( uint16_t )0x8000 )				/*!<Bit 3 */

/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CCER_CC1E                       ( ( uint16_t )0x0001 )				/*!<Capture/Compare 1 output enable */
#define  TIM_CCER_CC1P                       ( ( uint16_t )0x0002 )				/*!<Capture/Compare 1 output Polarity */
#define  TIM_CCER_CC1NE                      ( ( uint16_t )0x0004 )				/*!<Capture/Compare 1 Complementary
																				   output enable */
#define  TIM_CCER_CC1NP                      ( ( uint16_t )0x0008 )				/*!<Capture/Compare 1 Complementary
																				   output Polarity */
#define  TIM_CCER_CC2E                       ( ( uint16_t )0x0010 )				/*!<Capture/Compare 2 output enable */
#define  TIM_CCER_CC2P                       ( ( uint16_t )0x0020 )				/*!<Capture/Compare 2 output Polarity */
#define  TIM_CCER_CC2NE                      ( ( uint16_t )0x0040 )				/*!<Capture/Compare 2 Complementary
																				   output enable */
#define  TIM_CCER_CC2NP                      ( ( uint16_t )0x0080 )				/*!<Capture/Compare 2 Complementary
																				   output Polarity */
#define  TIM_CCER_CC3E                       ( ( uint16_t )0x0100 )				/*!<Capture/Compare 3 output enable */
#define  TIM_CCER_CC3P                       ( ( uint16_t )0x0200 )				/*!<Capture/Compare 3 output Polarity */
#define  TIM_CCER_CC3NE                      ( ( uint16_t )0x0400 )				/*!<Capture/Compare 3 Complementary
																				   output enable */
#define  TIM_CCER_CC3NP                      ( ( uint16_t )0x0800 )				/*!<Capture/Compare 3 Complementary
																				   output Polarity */
#define  TIM_CCER_CC4E                       ( ( uint16_t )0x1000 )				/*!<Capture/Compare 4 output enable */
#define  TIM_CCER_CC4P                       ( ( uint16_t )0x2000 )				/*!<Capture/Compare 4 output Polarity */
#define  TIM_CCER_CC4NP                      ( ( uint16_t )0x8000 )				/*!<Capture/Compare 4 Complementary
																				   output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT_CNT                         ( ( uint16_t )0xFFFF )				/*!<Counter Value */

/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC_PSC                         ( ( uint16_t )0xFFFF )				/*!<Prescaler Value */

/*******************  Bit definition for TIM_ARR register  ********************/
#define  TIM_ARR_ARR                         ( ( uint16_t )0xFFFF )				/*!<actual auto-reload Value */

/*******************  Bit definition for TIM_RCR register  ********************/
#define  TIM_RCR_REP                         ( ( uint8_t )0xFF )				/*!<Repetition Counter Value */

/*******************  Bit definition for TIM_CCR1 register  *******************/
#define  TIM_CCR1_CCR1                       ( ( uint16_t )0xFFFF )				/*!<Capture/Compare 1 Value */

/*******************  Bit definition for TIM_CCR2 register  *******************/
#define  TIM_CCR2_CCR2                       ( ( uint16_t )0xFFFF )				/*!<Capture/Compare 2 Value */

/*******************  Bit definition for TIM_CCR3 register  *******************/
#define  TIM_CCR3_CCR3                       ( ( uint16_t )0xFFFF )				/*!<Capture/Compare 3 Value */

/*******************  Bit definition for TIM_CCR4 register  *******************/
#define  TIM_CCR4_CCR4                       ( ( uint16_t )0xFFFF )				/*!<Capture/Compare 4 Value */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define  TIM_BDTR_DTG                        ( ( uint16_t )0x00FF )				/*!<DTG[0:7] bits (Dead-Time Generator
																				   set-up) */
#define  TIM_BDTR_DTG_0                      ( ( uint16_t )0x0001 )				/*!<Bit 0 */
#define  TIM_BDTR_DTG_1                      ( ( uint16_t )0x0002 )				/*!<Bit 1 */
#define  TIM_BDTR_DTG_2                      ( ( uint16_t )0x0004 )				/*!<Bit 2 */
#define  TIM_BDTR_DTG_3                      ( ( uint16_t )0x0008 )				/*!<Bit 3 */
#define  TIM_BDTR_DTG_4                      ( ( uint16_t )0x0010 )				/*!<Bit 4 */
#define  TIM_BDTR_DTG_5                      ( ( uint16_t )0x0020 )				/*!<Bit 5 */
#define  TIM_BDTR_DTG_6                      ( ( uint16_t )0x0040 )				/*!<Bit 6 */
#define  TIM_BDTR_DTG_7                      ( ( uint16_t )0x0080 )				/*!<Bit 7 */

#define  TIM_BDTR_LOCK                       ( ( uint16_t )0x0300 )				/*!<LOCK[1:0] bits (Lock Configuration)
																				   */
#define  TIM_BDTR_LOCK_0                     ( ( uint16_t )0x0100 )				/*!<Bit 0 */
#define  TIM_BDTR_LOCK_1                     ( ( uint16_t )0x0200 )				/*!<Bit 1 */

#define  TIM_BDTR_OSSI                       ( ( uint16_t )0x0400 )				/*!<Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       ( ( uint16_t )0x0800 )				/*!<Off-State Selection for Run mode */
#define  TIM_BDTR_BKE                        ( ( uint16_t )0x1000 )				/*!<Break enable */
#define  TIM_BDTR_BKP                        ( ( uint16_t )0x2000 )				/*!<Break Polarity */
#define  TIM_BDTR_AOE                        ( ( uint16_t )0x4000 )				/*!<Automatic Output enable */
#define  TIM_BDTR_MOE                        ( ( uint16_t )0x8000 )				/*!<Main Output enable */

/*******************  Bit definition for TIM_DCR register  ********************/
#define  TIM_DCR_DBA                         ( ( uint16_t )0x001F )				/*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       ( ( uint16_t )0x0001 )				/*!<Bit 0 */
#define  TIM_DCR_DBA_1                       ( ( uint16_t )0x0002 )				/*!<Bit 1 */
#define  TIM_DCR_DBA_2                       ( ( uint16_t )0x0004 )				/*!<Bit 2 */
#define  TIM_DCR_DBA_3                       ( ( uint16_t )0x0008 )				/*!<Bit 3 */
#define  TIM_DCR_DBA_4                       ( ( uint16_t )0x0010 )				/*!<Bit 4 */

#define  TIM_DCR_DBL                         ( ( uint16_t )0x1F00 )				/*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       ( ( uint16_t )0x0100 )				/*!<Bit 0 */
#define  TIM_DCR_DBL_1                       ( ( uint16_t )0x0200 )				/*!<Bit 1 */
#define  TIM_DCR_DBL_2                       ( ( uint16_t )0x0400 )				/*!<Bit 2 */
#define  TIM_DCR_DBL_3                       ( ( uint16_t )0x0800 )				/*!<Bit 3 */
#define  TIM_DCR_DBL_4                       ( ( uint16_t )0x1000 )				/*!<Bit 4 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define  TIM_DMAR_DMAB                       ( ( uint16_t )0xFFFF )				/*!<DMA register for burst accesses */

/*******************  Bit definition for TIM_OR register  *********************/
#define TIM_OR_TI4_RMP                       ( ( uint16_t )0x00C0 )				/*!<TI4_RMP[1:0] bits (TIM5 Input 4
																				   remap) */
#define TIM_OR_TI4_RMP_0                     ( ( uint16_t )0x0040 )				/*!<Bit 0 */
#define TIM_OR_TI4_RMP_1                     ( ( uint16_t )0x0080 )				/*!<Bit 1 */
#define TIM_OR_ITR1_RMP                      ( ( uint16_t )0x0C00 )				/*!<ITR1_RMP[1:0] bits (TIM2 Internal
																				   trigger 1 remap) */
#define TIM_OR_ITR1_RMP_0                    ( ( uint16_t )0x0400 )				/*!<Bit 0 */
#define TIM_OR_ITR1_RMP_1                    ( ( uint16_t )0x0800 )				/*!<Bit 1 */


