etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
#define  USART_GTPR_GT                       ( ( uint16_t )0xFF00 )				/*!<Guard time value */

/* ****************************************************************************
  
                              Window WATCHDOG
  
  ****************************************************************************
  ******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           ( ( uint8_t )0x7F )				/*!<T[6:0] bits (7-Bit counter (MSB to
																				   LSB)) */
#define  WWDG_CR_T0                          ( ( uint8_t )0x01 )				/*!<Bit 0 */
#define  WWDG_CR_T1                          ( ( uint8_t )0x02 )				/*!<Bit 1 */
#define  WWDG_CR_T2                          ( ( uint8_t )0x04 )				/*!<Bit 2 */
#define  WWDG_CR_T3                          ( ( uint8_t )0x08 )				/*!<Bit 3 */
#define  WWDG_CR_T4                          ( ( uint8_t )0x10 )				/*!<Bit 4 */
#define  WWDG_CR_T5                          ( ( uint8_t )0x20 )				/*!<Bit 5 */
#define  WWDG_CR_T6                          ( ( uint8_t )0x40 )				/*!<Bit 6 */

#define  WWDG_CR_WDGA                        ( ( uint8_t )0x80 )				/*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          ( ( uint16_t )0x007F )				/*!<W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         ( ( uint16_t )0x0001 )				/*!<Bit 0 */
#define  WWDG_CFR_W1                         ( ( uint16_t )0x0002 )				/*!<Bit 1 */
#define  WWDG_CFR_W2                         ( ( uint16_t )0x0004 )				/*!<Bit 2 */
#define  WWDG_CFR_W3                         ( ( uint16_t )0x0008 )				/*!<Bit 3 */
#define  WWDG_CFR_W4                         ( ( uint16_t )0x0010 )				/*!<Bit 4 */
#define  WWDG_CFR_W5                         ( ( uint16_t )0x0020 )				/*!<Bit 5 */
#define  WWDG_CFR_W6                         ( ( uint16_t )0x0040 )				/*!<Bit 6 */

#define  WWDG_CFR_WDGTB                      ( ( uint16_t )0x0180 )				/*!<WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     ( ( uint16_t )0x0080 )				/*!<Bit 0 */
#define  WWDG_CFR_WDGTB1                     ( ( uint16_t )0x0100 )				/*!<Bit 1 */

#define  WWDG_CFR_EWI                        ( ( uint16_t )0x0200 )				/*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define  WWDG_SR_EWIF                        ( ( uint8_t )0x01 )				/*!<Early Wakeup Interrupt Flag */


/* ****************************************************************************
  
                                  DBG
  
  ****************************************************************************
  *******************  Bit definition for DBGMCU_IDCODE register  *************/
#define  DBGMCU_IDCODE_DEV_ID                ( ( uint32_t )0x00000FFF )
#define  DBGMCU_IDCODE_REV_ID                ( ( uint32_t )0xFFFF0000 )

/********************  Bit definition for DBGMCU_CR register  *****************/
#define  DBGMCU_CR_DBG_SLEEP                 ( ( uint32_t )0x00000001 )
#define  DBGMCU_CR_DBG_STOP                  ( ( uint32_t )0x00000002 )
#define  DBGMCU_CR_DBG_STANDBY               ( ( uint32_t )0x00000004 )
#define  DBGMCU_CR_TRACE_IOEN                ( ( uint32_t )0x00000020 )

#define  DBGMCU_CR_TRACE_MODE                ( ( uint32_t )0x000000C0 )
#define  DBGMCU_CR_TRACE_MODE_0              ( ( uint32_t )0x00000040 )	/*!<Bit 0 */
#define  DBGMCU_CR_TRACE_MODE_1              ( ( uint32_t )0x00000080 )	/*!<Bit 1 */

/********************  Bit definition for DBGMCU_APB1_FZ register  ************/
#define  DBGMCU_APB1_FZ_DBG_TIM2_STOP            ( ( uint32_t )0x00000001 )
#define  DBGMCU_APB1_FZ_DBG_TIM3_STOP            ( ( uint32_t )0x00000002 )
#define  DBGMCU_APB1_FZ_DBG_TIM4_STOP            ( ( uint32_t )0x00000004 )
#define  DBGMCU_APB1_FZ_DBG_TIM5_STOP            ( ( uint32_t )0x00000008 )
#define  DBGMCU_APB1_FZ_DBG_TIM6_STOP            ( ( uint32_t )0x00000010 )
#define  DBGMCU_APB1_FZ_DBG_TIM7_STOP            ( ( uint32_t )0x00000020 )
#define  DBGMCU_APB1_FZ_DBG_TIM12_STOP           ( ( uint32_t )0x00000040 )
#define  DBGMCU_APB1_FZ_DBG_TIM13_STOP           ( ( uint32_t )0x00000080 )
#define  DBGMCU_APB1_FZ_DBG_TIM14_STOP           ( ( uint32_t )0x00000100 )
#define  DBGMCU_APB1_FZ_DBG_RTC_STOP             ( ( uint32_t )0x00000400 )
#define  DBGMCU_APB1_FZ_DBG_WWDG_STOP            ( ( uint32_t )0x00000800 )
#define  DBGMCU_APB1_FZ_DBG_IWDG_STOP            ( ( uint32_t )0x00001000 )
#define  DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT   ( ( uint32_t )0x00200000 )
#define  DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT   ( ( uint32_t )0x00400000 )
#define  DBGMCU_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT   ( ( uint32_t )0x00800000 )
#define  DBGMCU_APB1_FZ_DBG_CAN1_STOP            ( ( uint32_t )0x02000000 )
#define  DBGMCU_APB1_FZ_DBG_CAN2_STOP            ( ( uint32_t )0x04000000 )
/* Old IWDGSTOP bit definition, maintained for legacy purpose */
#define  DBGMCU_APB1_FZ_DBG_IWDEG_STOP           DBGMCU_APB1_FZ_DBG_IWDG_STOP

/********************  Bit definition for DBGMCU_APB2_FZ register  ************/
#define  DBGMCU_APB1_FZ_DBG_TIM1_STOP        ( ( uint32_t )0x00000001 )
#define  DBGMCU_APB1_FZ_DBG_TIM8_STOP        ( ( uint32_t )0x00000002 )
#define  DBGMCU_APB1_FZ_DBG_TIM9_STOP        ( ( uint32_t )0x00010000 )
#define  DBGMCU_APB1_FZ_DBG_TIM10_STOP       ( ( uint32_t )0x00020000 )
#define  DBGMCU_APB1_FZ_DBG_TIM11_STOP       ( ( uint32_t )0x00040000 )

/* ****************************************************************************
  
                  Ethernet MAC Registers bits definitions
  
  ****************************************************************************
   Bit definition for Ethernet MAC Control Register register*/
#define ETH_MACCR_WD      ( ( uint32_t )0x00800000 )	/* Watchdog disable */
#define ETH_MACCR_JD      ( ( uint32_t )0x00400000 )	/* Jabber disable */
#define ETH_MACCR_IFG     ( ( uint32_t )0x000E0000 )	/* Inter-frame gap */
#define ETH_MACCR_IFG_96Bit     ( ( uint32_t )0x00000000 )	/* Minimum IFG between frames during transmission is 96Bit
															   */
  #define ETH_MACCR_IFG_88Bit     ( ( uint32_t )0x00020000 )	/* Minimum IFG between frames during transmission is
																   88Bit */
  #define ETH_MACCR_IFG_80Bit     ( ( uint32_t )0x00040000 )	/* Minimum IFG between frames during transmission is
																   80Bit */
  #define ETH_MACCR_IFG_72Bit     ( ( uint32_t )0x00060000 )	/* Minimum IFG between frames during transmission is
																   72Bit */
  #define ETH_MACCR_IFG_64Bit     ( ( uint32_t )0x00080000 )	/* Minimum IFG between frames during transmission is
																   64Bit */
  #define ETH_MACCR_IFG_56Bit     ( ( uint32_t )0x000A0000 )	/* Minimum IFG between frames during transmission is
																   56Bit */
  #define ETH_MACCR_IFG_48Bit     ( ( uint32_t )0x000C0000 )	/* Minimum IFG between frames during transmission is
																   48Bit */
  #define ETH_MACCR_IFG_40Bit     ( ( uint32_t )0x000E0000 )	/* Minimum IFG between frames during transmission is
																   40Bit */
#define ETH_MACCR_CSD     ( ( uint32_t )0x00010000 )	/* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES     ( ( uint32_t )0x00004000 )	/* Fast ethernet speed */
#define ETH_MACCR_ROD     ( ( uint32_t )0x00002000 )	/* Receive own disable */
#define ETH_MACCR_LM      ( ( uint32_t )0x00001000 )	/* loopback mode */
#define ETH_MACCR_DM      ( ( uint32_t )0x00000800 )	/* Duplex mode */
#define ETH_MACCR_IPCO    ( ( uint32_t )0x00000400 )	/* IP Checksum offload */
#define ETH_MACCR_RD      ( ( uint32_t )0x00000200 )	/* Retry disable */
#define ETH_MACCR_APCS    ( ( uint32_t )0x00000080 )	/* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL      ( ( uint32_t )0x00000060 )	/* Back-off limit: random integer number (r) of slot time delays
														   before rescheduling
														     a transmission attempt during retries after a collision: 0
														        =< r <2^k */
  #define ETH_MACCR_BL_10    ( ( uint32_t )0x00000000 )	/* k = min (n, 10) */
  #define ETH_MACCR_BL_8     ( ( uint32_t )0x00000020 )	/* k = min (n, 8) */
  #define ETH_MACCR_BL_4     ( ( uint32_t )0x00000040 )	/* k = min (n, 4) */
  #define ETH_MACCR_BL_1     ( ( uint32_t )0x00000060 )	/* k = min (n, 1) */
#define ETH_MACCR_DC      ( ( uint32_t )0x00000010 )	/* Defferal check */
#define ETH_MACCR_TE      ( ( uint32_t )0x00000008 )	/* Transmitter enable */
#define ETH_MACCR_RE      ( ( uint32_t )0x00000004 )	/* Receiver enable */

