etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* Bit definition for Ethernet MAC Interrupt Mask Register */
#define ETH_MACIMR_TSTIM     ( ( uint32_t )0x00000200 )	/* Time stamp trigger interrupt mask */
#define ETH_MACIMR_PMTIM     ( ( uint32_t )0x00000008 )	/* PMT interrupt mask */

/* Bit definition for Ethernet MAC Address0 High Register */
#define ETH_MACA0HR_MACA0H   ( ( uint32_t )0x0000FFFF )	/* MAC address0 high */

/* Bit definition for Ethernet MAC Address0 Low Register */
#define ETH_MACA0LR_MACA0L   ( ( uint32_t )0xFFFFFFFF )	/* MAC address0 low */

/* Bit definition for Ethernet MAC Address1 High Register */
#define ETH_MACA1HR_AE       ( ( uint32_t )0x80000000 )	/* Address enable */
#define ETH_MACA1HR_SA       ( ( uint32_t )0x40000000 )	/* Source address */
#define ETH_MACA1HR_MBC      ( ( uint32_t )0x3F000000 )	/* Mask byte control: bits to mask for comparison of the MAC
														   Address bytes */
  #define ETH_MACA1HR_MBC_HBits15_8    ( ( uint32_t )0x20000000 )	/* Mask MAC Address high reg bits [15:8] */
  #define ETH_MACA1HR_MBC_HBits7_0     ( ( uint32_t )0x10000000 )	/* Mask MAC Address high reg bits [7:0] */
  #define ETH_MACA1HR_MBC_LBits31_24   ( ( uint32_t )0x08000000 )	/* Mask MAC Address low reg bits [31:24] */
  #define ETH_MACA1HR_MBC_LBits23_16   ( ( uint32_t )0x04000000 )	/* Mask MAC Address low reg bits [23:16] */
  #define ETH_MACA1HR_MBC_LBits15_8    ( ( uint32_t )0x02000000 )	/* Mask MAC Address low reg bits [15:8] */
  #define ETH_MACA1HR_MBC_LBits7_0     ( ( uint32_t )0x01000000 )	/* Mask MAC Address low reg bits [7:0] */
#define ETH_MACA1HR_MACA1H   ( ( uint32_t )0x0000FFFF )	/* MAC address1 high */

/* Bit definition for Ethernet MAC Address1 Low Register */
#define ETH_MACA1LR_MACA1L   ( ( uint32_t )0xFFFFFFFF )	/* MAC address1 low */

/* Bit definition for Ethernet MAC Address2 High Register */
#define ETH_MACA2HR_AE       ( ( uint32_t )0x80000000 )	/* Address enable */
#define ETH_MACA2HR_SA       ( ( uint32_t )0x40000000 )	/* Source address */
#define ETH_MACA2HR_MBC      ( ( uint32_t )0x3F000000 )	/* Mask byte control */
  #define ETH_MACA2HR_MBC_HBits15_8    ( ( uint32_t )0x20000000 )	/* Mask MAC Address high reg bits [15:8] */
  #define ETH_MACA2HR_MBC_HBits7_0     ( ( uint32_t )0x10000000 )	/* Mask MAC Address high reg bits [7:0] */
  #define ETH_MACA2HR_MBC_LBits31_24   ( ( uint32_t )0x08000000 )	/* Mask MAC Address low reg bits [31:24] */
  #define ETH_MACA2HR_MBC_LBits23_16   ( ( uint32_t )0x04000000 )	/* Mask MAC Address low reg bits [23:16] */
  #define ETH_MACA2HR_MBC_LBits15_8    ( ( uint32_t )0x02000000 )	/* Mask MAC Address low reg bits [15:8] */
  #define ETH_MACA2HR_MBC_LBits7_0     ( ( uint32_t )0x01000000 )	/* Mask MAC Address low reg bits [70] */
#define ETH_MACA2HR_MACA2H   ( ( uint32_t )0x0000FFFF )	/* MAC address1 high */

/* Bit definition for Ethernet MAC Address2 Low Register */
#define ETH_MACA2LR_MACA2L   ( ( uint32_t )0xFFFFFFFF )	/* MAC address2 low */

/* Bit definition for Ethernet MAC Address3 High Register */
#define ETH_MACA3HR_AE       ( ( uint32_t )0x80000000 )	/* Address enable */
#define ETH_MACA3HR_SA       ( ( uint32_t )0x40000000 )	/* Source address */
#define ETH_MACA3HR_MBC      ( ( uint32_t )0x3F000000 )	/* Mask byte control */
  #define ETH_MACA3HR_MBC_HBits15_8    ( ( uint32_t )0x20000000 )	/* Mask MAC Address high reg bits [15:8] */
  #define ETH_MACA3HR_MBC_HBits7_0     ( ( uint32_t )0x10000000 )	/* Mask MAC Address high reg bits [7:0] */
  #define ETH_MACA3HR_MBC_LBits31_24   ( ( uint32_t )0x08000000 )	/* Mask MAC Address low reg bits [31:24] */
  #define ETH_MACA3HR_MBC_LBits23_16   ( ( uint32_t )0x04000000 )	/* Mask MAC Address low reg bits [23:16] */
  #define ETH_MACA3HR_MBC_LBits15_8    ( ( uint32_t )0x02000000 )	/* Mask MAC Address low reg bits [15:8] */
  #define ETH_MACA3HR_MBC_LBits7_0     ( ( uint32_t )0x01000000 )	/* Mask MAC Address low reg bits [70] */
#define ETH_MACA3HR_MACA3H   ( ( uint32_t )0x0000FFFF )	/* MAC address3 high */

/* Bit definition for Ethernet MAC Address3 Low Register */
#define ETH_MACA3LR_MACA3L   ( ( uint32_t )0xFFFFFFFF )	/* MAC address3 low */

/* ****************************************************************************
                  Ethernet MMC Registers bits definition
  *****************************************************************************/

/* Bit definition for Ethernet MMC Contol Register */
#define ETH_MMCCR_MCFHP      ( ( uint32_t )0x00000020 )	/* MMC counter Full-Half preset */
#define ETH_MMCCR_MCP        ( ( uint32_t )0x00000010 )	/* MMC counter preset */
#define ETH_MMCCR_MCF        ( ( uint32_t )0x00000008 )	/* MMC Counter Freeze */
#define ETH_MMCCR_ROR        ( ( uint32_t )0x00000004 )	/* Reset on Read */
#define ETH_MMCCR_CSR        ( ( uint32_t )0x00000002 )	/* Counter Stop Rollover */
#define ETH_MMCCR_CR         ( ( uint32_t )0x00000001 )	/* Counters Reset */

/* Bit definition for Ethernet MMC Receive Interrupt Register */
#define ETH_MMCRIR_RGUFS     ( ( uint32_t )0x00020000 )	/* Set when Rx good unicast frames counter reaches half the
														   maximum value */
#define ETH_MMCRIR_RFAES     ( ( uint32_t )0x00000040 )	/* Set when Rx alignment error counter reaches half the maximum
														   value */
#define ETH_MMCRIR_RFCES     ( ( uint32_t )0x00000020 )	/* Set when Rx crc error counter reaches half the maximum value
														   */

/* Bit definition for Ethernet MMC Transmit Interrupt Register */
#define ETH_MMCTIR_TGFS      ( ( uint32_t )0x00200000 )	/* Set when Tx good frame count counter reaches half the maximum
														   value */
#define ETH_MMCTIR_TGFMSCS   ( ( uint32_t )0x00008000 )	/* Set when Tx good multi col counter reaches half the maximum
														   value */
#define ETH_MMCTIR_TGFSCS    ( ( uint32_t )0x00004000 )	/* Set when Tx good single col counter reaches half the maximum
														   value */

/* Bit definition for Ethernet MMC Receive Interrupt Mask Register */
#define ETH_MMCRIMR_RGUFM    ( ( uint32_t )0x00020000 )	/* Mask the interrupt when Rx good unicast frames counter
														   reaches half the maximum value */
#define ETH_MMCRIMR_RFAEM    ( ( uint32_t )0x00000040 )	/* Mask the interrupt when when Rx alignment error counter
														   reaches half the maximum value */
#define ETH_MMCRIMR_RFCEM    ( ( uint32_t )0x00000020 )	/* Mask the interrupt when Rx crc error counter reaches half the
														   maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Mask Register */
#define ETH_MMCTIMR_TGFM     ( ( uint32_t )0x00200000 )	/* Mask the interrupt when Tx good frame count counter reaches
														   half the maximum value */
#define ETH_MMCTIMR_TGFMSCM  ( ( uint32_t )0x00008000 )	/* Mask the interrupt when Tx good multi col counter reaches
														   half the maximum value */
#define ETH_MMCTIMR_TGFSCM   ( ( uint32_t )0x00004000 )	/* Mask the interrupt when Tx good single col counter reaches
														   half the maximum value */

/* Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
#define ETH_MMCTGFSCCR_TGFSCC     ( ( uint32_t )0xFFFFFFFF )	/* Number of successfully transmitted frames after a
																   single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
#define ETH_MMCTGFMSCCR_TGFMSCC   ( ( uint32_t )0xFFFFFFFF )	/* Number of successfully transmitted frames after more
																   than a single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames Counter Register */
#define ETH_MMCTGFCR_TGFC    ( ( uint32_t )0xFFFFFFFF )	/* Number of good frames transmitted. */

