etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F4xx/STM32F407/IAR_uC_STM32F407.h
/* Bit definition for Ethernet DMA Transmit Poll Demand Register */
#define ETH_DMATPDR_TPD      ( ( uint32_t )0xFFFFFFFF )	/* Transmit poll demand */

/* Bit definition for Ethernet DMA Receive Poll Demand Register */
#define ETH_DMARPDR_RPD      ( ( uint32_t )0xFFFFFFFF )	/* Receive poll demand  */

/* Bit definition for Ethernet DMA Receive Descriptor List Address Register */
#define ETH_DMARDLAR_SRL     ( ( uint32_t )0xFFFFFFFF )	/* Start of receive list */

/* Bit definition for Ethernet DMA Transmit Descriptor List Address Register */
#define ETH_DMATDLAR_STL     ( ( uint32_t )0xFFFFFFFF )	/* Start of transmit list */

/* Bit definition for Ethernet DMA Status Register */
#define ETH_DMASR_TSTS       ( ( uint32_t )0x20000000 )	/* Time-stamp trigger status */
#define ETH_DMASR_PMTS       ( ( uint32_t )0x10000000 )	/* PMT status */
#define ETH_DMASR_MMCS       ( ( uint32_t )0x08000000 )	/* MMC status */
#define ETH_DMASR_EBS        ( ( uint32_t )0x03800000 )	/* Error bits status */
/* combination with EBS[2:0] for GetFlagStatus function */
  #define ETH_DMASR_EBS_DescAccess      ( ( uint32_t )0x02000000 )	/* Error bits 0-data buffer, 1-desc. access */
  #define ETH_DMASR_EBS_ReadTransf      ( ( uint32_t )0x01000000 )	/* Error bits 0-write trnsf, 1-read transfr */
  #define ETH_DMASR_EBS_DataTransfTx    ( ( uint32_t )0x00800000 )	/* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMASR_TPS         ( ( uint32_t )0x00700000 )	/* Transmit process state */
  #define ETH_DMASR_TPS_Stopped         ( ( uint32_t )0x00000000 )	/* Stopped - Reset or Stop Tx Command issued  */
  #define ETH_DMASR_TPS_Fetching        ( ( uint32_t )0x00100000 )	/* Running - fetching the Tx descriptor */
  #define ETH_DMASR_TPS_Waiting         ( ( uint32_t )0x00200000 )	/* Running - waiting for status */
  #define ETH_DMASR_TPS_Reading         ( ( uint32_t )0x00300000 )	/* Running - reading the data from host memory */
  #define ETH_DMASR_TPS_Suspended       ( ( uint32_t )0x00600000 )	/* Suspended - Tx Descriptor unavailabe */
  #define ETH_DMASR_TPS_Closing         ( ( uint32_t )0x00700000 )	/* Running - closing Rx descriptor */
#define ETH_DMASR_RPS         ( ( uint32_t )0x000E0000 )	/* Receive process state */
  #define ETH_DMASR_RPS_Stopped         ( ( uint32_t )0x00000000 )	/* Stopped - Reset or Stop Rx Command issued */
  #define ETH_DMASR_RPS_Fetching        ( ( uint32_t )0x00020000 )	/* Running - fetching the Rx descriptor */
  #define ETH_DMASR_RPS_Waiting         ( ( uint32_t )0x00060000 )	/* Running - waiting for packet */
  #define ETH_DMASR_RPS_Suspended       ( ( uint32_t )0x00080000 )	/* Suspended - Rx Descriptor unavailable */
  #define ETH_DMASR_RPS_Closing         ( ( uint32_t )0x000A0000 )	/* Running - closing descriptor */
  #define ETH_DMASR_RPS_Queuing         ( ( uint32_t )0x000E0000 )	/* Running - queuing the recieve frame into host
																	   memory */
#define ETH_DMASR_NIS        ( ( uint32_t )0x00010000 )	/* Normal interrupt summary */
#define ETH_DMASR_AIS        ( ( uint32_t )0x00008000 )	/* Abnormal interrupt summary */
#define ETH_DMASR_ERS        ( ( uint32_t )0x00004000 )	/* Early receive status */
#define ETH_DMASR_FBES       ( ( uint32_t )0x00002000 )	/* Fatal bus error status */
#define ETH_DMASR_ETS        ( ( uint32_t )0x00000400 )	/* Early transmit status */
#define ETH_DMASR_RWTS       ( ( uint32_t )0x00000200 )	/* Receive watchdog timeout status */
#define ETH_DMASR_RPSS       ( ( uint32_t )0x00000100 )	/* Receive process stopped status */
#define ETH_DMASR_RBUS       ( ( uint32_t )0x00000080 )	/* Receive buffer unavailable status */
#define ETH_DMASR_RS         ( ( uint32_t )0x00000040 )	/* Receive status */
#define ETH_DMASR_TUS        ( ( uint32_t )0x00000020 )	/* Transmit underflow status */
#define ETH_DMASR_ROS        ( ( uint32_t )0x00000010 )	/* Receive overflow status */
#define ETH_DMASR_TJTS       ( ( uint32_t )0x00000008 )	/* Transmit jabber timeout status */
#define ETH_DMASR_TBUS       ( ( uint32_t )0x00000004 )	/* Transmit buffer unavailable status */
#define ETH_DMASR_TPSS       ( ( uint32_t )0x00000002 )	/* Transmit process stopped status */
#define ETH_DMASR_TS         ( ( uint32_t )0x00000001 )	/* Transmit status */

/* Bit definition for Ethernet DMA Operation Mode Register */
#define ETH_DMAOMR_DTCEFD    ( ( uint32_t )0x04000000 )	/* Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOMR_RSF       ( ( uint32_t )0x02000000 )	/* Receive store and forward */
#define ETH_DMAOMR_DFRF      ( ( uint32_t )0x01000000 )	/* Disable flushing of received frames */
#define ETH_DMAOMR_TSF       ( ( uint32_t )0x00200000 )	/* Transmit store and forward */
#define ETH_DMAOMR_FTF       ( ( uint32_t )0x00100000 )	/* Flush transmit FIFO */
#define ETH_DMAOMR_TTC       ( ( uint32_t )0x0001C000 )	/* Transmit threshold control */
  #define ETH_DMAOMR_TTC_64Bytes       ( ( uint32_t )0x00000000 )	/* threshold level of the MTL Transmit FIFO is 64
																	   Bytes */
  #define ETH_DMAOMR_TTC_128Bytes      ( ( uint32_t )0x00004000 )	/* threshold level of the MTL Transmit FIFO is 128
																	   Bytes */
  #define ETH_DMAOMR_TTC_192Bytes      ( ( uint32_t )0x00008000 )	/* threshold level of the MTL Transmit FIFO is 192
																	   Bytes */
  #define ETH_DMAOMR_TTC_256Bytes      ( ( uint32_t )0x0000C000 )	/* threshold level of the MTL Transmit FIFO is 256
																	   Bytes */
  #define ETH_DMAOMR_TTC_40Bytes       ( ( uint32_t )0x00010000 )	/* threshold level of the MTL Transmit FIFO is 40
																	   Bytes */
  #define ETH_DMAOMR_TTC_32Bytes       ( ( uint32_t )0x00014000 )	/* threshold level of the MTL Transmit FIFO is 32
																	   Bytes */
  #define ETH_DMAOMR_TTC_24Bytes       ( ( uint32_t )0x00018000 )	/* threshold level of the MTL Transmit FIFO is 24
																	   Bytes */
  #define ETH_DMAOMR_TTC_16Bytes       ( ( uint32_t )0x0001C000 )	/* threshold level of the MTL Transmit FIFO is 16
																	   Bytes */
#define ETH_DMAOMR_ST        ( ( uint32_t )0x00002000 )	/* Start/stop transmission command */
#define ETH_DMAOMR_FEF       ( ( uint32_t )0x00000080 )	/* Forward error frames */
#define ETH_DMAOMR_FUGF      ( ( uint32_t )0x00000040 )	/* Forward undersized good frames */
#define ETH_DMAOMR_RTC       ( ( uint32_t )0x00000018 )	/* receive threshold control */
  #define ETH_DMAOMR_RTC_64Bytes       ( ( uint32_t )0x00000000 )	/* threshold level of the MTL Receive FIFO is 64
																	   Bytes */
  #define ETH_DMAOMR_RTC_32Bytes       ( ( uint32_t )0x00000008 )	/* threshold level of the MTL Receive FIFO is 32
																	   Bytes */
  #define ETH_DMAOMR_RTC_96Bytes       ( ( uint32_t )0x00000010 )	/* threshold level of the MTL Receive FIFO is 96
																	   Bytes */
  #define ETH_DMAOMR_RTC_128Bytes      ( ( uint32_t )0x00000018 )	/* threshold level of the MTL Receive FIFO is 128
																	   Bytes */
#define ETH_DMAOMR_OSF       ( ( uint32_t )0x00000004 )	/* operate on second frame */
#define ETH_DMAOMR_SR        ( ( uint32_t )0x00000002 )	/* Start/stop receive */

/* Bit definition for Ethernet DMA Interrupt Enable Register */
#define ETH_DMAIER_NISE      ( ( uint32_t )0x00010000 )	/* Normal interrupt summary enable */
#define ETH_DMAIER_AISE      ( ( uint32_t )0x00008000 )	/* Abnormal interrupt summary enable */
#define ETH_DMAIER_ERIE      ( ( uint32_t )0x00004000 )	/* Early receive interrupt enable */
#define ETH_DMAIER_FBEIE     ( ( uint32_t )0x00002000 )	/* Fatal bus error interrupt enable */
#define ETH_DMAIER_ETIE      ( ( uint32_t )0x00000400 )	/* Early transmit interrupt enable */
#define ETH_DMAIER_RWTIE     ( ( uint32_t )0x00000200 )	/* Receive watchdog timeout interrupt enable */
#define ETH_DMAIER_RPSIE     ( ( uint32_t )0x00000100 )	/* Receive process stopped interrupt enable */
#define ETH_DMAIER_RBUIE     ( ( uint32_t )0x00000080 )	/* Receive buffer unavailable interrupt enable */
#define ETH_DMAIER_RIE       ( ( uint32_t )0x00000040 )	/* Receive interrupt enable */
#define ETH_DMAIER_TUIE      ( ( uint32_t )0x00000020 )	/* Transmit Underflow interrupt enable */
#define ETH_DMAIER_ROIE      ( ( uint32_t )0x00000010 )	/* Receive Overflow interrupt enable */
#define ETH_DMAIER_TJTIE     ( ( uint32_t )0x00000008 )	/* Transmit jabber timeout interrupt enable */
#define ETH_DMAIER_TBUIE     ( ( uint32_t )0x00000004 )	/* Transmit buffer unavailable interrupt enable */
#define ETH_DMAIER_TPSIE     ( ( uint32_t )0x00000002 )	/* Transmit process stopped interrupt enable */
#define ETH_DMAIER_TIE       ( ( uint32_t )0x00000001 )	/* Transmit interrupt enable */

/* Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFBOCR_OFOC   ( ( uint32_t )0x10000000 )	/* Overflow bit for FIFO overflow counter */
#define ETH_DMAMFBOCR_MFA    ( ( uint32_t )0x0FFE0000 )	/* Number of frames missed by the application */
#define ETH_DMAMFBOCR_OMFC   ( ( uint32_t )0x00010000 )	/* Overflow bit for missed frame counter */
#define ETH_DMAMFBOCR_MFC    ( ( uint32_t )0x0000FFFF )	/* Number of frames missed by the controller */

/* Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMACHTDR_HTDAP   ( ( uint32_t )0xFFFFFFFF )	/* Host transmit descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRDR_HRDAP   ( ( uint32_t )0xFFFFFFFF )	/* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTBAR_HTBAP  ( ( uint32_t )0xFFFFFFFF )	/* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRBAR_HRBAP  ( ( uint32_t )0xFFFFFFFF )	/* Host receive buffer address pointer */

/**
 * @}
 */

/**
 * @}
 */

#ifdef USE_STDPERIPH_DRIVER
  #include "stm32f4xx_conf.h"
#endif	/* USE_STDPERIPH_DRIVER */

/** @addtogroup Exported_macro
 * @{
 */

#define SET_BIT( REG, BIT )     ( ( REG ) |= ( BIT ) )

#define CLEAR_BIT( REG, BIT )   ( ( REG ) &= ~( BIT ) )

#define READ_BIT( REG, BIT )    ( ( REG ) &( BIT ) )

#define CLEAR_REG( REG )        ( ( REG ) = ( 0x0 ) )

#define WRITE_REG( REG, VAL )   ( ( REG ) = ( VAL ) )

#define READ_REG( REG )         ( ( REG ) )

#define MODIFY_REG( REG, CLEARMASK, SETMASK )  WRITE_REG( ( REG ), \
														  ( ( ( READ_REG( REG ) ) & ( ~( CLEARMASK ) ) ) | \
															( SETMASK ) ) )

/**
 * @}
 */

#ifdef __cplusplus
}
#endif	/* __cplusplus */

#endif	/* __STM32F4xx_H */

/**
 * @}
 */

/**
 * @}
 */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
